/*
 * Copyright (c) 2006-2015 David Schor (davidschor@zigwap.com), ZigWap LLC
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to
 * deal in the Software without restriction, including without limitation the
 * rights to use, copy, modify, merge, publish, distribute, sublicense, and/or
 * sell copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
 * FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS
 * IN THE SOFTWARE.
 */
#include "ctest.h"
#include "aleph.h"

CTEST(Cases_compare_simple, uneven_checks)
{
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("", "")); 
    ASSERT_NOT_EQUAL(0, a_icmp_simple_cstr_cstr("", "1")); 
    ASSERT_NOT_EQUAL(0, a_icmp_simple_cstr_cstr("1", "")); 
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("1", "1")); 
    ASSERT_NOT_EQUAL(0, a_icmp_simple_cstr_cstr("1111111111111111111", "")); 
    ASSERT_NOT_EQUAL(0, a_icmp_simple_cstr_cstr("", "1111111111111111111")); 
}

CTEST(Cases_compare_simple, basic_latin_test)
{
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("aaaaaaaaaaa", "AAAAAAAAAAA"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("A", "a"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("AbCdEfGhI", "aBcDeFgHi"));
    ASSERT_NOT_EQUAL(0, a_icmp_simple_cstr_cstr("A", "Aa"));
    ASSERT_NOT_EQUAL(0, a_icmp_simple_cstr_cstr("aA", "A"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("aaaaaaaaaaa", "AAAAAAAAAAA"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("the quick brown fox jumps over the lazy dog",
                                         "THE QUICK BROWN FOX JUMPS OVER THE LAZY DOG"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("THE QUICK BROWN FOX JUMPS OVER THE LAZY DOG",
                                         "the quick brown fox jumps over the lazy dog"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ThE QuIcK BrOwN FoX JuMpS OvEr tHe lAzY DoG",
                                         "tHe qUiCk bRoWn fOx jUmPs oVeR ThE LaZy dOg"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("tHe qUiCk bRoWn fOx jUmPs oVeR ThE LaZy dOg",
                                         "ThE QuIcK BrOwN FoX JuMpS OvEr tHe lAzY DoG"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("THE QUICK BROWN FOX JUMPS OVER THE LAZY DOG",
                                         "tHe qUiCk bRoWn fOx jUmPs oVeR ThE LaZy dOg"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("tHe qUiCk bRoWn fOx jUmPs oVeR ThE LaZy dOg",
                                         "THE QUICK BROWN FOX JUMPS OVER THE LAZY DOG"));
}

CTEST(Cases_compare_simple, extended_to_greek)
{
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ČĀĆĂĈĄĊČĀĆĂĈĄĊČĀĆĂĈĄĊČĀĆĂĈĄĊ",
                                         "čāćăĉąċčāćăĉąċčāćăĉąċčāćăĉąċ"));  
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ABCĎĊĀČĂĆĄĐĈABCĎĊĀČĂĆĄĐĈ",
                                         "abcďċāčăćąđĉabcďċāčăćąđĉ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ɃɄɅɆɈɊɌɎ",
                                         "ƀʉʌɇɉɋɍɏ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("aaaaaaaaaaa",
                                         "AAAAAAAAAAA"));
    
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("àáÂãäåæçÈÉêëÌÍîÏðñÒÓÔõö÷øùúÛÜýþŸĀĀăĂąąćĆĈĈĊċČčďĎđĐēēĕĕĖĖęęěěĝĝĞğĠġģĢĤĥħħĩĨ",
                                         "ÀáâÃÄåæÇÈéêËÌíÎïÐÑÒÓÔõÖ÷ØÙúÛÜÝÞŸāĀĂĂĄĄćĆĈĉĊċČčĎďĐĐēēĔĔĖĖęĘĚĚĝĝĞĞġġģĢĤĤħħĩĩ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ÀáÂÃÄÅÆçÈÉêËìÍîÏðñòóÔÕö÷ØùÚÛüÝþÿāāăĂąąććĉĉĊĊČčĎĎđĐĒĒĔĕĖėęĘěěĜĜĞĞĠġģģĤĥĦĦĨĨ",
                                         "ÀáÂÃÄÅÆçÈÉêËìÍîÏðñòóÔÕö÷ØùÚÛüÝþÿāāăĂąąććĉĉĊĊČčĎĎđĐĒĒĔĕĖėęĘěěĜĜĞĞĠġģģĤĥĦĦĨĨ"));

    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ğÌêĔüÂæăÒÐėćčāÉĩēđĚħÈėíġàËĈęÃĢċąĉġĘĨĤĕĂąċÕ÷āĝÖÿĎùÓÇČÔĝÏĎĞØÅÁÛěħýäēćÎÚĢÑĐÞĥ","ğÌÊĔüÂÆăòÐėĆčāéĩĒđĚĦèĖíġàËĈęãģċąĈġĘĨĥĔĂąċõ÷ĀĜÖÿďùóçčôĝïĎĞøÅáÛěĦýÄĒćîúĢÑĐþĤ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("đëČĊæěçÖćÞÍóęėáąÔÈČēÅĎĂêüÙĥØñúĤĉðŸĈĊğõćąÒĒĂéïĖÂĝĎĕĀĩÃģÛĘĦĦÝġ÷îĔğÌĜĢàÄđĠěāĨ","đëČċæĚçöćþíóęĖáĄôÈČēåďĂêÜùĥØñÚĤĉÐÿĈċĞÕĆĄÒĒăéÏĖÂĝĎĕāĩãĢûĘħĦýġ÷ÎĕĞÌĜģÀÄđĠĚāĩ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("Âċ÷ėýĠąĆĀĒĚĤĕÞĜàěçØõÄÔÏĒęĂħĨóĞÜĨĊðÃđĀÑùîúĐêĝďæČĘĂĉĥġòğåĉÉÍčďģÿĆĄÖëûÈĕáĢĖĦÌ","ÂĊ÷ĖÝġĄĆāĒĚĤĔÞĜÀĚÇøÕäôÏĒęăĦĨÓĞüĨċÐãđĀÑÙîÚĐêĝĎÆčĘăĈĥġÒĞåĈéíČĎĢÿćĄöËÛèĔáĢėħì"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ðĖĆČÝđċÚĕĘąĎĈöøĆĠÕēĥāíïĐĥĈÎÊĞĄÄĂħĜČÙ÷áěĝāĦĞĂìñėĕŸĢçĩæĨďüËÈãÞôĠĊóěÅâÉĘģÛÀÒĒ","ÐĖĆčÝđĊÚĔęĄĎĈÖØĆĠõēĥāÍïđĥĉîêğąÄăħĜčù÷ÁěĝāħğĂìñėĔŸĢÇĩÆĨĎÜëèãþÔġĊÓěåâéĘģûàÒĒ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ąÂĜĥĀĞęċėęáĒûÏÊýĥòĨĢČčĩéĎÞćāĈĜŸëġÌÅĚùĕàĆñÔĊÇØúõďħÜĔÖĄÈãđđĚÎĂÆġģĉÐĞėĂóäĦ÷ēí","ąâĜĤāĞęĊėĘáĒÛÏÊÝĥòĩģčČĨÉďÞćĀĉĜÿËĠÌåěÙĕàĆñÔĊÇØúÕďĦÜĕÖĄÈãĐđĚîăæĠĢĈÐĞėĂÓäĦ÷ēí"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ħďÀĄěĘðÓùöāõĊĒĖÃčĞĨĖĕĘĢåÚïèØďĕĦÎĠÄüĤÝ÷ĈĄÛĨæĠÂğôĝĐòĤáÇÞëĀÌćēíĆčñċĐĂêĉŸĝéĂěģ","ĦĎàąĚęðÓÙÖāõĊēėÃčğĨĖĕęģÅúÏÈØĎĕħîĠÄüĤÝ÷ĈĄÛĨÆġâĞôĜĐòĥÁÇþËāìĆĒÍĆČñċđăÊĉŸĝéĂĚĢ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ČĎęãĂĜĆêúęÌçĀćÔăØóċāĤēĤğħÆõÞÜĐĔğĉěÈá÷ĦģÎÂïēěÉąĕðËÄġåġąĝÛÒĖďöĢñČÀÙĨÝđĖĨíċĈÿ","čĎĘãĂĝćêÚĘÌçĀĆôĂØÓĊĀĤĒĥĞħæõþüđĕğĉĚèÁ÷ĦĢÎÂÏĒĚéąĕðëäġÅġĄĜûÒėďÖĢÑčÀùĨýđėĩíċĈŸ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ÏÓ÷ĜþĥĆĊĘÑăěğŸÛđġħùĆÍĈĒüĖîçÝāĈĝğĔòÁÆąęÅċÃČËÐĒĥďģêĄÈÖĖÄĩàÉĢďĐĦāĕâĚøčĨÕĂĠÚìô","ÏÓ÷ĜþĥćĊęÑăĚĞÿûđĠĦÙĆÍĈēüĖîçýĀĈĝğĔòáÆĄĘÅċÃČËÐĒĤĎĢêĄèÖėÄĩÀéĢĎđĦāĕÂĚøčĩÕĂĠÚìÔ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ÂČĊŸĤĈĄāėÙĜąěĜđĤÜģĕĘèĠåěõĐĂĨĊÒæÇČĞøēćîĆēĂáêàÖĨĦģÔďĖğ÷āĎĈíÐËĕúÃñęħÓäÞġÛýÏìé","âčĊŸĤĉąāėùĝąěĜĐĥüģĔĘÈĠÅĚÕĐĂĩĊòÆçčğØĒćÎćĒĂÁêÀöĩĦĢôĎėğ÷ĀďĈÍðëĔÚãÑĘĦÓÄþĠÛýÏÌÉ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ËĕûąĊþÓęćĂģĒĤüÁĔČÕē÷ìĞāÙęĜĉĖÔŸíøîĤĆýÒÂğĈħĚěđÃČåĜÆĎĢėĩèĄġàĊÊðúāçÑÉÄġđĩöĂĦÏď","ËĕûąċþóęĆăĢēĥÜáĔčÕē÷ìğāùĘĝĈėÔŸíØîĥĆÝòÂğĈħĚěĐãČåĜæĎĢĖĩÈąġÀċÊðúĀÇñéÄġĐĩÖĂħÏĎ"));
    
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("îÏÅùÞģæÖġôÛËèċàÎóĔĚąÔûğÐğĜ÷ðøĜÄė×čāãÆÒÁĎÕØÈĈåġþéÁĆÂóÏĔÖÇđÜĂãÌŸĒģÄďĐăęĘĚćçÍĈËēÕčêÝÀĄúÒýÑÜùßÌÉÍÚêÂĀÑĖĊ","ÎïåùÞĢæöġôÛëèċÀÎÓĕěąôÛğðĞĝ÷ÐØĝÄė×ČĀãæÒáďõØèĉåġþéÁćÂóïĔÖçđÜĂÃÌÿēĢäďđĂęĘěĆÇÍĉËĒÕčÊýàąúÒýñüùßÌéÍÚÊÂāñĖċ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ĜäÔĚÂÚĀÎĄÉÄēèĘìýÆČüÀâĖêÙÊġĉĝîÃöÖĔģÃñóóúĕďòĊûõćçèþęÌÝÛÆËÒÏĄáðÅíøĠÅôÜėéõĐćğÑģË÷Ď×ăáċßùøĐčĂïĚðğþĀçĒÿàĉÍ","ĜÄôěâÚĀÎąéäĒÈęìýæČÜàÂėêùêġĈĝîãÖöĔĢÃñóóÚĕĎÒċûõćÇèþĘìýÛÆËÒïĄáÐÅíØĠåôÜėéÕĐćğñĢË÷Ď×ăÁĊßùØđČăïěðğÞāÇēÿàĉÍ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ēöėÏĎÄê÷ËÂòĜÆĠùÌģÃĘĠàÁÄāĂØÈĖĐÁćÊôęÖÓÑçÛĊüĒÈÎĂģğüòÙéðÆøÔčÚÑåþĊïĚĎûåÕāĚĉąßĆÕĜĈëýÿâčÀ×ÇéãĐÍîÍğóĄúþÐĔĕÝì","ĒÖĖÏďäÊ÷ëÂòĜÆġÙÌĢãęġàáÄĀăØèĖĐáĆêÔęÖóñÇûċüĒèîăģğÜÒùÉÐÆøôčúñåþċÏěďûåÕĀěĈąßĆõĜĈëÝÿÂČà×çéãđÍÎÍĞóąÚþðĕĔÝÌ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ëöąÛģñĠĞÀÎėÊéÞĆÔĂÒ×áĞñĘÚìðâÝŸĝÏèðĊãæõĚåïāĀíĕôĂÓæÎÃÇäÅďÇġĐćÌēĘéèüÁģûêøöÙċėĉúØĜĎËěþÒÙÄ÷ÍÂĕßÝõüēĈčČĄÀóđ","ËÖąÛĢñġĞÀîėÊÉÞćôĂò×áĞÑęÚìðâÝŸĜïèÐċÃÆÕĚåïāĀÍĕôăóÆîãÇäÅĎÇĠđĆÌēęéèÜÁģûÊøÖùċĖĉÚøĝďëěþÒÙä÷ÍâĕßÝÕüĒĈČčĄÀÓđ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ĠæùÛØÑÖÓġÊāğĘČËĝÌâĘÊćĉēþíçÉßúÄėĚđÅåĜðäöēÕîüøÀďÃÓàĆÁďïýôðûþèÜĔ×ąąĢĞĔĂĊãđÚñĊŸîÝÍõĉģôÁčÉçÈĀËÌïĂùÒòÂæ÷Ěė","ĠÆùûøÑÖÓġêāğęčËĜÌâęÊĆĉēÞíçéßúÄėĚĐÅÅĝÐäÖēõîÜøÀďÃÓàĆÁďÏýÔðûÞèÜĕ×ĄąĢğĕăċãđúñĊÿÎýÍõĉģôÁčÉçèāËÌÏăùÒÒâæ÷ěė"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ŸÛßčôùñĕÅèĒÚăóĀĚþüąäģÀÊĜÙğÃçðþáĆÉâøċĒãôõÒÐĘìÆæ÷íďĄõĐĕģÏîĉÇÖëđĎàÊñØèăęĆāėÝČÉâėáíÒġĉ×óġëÄúÌûěÎċïüğĝÅÖý","ÿÛßčôùÑĕÅÈēÚăóāĚþÜąäĢÀÊĝÙĞãÇðÞÁćéâØċēãôõÒÐĘÌæÆ÷ÍĎĄõđĔģÏîĈÇÖËđďÀÊñØÈĂĘćāėÝčéâėáíÒĠĈ×ÓġËäúÌÛĚÎċïÜĞĝÅÖý"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ñâëîõÞğćęĂÀěïÌùóģÔÉÜĒöõÅďãąėûÐéčĐÇûàßêÜèÒÙìąĊúĖíÔŸáÇĉĂÂæĊíČóñďøēÆêĔÖģĕÝòĀïđäğÎýÃëÁāĜćÈġÚ÷ġÞĘ×ěåĝĉäðø","ñâËÎÕÞğĆĘăàĚÏìùóĢÔéÜēöÕåĎÃąĖÛÐÉČđçÛàßÊüèÒÙìąĊúĖíÔÿÁçĈĂâÆċÍčóÑďØĒæêĕÖģĕÝÒāÏđÄĞîýãëÁāĝĆèġú÷ġþę×ĚÅĜĈäÐØ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ÐßÃđÅÓÖ×ÁāñÂÞÏĜĎÛÆòÿĜğĆăěþđëĠÌ÷ČëēèíċîÑĂĉôĠäÚċêÂÀģúąÄĆçąęìÆęðôûĀĚĞÕïòģãÝÕēÜĕýêÙÉÇøÎĈČĕėĎÙÓÈíÅÁĖøÖéüÀ","ÐßãđåÓÖ×áĀñÂþïĜĎÛæòŸĜĞĆĂěþđËġì÷čËĒèÍċÎÑĂĈôġäÚĊêâÀģúĄäćçąęÌÆĘÐÔÛĀěğÕïòĢÃýÕēüĔÝÊÙéçøîĈčĕĖĎùóÈÍÅÁĖøöéüÀ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ĢøÌÖĠÖĠâċÃÕģĀÉÙŸêæÈčÓåòàĎñûíěÇĔüëęĂėýğËçĄĉĐæĆÉÎÏÃĕÈßîÕØČÂýúðď×ĖÁĈùĐĆÞêċĜñÜÞòĜûäąôÏúĒēôğ÷óęÍāáðĚăÄÌàå","ģøÌÖĠÖĠÂĊãõģāÉùŸÊÆÈčóåòàĎÑûíĚÇĕÜëęĂėýğëçąĉđæćéîÏãĔèßÎÕØčâÝúðď×ėáĈùĐĆÞÊċĝÑüþòĝÛÄąôïÚēĒÔğ÷óęíĀáðěăäìàÅ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ÀĚÉĄøþáďÐþēĈÇäÏÛÔĄĀĀñÔĞ×ÖßâęëćÃèÙçÄĔéú÷ÏËĈÕćæøÖĔÎÙďÚÒėĘăÈĐčüÅģîÃÅēĠÜýċðĠÊĜÓñăČàÕĢĞĐáŸÍêÌĚóýíìĊėæĜâòû","àĚéąØÞÁďðÞĒĉçäÏûôąāĀñôğ×ÖßâĘëĆãÈÙçäĔÉú÷ÏËĈÕćæØÖĔÎùďÚòĖĘăÈđčüÅĢîãÅēĠüÝĊðĠêĜóÑăČÀÕģğĐáÿíêÌěÓýíÌĊĖÆĝâÒû"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ĘÕàÞÔÓÊòĘßĂÐØÙğ×ìčåëãĆÍÖÝõÀÚģċ÷ĚýòêĠďĜçÆĂèÑóąáÌËčÈĈđĉÿĖÖïÎúÔÆđĞĖÂāĔüÏēĕåĝÑÂěØÁíćģÛûĎüĊãäÄĀÞąÇÉēġÎùÉð","ęÕÀþÔóêÒĘßăÐØÙĞ×ìČÅëãćÍÖÝõÀÚģĊ÷ĚýÒêĠĎĝÇÆăÈÑóąáÌËčèĈđĈÿėÖïîÚÔÆđĞĖÂĀĔüïĒĕåĝÑÂěØÁíćģûûĎÜċãÄÄĀÞĄçéēġÎùÉð"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ăâñÍąÐùĆċċÎæúôÁĒöĕ×ăÒÅÒďĖúęÊßÔÑĢěĠĜĝĚđäÇ÷ÊðÓĄûæÄéĢÜÓüĀûđãÅèèčàÝÃĀìĎçėíëùìâġÁëøĉčÕĒĕĘïïğćýàÿĞøÕÉþÎöÞĉ","ĂâÑíĄðÙĆċĊîæÚôÁēÖĔ×ăòåòĎĖÚĘÊßôñĢěĠĝĜěĐäç÷ÊðóąÛÆÄÉģÜóüāûĐãÅèÈČÀÝÃĀÌĎçėÍËùÌâĠáËØĈčÕĒĔęïÏĞćÝàÿĞøÕéÞÎÖÞĉ"));
        
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("÷íĆĘõÏĘoÞJJgġcaÌLÕÆPôÊÊyKxZL[QéÏMþîIĚhÒxĢčğÛàëcùBāUĈÇÂÉànäýifqîOąÃÚYnðZØēåÚñd×ËĊÈtĄæėç^ñĚáWKMsĜeÃÛÿGVĎġÔģødHÈäF\\üăRđ_UėìĕÓĀesðĐWrTċÜA]ÁöbÓÂčĒòďÝÍĂpÙĕĆĜĞßöåĈ`V","÷íĆęÕïĘoþjJgġcAìLÕæpÔÊêykxzL[qéïmþÎiěhÒxĢČğûÀëCùbĀUĈçÂÉÀnäÝifqîOąãÚYNðZøĒåÚñD×ëĊÈTąÆėÇ^ñĚÁwkMSĜEÃÛÿgVďĠôģøDhÈÄf\\üĂrĐ_UėÌĔÓāeSÐĐWRTċÜa]ÁÖbóâČĒòďÝÍĂpÙĕćĜĞßöÅĉ`V"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ëwyÒăõÙ^O][ôÅSáTQĎÁğÓĔæPÐdÄÜęčåEÚÊäġhĐaôÑĉéèzDÂĒĆØØ_ġċĖUreėiLÀÏ÷VÆĂÓOĄsnčÑkĒéßÜĚjtþÿw`I×mfÀÒRLQçHÖFćĞęKíXÞĎíaÛÃĚxÛêÌvĀgCmĊGnÎÝyĢpÏÐ\\ĢÇĕĈÚÌîùcBÃËöýđāĝâzÈÕUbĄJĝ","ËWYÒĂõÙ^O][ôåsátqĎáğóĔÆPÐdäüęčÅEúêÄĠhđaôÑĉÉÈZdâĒĆøø_ĠċėUreėilàÏ÷VæĂÓOĄSnČÑkĒéßüějtþÿw`i×mFàÒrlqçhöFćĞękíxþĎíaÛÃĚXûêÌvĀgCmċGnîýYĢpÏð\\ģÇĔĈÚìîÙcbãËÖýĐāĜÂZèõubĄjĝ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("nÞĂĈñSnPÄvÄÑZĜ\\ÊďmèÃüÝqYiDġÙĎtĔuÀ`øĀæÖÎþĖç[_Û÷TÅíOPÏCõmCāùÇBaóČâgĠêěĈðrELÕéģċĔĄãËzqÎFĜúÏsLÈđKHwčHÐĆìxåÀĊG×óKăĖuxÛËôęeÔdòĆjOĒÒvýrĞBaŸwéáĢöìjÂğßęæfěÚÍIĐēØąü^á]y","NþăĉñSNpÄVäÑZĜ\\ÊďmÈãüýqYIDĠÙďtĕuà`ØĀæÖîÞėÇ[_Û÷tåíoPïcÕmcāÙçBAÓČÂgġêĚĈðrelõÉģċĔĄãëzQÎFĝúÏslÈđKHWČhÐĆìxÅàĊg×ÓKăėUXÛëÔęeôDòćjoĒÒVÝRĞBAŸWÉáĢÖÌjâĞßĘÆfěúíiđĒØąÜ^á]Y"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ďivEMÎéA^ìQ_øtñĠĚpîûĒOéòúÅċýjÀùċnX×ėKÜÓÏđRôûýĕâĢČPõðGwÐþÖėøVêúĐ\\ßČĎĒ÷síæcÆĞQDTąÃezĂćÙKUËziÂy]ãĠhĉģāäÊmĉíÖèubåèXALjäĄf[ĕïñloëěĝDfcbçÔàÌõÒáęćw`ŸğĜnyHăÁĘüRçóGĀÞs","ĎiVeMîéa^ÌQ_øtÑġěPîûēOéòÚåĊÝJàùĊNx×ĖkÜóÏđRôûýĕÂĢČPÕÐGWÐÞÖĖØVêÚĐ\\ßčĎĒ÷síÆcÆğqDtĄãEZĂĆùKUËZIÂY]ãĠHĉĢāäêmĈÍÖÈUbåÈxALjÄąf[ĔïÑLOËěĝdfCbÇôàìõòáęćw`ŸğĝnyhĂÁĘÜrÇógāþs"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ZÙÇtàÌĉbyÜčéĄk^ówĖÂØ`ÈXÀģ_ËďLÃäñÕîÜÁhāĒěVÞþđÑÚÐjtęÂoOĀĚćÛÒĕÇæHĊãÖrSUR[ĔIænČĢEMFjÌYzÚøÅĘWĠĝåDöDÔŸpÒNa]ùĠ÷ĞKÈaXáĞqCcvÓpĒýÎĄÍĂÉEïýĎfíÔĜMë\\ðÊsĉÕäiGUėBgÛ×ÊßïĂĆĊLĐQ","zùÇtàÌĉbYüčéąK^ÓwėÂØ`ÈXàĢ_ëĎLÃÄñõîüÁHĀĒĚVÞþĐñÚðJTęâOOĀěĆÛòĕçæHĊãÖrSuR[ĕiæNčĢEMfJÌYzÚØåęWĠĜådÖDôÿPÒnA]ÙĠ÷ĞkÈAxÁğQCcVópĒÝîĄÍĂéeÏÝďfÍÔĝmë\\ðÊSĉÕÄIGUėbGû×ÊßÏĂćĊlĐQ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ą]ĔĐêcĠMàÍóÀĊÛÌĢtïĖUËíÛåëqÑégĆĊ×čpÕùÙñēćâáØxKuXÿæì÷ÒÉyÃCvāĉþÕÜ_ßpäĈçiØĀÁyþÅúú`îÏÜmWĔehĒďÔÇÈ\\blðRêFNEěÎęAĝÆęTGÓĂjq[ģĖbďLÖòaĂkğÈÖSdÃdwôýČġąZjFĞðOoâěNvzĐsrHIÝ^Äĝ","Ą]ĕđêcġmàíÓÀċÛìĢtïĖUËÍÛåëqñéGćĊ×čPÕÙùÑĒĆÂÁØXKuXŸæì÷òéyÃcVĀĉÞõü_ßPäĉÇiøāáYÞÅúú`ÎÏüMWĕEhēďÔÇÈ\\BlðRÊFNEěÎĘAĝæĘtgÓăjQ[ģėbďlÖÒAĂkğèöSdÃDwôýČĠĄzjfĞðOOÂěnvzđSRHiÝ^äĝ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("øLõñÍáìóvwoMĝĎgFTËĜğęÐãcÖeĞ`ôĚÜY[âđhÆrîĈòpOÐfèÂWďúeÀĂþD÷ipĊüZêċîñÇĔÞxÕCSqGkëi_^ÏģàāÃùŸÍĀh]ßģéÛêçčNxJYĠÒsæANÛlēąėÅbïjTćđ×ĂRČĚèėÖÄmÝvĠĕDåĘuēÙĉ\\AÚôøÉÁìäóuąýqćzkb","øLõÑÍÁÌóVWOMĜĎgFtËĝğĘðãCÖeğ`ÔěüY[ÂđHÆrÎĈòpOÐfÈâWĎúeàăþd÷IPĊüZÊċîÑÇĕþxÕCsqGkëi_^ïģÀĀãùÿÍāh]ßĢéÛêÇčnxjYġÒSÆaNûLĒĄėÅbÏJTĆđ×ĂRČěÈĖöÄMÝvĠĕDÅęUēÙĉ\\AÚÔøéÁìÄÓUĄÝQćzKB"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("tÿ[éóTĂÀÜđeyęjÏEçğĒąèĝďYÙÞüíUqĆėáAWĔĊĔdĞìCôJäpÂflvóùoNĠXZÛąòðØĂÛñÂåÒþĆ^wïàbÕÄBßFĀÆSĎrñÃĚQÈ]đĠéģĜØċÖgVÖëSË`MýĢPcčÚaÊ×ÝOĉkkHîMãrUÌÔĘÊNdÚěhÇČGð÷xÆĒ_IáėlÕÅZÍĉ\\iÎā","Tÿ[éÓTĂàÜđEYęjÏEÇĞēĄÈĜĎyùÞÜíuQĆĖÁawĕĊĔdĞìCôjÄPÂflVÓÙonĠXZÛĄòðøĂûÑâåòþć^wïàBõÄbßFĀæsďRÑãĚqè]ĐĠÉĢĜøĊöGVÖËSë`mÝģPCčÚaÊ×ýoĉKKHîMÃrUÌÔĘÊnDúĚHÇčgð÷XæĒ_iáĖlÕÅzÍĉ\\IîĀ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ïøAĉLĘÃUåStNàĂÊõġRBüVćWj×Xp\\ĖkCmā[áġmBZÔçûïâÉĝûcääÑgÖ`ùĔíđþÐ÷ëÃeċèAì]QîOēiükďÔÎéĚÚtU_Ăúç^ÌxfĜæðóSjğĖĢßZĞÝëâVyÓhEĔFgòLDYØIÈùoĆĐÍdàąÕÅÑþčöÁRNPhýĒĢěĄĘÊŸĉÒāqÆĊWďč","ïØAĉLĘãUåsTNÀĂêõġRBüVĆwj×XP\\ĖkcMĀ[áġmBZôçÛïÂÉĝÛcääñgÖ`ÙĕíđþÐ÷ëãeċèAÌ]QîOēIüKďôÎéĚútU_ĂÚÇ^ÌXFĜÆðÓsJĞĖĢßzğýËâvYóHeĔfgÒLdYØiÈÙOćĐÍdÀĄõÅñÞČÖÁRNphýēģĚąęêÿĉòāQæĊwďč"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("gĊ[ßÌčĔêēdĢåĝPBÎøPæ`ÑĚÐzÍnàíćÈ^ÃÛÛTiðDËÙZaóÄċüãKeBÒ]cQáUeýÄcĐMôĆwďlúģQÖăđVúm_otÕL×ØoçėĄéxwèÙčăÞsÔöĘI÷ĉìĀÅñy\\ïuÿþGFąġĎēóYNÂJëÀfKğhĕáĠâĉĝêçÒîrğĖVahXüÝęÉRæJSÏĀĚõ","GĊ[ßÌčĕÊēdĢåĜpbîØPæ`ñĚÐzíNÀíćè^ãÛÛtIðDËÙZaóÄċÜãkebò]cQÁUEÝäCđMÔĆwĎlÚĢQÖăđvÚm_oTÕL×øoçėĄéXwèÙčăþsôÖęI÷ĉÌĀÅñy\\ÏuÿÞgFąĠďĒóyNâJËàFkğHĔáĠâĈĝêÇòîRğĖvAHXüÝĘÉræJSÏĀěÕ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("oåÃôànĕKċcímDjýbÈĎďÕė×sgoğkèXÛÒXØĖÆģP]ÙdþTSÎĝŸlûbEHyë÷[ïfgģfzðĘęĐÐĚĔÕuÞQúÝÁÍCàvzúāTùÜIWlĐVÑačĠ\\ÅîÇć`ĄñPÂËqãuøąAYJĂéiüßnĒMĒRr^ÌĂćäÁÉěĊĝğäóĉöÊeæò_ìêÓHāôÇâĠČĈWÖï","OåãôànĕKĊcíMDJýbèĎďõė×sGOğkÈxûÒxøĖæĢP]ùdþtSÎĜÿLÛbEhyË÷[ÏFgģFZðĘĘĐðĚĔÕuÞQÚÝáíCàVZúĀtÙÜIwLđvÑAČġ\\åîçć`ąÑPÂËqãuøąAYjăÉIüßnĒmĒRR^ÌăćÄáÉěĊĜĞÄóĉöêEÆò_ìÊóhāôçâġČĈWÖÏ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("Ċá_Ï×ĜêāAØăeliXÐÅáëĄßąôuĠX^ČMğčĖ]rìĐEròhFIyÃf÷BPpĖðöÔĢÞóÚdjüÛñéĕìDĐbcÕÀsèæěÓQåNĆÞqmZģĕòÎøHýēõÜĠĉëtÍvyÙWNĝêúöçtLèĎęçïÍċGsÀ`ğvýOďāûîkaOwÙćÄâěGkzĉcŸâÃÉäĘĂ[j\\Æñēu","ċÁ_ï×ĝÊāaøăeLIxðåáËąßĄôuĠX^ČmĞČĖ]RìĐERòHFIyãf÷bppĖÐÖÔĢþóúdjüûÑéĔìDĐBcõÀSèæěÓqåNćþqMZģĔÒîøhÝĒõÜġĈëtívYÙwnĜÊÚÖÇTLèĎĘçïíĊGsÀ`ĞvÝOďĀûîKAowÙĆÄÂĚGkzĈcÿâãÉÄęă[J\\ÆñēU"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ėNyEÂďąĜ^ÌKĉĜòevÖjéiIÙBÕWäāäámîgãSCtĔOzÌĢÞćēwÃêåHÎĂaÙOĢóC÷naØÅëëĚþĀ_ğÚàèđďÓěÀr`[ĔÜúFÈÉdĆXçÕĖlTÔÑïá×ÂHĈsuzFpÆÝÝÔqġPçRđdððxLïĘKčöíċĘJăċuGÜ\\mġyĄčvñ]ÛÊÿßēÒíqÛøÆBğ","ĖNyEâĎĄĜ^ìkĉĜÒeVÖjÉIiÙBõWÄĀÄámÎgãScTĕoZìĢþćēWÃêÅHÎĂAÙoģóC÷NaØåëëĚÞā_ğÚÀèĐĎóĚàr`[ĕüúFÈÉDćXçÕėltÔñïá×ÂhĉsuZfPÆÝÝôQġpÇrĐdðÐXLÏękČÖÍċĘJăĊUgü\\mġYĄčVñ]ûêŸßĒÒÍqûØÆbğ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ÃĄÖĘùàÈ÷êĔþďSÙÞCEáRTčFĒěWûyĖímĉâD_ģÉïÝêKUÒEĆQđîÇĐěÑnúýXúàÔÿyĈ]\\ĜfÈĘoċÓösZbòåċTğRėìÇÆkõHpĀĒjČClÌüðÎá`ĔDüßÍiăôĄÉĀió^ëëoæZåġbØÏHďvvXañĆnØLĢjĜÄmÐQâgûP[a×ĂġwUÃGõğÄ","ÃĄöęÙÀè÷ÊĔþĎSÙÞceártčFēěwÛYĖÍMĉÂd_ģÉïÝêKuÒeĆQĐîçĐĚÑnúýXÚÀôŸyĉ]\\ĝfÈęoĊÓÖszbòåċTĞRĖìÇÆkÕHPāējČCLìüÐÎÁ`ĕDÜßíIĂÔąÉāiÓ^ËëOÆzåġbØÏhĎvvxAÑĆNølĢJĜÄMÐqÂGÛp[A×ĂĠWUãgõğä"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("Æïèô_KJąYĔHÝdđRõsĉQÝÙOęÍEĔÞġWĆZėēÞtÅÎ[àñóTØFăgËÜòãĞÉ\\ăÉqĉnEġæĢûvfy×Î`ëBïĄöäLĜċÒÑāHďđěĊðíPěßaĎüğumęãMkĒćpêg^âÖáĖxÚŸÛÀiÚlõDåìčRVUbÙ÷ÔÇĜäØCNAâWáI]êCìČðoóXZèSĢāÇj","ÆïèÔ_kJĄYĕHýDĐRõsĈQýÙOĘíeĕÞġwćzĖĒþtåî[àñÓTØFăgËüòÃĞé\\ĂÉQĉNEġæģÛvfY×Î`ëBÏĄÖäLĝċÒñĀhĎĐěċÐípěßaďüğUmĘãMKĒćpêg^ÂÖÁėxÚÿûÀiÚLÕDÅÌčrVUbù÷ôçĝÄØcNAâwáI]êCìčðOÓXZèSģāÇj"));
}


CTEST(Cases_compare_simple, russian)
{
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ВРДБжюшЫяЭЯлаеЦтМщЦЙлуЩчеКНсХЙАыЪОпФПИъэсдмЧзьбЗвтУГшкгжНХфРоиЮь","вРДБЖЮшЫЯЭЯлАеЦТМщцйЛуЩЧекнСхЙАЫъопФПИЪЭсДмЧЗЬбЗвТУгшкгжНХФРОиЮЬ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("рГмЬэиЫплеЩТЧуЮиБСксчЮщЪрхяАпЦевйЙлЪФзБТоШФгэхЖВдЬнАУЖзЫШцЯокдМН","ргМьЭиЫПлеЩТчуюИбСКСЧющЪРхЯАпцЕвййЛЪфзбТОшфгэХжВдьнаужзЫшцЯокДМн"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("шпзАЗвКЯРюиМБЭГТбЯнЧОаЦХСскЦъМлрпйьшфдуэщЫЪХжйДльФюЕГщжЫУЧтЕИОНВ","шпзАЗВкЯрюИМбэГтбЯНчОАцХсСкЦъМлрПйЬШФДУэщыъХжйдлЬФюЕГЩжыУчТЕиОнв"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("эыфЕмзЪДрБЖзрбДьхйГкЛОнуиВЕСшхФюСчЩпГТьивнлйукОяАъпяЫаЭМющЧтШЦжЦ","эЫфЕмЗъдРБЖзрбдЬХЙгкЛоНУИВесШхФЮсчщпГТьИвНлЙукояАЪПЯыАЭмЮщЧтШцЖц"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("УвЪЙыыбРягуиЗЕДоФющмйЮЯГсЦСТМокЛэЬЪВЧкПшцАрнЗиНЕФЬщчШДлЖЭХхПБжТА","УВъйЫыБряГуиЗеДоФюЩмйюягСЦСТмоклэЬъВЧкПШцАРНзинЕфЬщчшДлЖЭххПБжтА"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ъхвоЬнцжГзОяшЙЛидМъмыКФсСтИНГЫФэЦУйЧпТкевЭдчаЩеЮЮуаРБжьХяПБщршЗл","ЪХвОЬнЦжгзОяшйЛидМЪмыкфСсТИНГЫфэЦуйЧПТкевэДЧАщеюЮуАрбЖЬХЯПБЩршзл"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("УхцщьЫЭфЕаВхЮФйВбрпЯзОлмЕкакоЧДйиджчУЫЖЯСТшЗплЦРБГъьншНмГЩтСэЮЪИ","УХЦщьЫЭФЕАВхюФйвБрПЯзОЛМеКакочДйИдЖчУЫжЯСТШЗПлЦРбгъьнШНмГЩТСэюЪИ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("оЦбМВДКЗНТхАЬзЕоЮмДефэъЙфаЫгИщУпРшРКчУйэЩБТЬцнъЖлвЯычлГХИшюяпжСС","оЦБМвдКзНТХАьзеоюМДЕФэЪйфАЫГИщуПРшРКЧУйэщБТьЦНЪжЛвЯЫчЛгХИШЮяПЖсС"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("АЪщШлРьПЦчГЫпэюКИдъыфХнВМвуудБмфзЕШТлнЯЖЯгцэЙеЗОрБОжТхАИюССКЩчйЬ","АЪщшЛРьпЦчгЫпэюКИдъыФхНвМвуУдбмфзешТлНяжягцэйезОрБоЖТхАИюСсКЩЧЙь"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ВРДБжюшЫяЭЯлаеЦтМщЦЙлуЩчеКНсХЙАыЪОпФПИъэсдмЧзьбЗвтУГшкгжНХфРоиЮь","вРДБЖЮшЫЯЭЯлАеЦТМщцйЛуЩЧекнСхЙАЫъопФПИЪЭсДмЧЗЬбЗвТУгшкгжНХФРОиЮЬ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("рГмЬэиЫплеЩТЧуЮиБСксчЮщЪрхяАпЦевйЙлЪФзБТоШФгэхЖВдЬнАУЖзЫШцЯокдМН","ргМьЭиЫПлеЩТчуюИбСКСЧющЪРхЯАпцЕвййЛЪфзбТОшфгэХжВдьнаужзЫшцЯокДМн"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("шпзАЗвКЯРюиМБЭГТбЯнЧОаЦХСскЦъМлрпйьшфдуэщЫЪХжйДльФюЕГщжЫУЧтЕИОНВ","шпзАЗВкЯрюИМбэГтбЯНчОАцХсСкЦъМлрПйЬШФДУэщыъХжйдлЬФюЕГЩжыУчТЕиОнв"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("эыфЕмзЪДрБЖзрбДьхйГкЛОнуиВЕСшхФюСчЩпГТьивнлйукОяАъпяЫаЭМющЧтШЦжЦ","эЫфЕмЗъдРБЖзрбдЬХЙгкЛоНУИВесШхФЮсчщпГТьИвНлЙукояАЪПЯыАЭмЮщЧтШцЖц"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("УвЪЙыыбРягуиЗЕДоФющмйЮЯГсЦСТМокЛэЬЪВЧкПшцАрнЗиНЕФЬщчШДлЖЭХхПБжТА","УВъйЫыБряГуиЗеДоФюЩмйюягСЦСТмоклэЬъВЧкПШцАРНзинЕфЬщчшДлЖЭххПБжтА"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ъхвоЬнцжГзОяшЙЛидМъмыКФсСтИНГЫФэЦУйЧпТкевЭдчаЩеЮЮуаРБжьХяПБщршЗл","ЪХвОЬнЦжгзОяшйЛидМЪмыкфСсТИНГЫфэЦуйЧПТкевэДЧАщеюЮуАрбЖЬХЯПБЩршзл"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("УхцщьЫЭфЕаВхЮФйВбрпЯзОлмЕкакоЧДйиджчУЫЖЯСТшЗплЦРБГъьншНмГЩтСэЮЪИ","УХЦщьЫЭФЕАВхюФйвБрПЯзОЛМеКакочДйИдЖчУЫжЯСТШЗПлЦРбгъьнШНмГЩТСэюЪИ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("оЦбМВДКЗНТхАЬзЕоЮмДефэъЙфаЫгИщУпРшРКчУйэЩБТЬцнъЖлвЯычлГХИшюяпжСС","оЦБМвдКзНТХАьзеоюМДЕФэЪйфАЫГИщуПРшРКЧУйэщБТьЦНЪжЛвЯЫчЛгХИШЮяПЖсС"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("АЪщШлРьПЦчГЫпэюКИдъыфХнВМвуудБмфзЕШТлнЯЖЯгцэЙеЗОрБОжТхАИюССКЩчйЬ","АЪщшЛРьпЦчгЫпэюКИдъыФхНвМвуУдбмфзешТлНяжягцэйезОрБоЖТхАИюСсКЩЧЙь"));ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("СгртюНфУжИяещОцКмьыюоЗйбЭяЗшъЫСЕшэлЙВЦчПЛмИДХуПАрВКтнЩьЧАЪФхгдЖб","СгрТюнфуЖИЯеЩОцКМьыЮОзйБЭЯЗшЪЫСешэлйВцЧплмИдХуПаРВкТнЩЬчаЪФхГДжб"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("хиазЙДялтвМрСРьДюБхеИУЭоПАцшчЧгНПвЭЩфьГщкНоЪЦмтюШъЗсбйуКыыжфЕЛЯж","хИазйДяЛТвМрСРЬдюбхЕиуэОпацшччгнПВэщФьГЩКнОъЦмТюшЪЗсБйУкыЫЖфелЯж"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("мбоЖЩТаэШРЮЬВУЯоъсИцЧбКеЙнщфкъспТЛхрЗЭьГГвыуПеяМжЧДлХшЮЙдЦныиФаз","МБоЖЩТаЭШрЮьВУяОъСИцЧБКейнщфКЪСпТЛхРзЭьгГвЫУПЕЯмжЧДлХшюЙдЦНЫИФаЗ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("йфзхцЮяКШМьЧУпилНевЩъЭЕяСГсБШЖжПтЮВаыЭцчРдхьЛоАГИмщкйНУЪрФтОЫБЗд","йФзХцЮяКшМЬЧуПИЛНЕВЩъэЕЯСгСбшЖЖПтювАыэцчрдХЬлоАгиМщКйНУЪРФтоыБЗд"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ФТиОЧфуЙкЪзЭЫШСдпмиЕюълЯшГсбеХВьжЦямЩрТдПЙЭЦхЗьНгЫЖкчНщЛЮОбУВаАР","фтИОЧфуйКъзэЫШсДпмиеюълЯШГСбехВЬЖцяМЩрТдпйЭцхзЬНгЫжкчнЩЛЮОБувААР"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ВыФИНекОЛГыЗСдПЗблХдЖЭмиоМтЪййъСШбТвяуЩьЧГрАшнАкРЬЧЦЩуЖюпхЯФЦюЕэ","ВЫфинЕКоЛГЫЗсдПЗБЛхДжЭМиомТъЙйъСшбтвяУщЬчгРАшНАкРЬЧЦщУжюпхяфцЮеэ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ЧОшшЕэциМЯЭДХтЫщЬБКалсЫУТйДюЛюИВНмЪЗЬбЖуйвЗжГЦНАЧяГхсфРрещфОпкъП","чоШШеЭциМяэДХтыщЬБкАлсЫУтЙДЮЛЮиВНМъзЬбЖУйВЗжГЦНАчЯГХсфрреЩфопКЪП"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ТУФаЭЕИзДЫойТшЧхююСуьэЬПкфгЪоНяДаЩЛЛЦЫеМЩИряНБзжъвжркчПХЦшБсйВМг","туФаЭЕизДЫОЙтшЧХюЮсУЬэЬпКФГъОнЯдаЩллцыемЩИрянбЗжъвЖркЧПхЦШБСйВмГ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ЧнбДЙКВХяФцЗШалЬЮндЯъЮщПТоЩЙЭшЖаЖЦОкбЭмМСыГилЪрСфчхеыьГпзуИуврТЕ","ЧнбДЙКвхяфЦЗШАлЬЮнДЯЪЮщптОщЙЭшЖАЖцокБэММСыГиЛЪРСФчХЕЫьГпзуИуврте"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("тяИФфхдэюШМхЕелЖПРвЩмчнзвдЙгъПЫБЙТкяшрзэЬКсЫИаоОБЧаУнЦЛЦЮСщжъьГУ","ТЯИФфхДэюшМХЕЕЛжПрВЩмЧНЗВДЙгъПЫБйТКяшрЗЭЬксыИАооБЧауНЦЛЦЮСщЖъьгу"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ЭдТонфпЧргцщЬлщЕЗэйрюКотЬИУнюФсШмлУВЫецИЯдАЗЪСпъКБбХХАГШямЙЖЖвЧы","ЭДТонфпЧрГцЩЬлЩезЭйрюкОТЬиУнюФСШмЛувЫецияДАЗъспЪкББХхАГШямйжЖвЧЫ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("АЬжцбЗСсэЕЙЫИЛьЮщукЕЪзЫввЯФХъчмМяЧттупГрЭГоюйлжШкЦХПДрШФОищнбАНд","АЬжЦбзССэеЙыиЛьющУКЕъзЫввЯфхЪчМмЯЧттупГрэгОюйлжшКцхпДрШфоиЩнБаНД"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("штсЛююСзЕжыоЖОЭаЬБуяЪнИзУПчарйтщгВЙХеЛЫбгцЯншЪкпКрвфЭцММДчьдфЩхи","шТсЛЮЮсЗЕЖыОЖОэАЬбуЯЪнизУПЧарйТщгвйХЕлыБгцяНШъкПкрвФэцМмДЧЬДФщХИ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ЗегЪЫллжпкхтЙДФрчбЧзУоШКгЦМЬщСЮИУвЙАофШЦщРэыБЯэхъСЬмяАвТНЖдиЕЮПН","ЗЕгъЫЛЛЖпкХтйдФрЧбчЗУошКгцМьЩсюИУвЙАоФшцЩрэЫБЯЭхъсьмяавТНждиеЮпН"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ДИПлЕьСщхТЛаясАЙВОщжопЪгЫФНцзЭчМГЖеКРдУВзУцТйФХЬрШЮМЯчБЮЪбкэЫшИН","ДипЛЕьсЩХТлАясАйвОщжОпъгЫФНЦзэчМгжЕкрДУвЗУЦТйФхьршюмячБюЪБКэЫШиН"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ЧЩРНЧФЯьЙъЕаджжЦПЬеУаоРКЮБэЩыХШХзМтбГЪКимИзлЫспФЦЛйУВвНЯДгЭтЮсШО","ЧЩРНчфяЬЙъеаДжЖЦпьЕУАорКЮБэЩыХШХзМтБГЪкИМИЗЛысПФЦЛйуВвНЯДгЭТЮсшо"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("отБЮОЯЩЛэТйЦскнзыБхзьЕяВГмЖдьйамДеЭИшЩънпУюлъЖГфрАыВХкПцчУишФСЧр","оТБюоящЛЭтЙцскНЗыбХзьЕЯВгмжДЬЙамдеЭиШЩЪНПуЮЛЪЖГфраыВХкпЦЧуиШФсЧр"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("зРеЮъхрФйЛсСйжЩтШъАШКЛоХгфНкУЫютыбВчдЯВщЬзНоДПцЦаЭГЖиУЬэяЕимБПЧМ","зреЮЪХРФЙЛссйжЩтшъаШКЛоХгфНКУЫЮтыбвчдЯвЩьЗНодпЦЦАЭгжИуЬэяеимБпЧМ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ЭЕпбгЮКмжчМэыЪХиЛхКяЗСБНьцЩФуЫъЯЙШеЩРожШувльДчгРцаИЮЙВНдЗсАпФОТТ","эеПбГЮКмЖЧМэыъХИлХкяЗСБньЦщфуЫЪяйШеЩРОЖШУВЛьдЧгРцаИюЙвНДзсапфОТТ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ЬийуЩПЛХгтщШРТУЙшжЯъВОГЮофВФпСЧЪЦЮНаЗдЦЛКчзСЕнэЯИАХРБеЭмБжыыкьДм","ЬиЙУщплХгТЩШРтуйшЖЯЪВоГюофвФпСчъцЮНаЗДцЛКчзСЕНэяиахрбеэМбЖЫЫКЬДМ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ДНзоЪОхшЖлЦЛЗэЬВерЩтПЕУМЯчюБЫрШаСгцбйХНЮГФифЖПыКкВмсИДЭУаЬЙЪЯЩтч","дНЗОЪоХшЖЛЦЛзЭьвеРщТпеУмЯчюбЫршасГЦбйХнюГфИфжПыККВМСидэуАЬЙЪяЩтч"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ЗФхСзШЦОДцЧТАдКМЛьЯйКхВнуЭбНоърШФяиьщпгБЖЪеУиСЧпЖщГЛРетэюыВмЫЮай","зФхСЗшцодцЧТаДКМлЬЯЙКхвнУЭБНоъРшФЯИьЩпГбжъЕуиСЧпЖщглРЕТЭЮЫвМЫЮАй"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("УЮОРИЕОВхЪЫрЛМЦЯЛжнДКцбжЧбшГзХСКЯщйэЗдйеАГУэЪыфичтПТмвшфщьНпсюАь","УЮОРИеоВхъЫрЛмцЯлЖнДКЦбЖЧБшГзхСКяЩйЭЗдйЕАГуЭЪЫфИЧТпТмвшфЩьнпСюАЬ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("яРЙЭЭбщЙКзЦштАяоЮСуПдЩжЛЮФчънхьЕаСОГвуБКПыРЖхдъмчицетылШгНфЬвЗиМ","яРйЭЭбЩйКзцШТАЯОЮсупдЩжЛЮФчъНхЬЕаСогВуБКПЫрЖХдъМчиЦеТЫлШГНфЬвзиМ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ЬЬЧДСеЫТхтЩиЪНМгГДУАЯКЗаыБВжЮНУяВОпершчпфхЗЙЭцЭРЩлЙиМбЛЪЮЖОскцфш","ЬьЧдсеЫтхТщиЪНМгГдуаякЗАЫбВЖЮНуЯВоПЕрШчПфХзйЭЦэРщЛйИмБлъЮжОСКЦфш"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ФпЫлАяцюшСЩРеУоТИЕхтнэаэчъдЩГЯУЧСжБККцьДфЫъЙпхВЬВГбюРжозЗЛИмНшМй","фПЫлаяцЮшсЩРеУоТИеХтнэАЭчъдЩГяучСЖбККЦЬдФЫЪЙпхВьВГБЮРжОЗзлиМнШМЙ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ъосХэЮтшЩеЧЛнДБьВьрЩуэЗЪбзУвяфиЖСгмигтЦкыПЙкНояАРШеюЙлфчАДцМЖпыХ","ЪосХЭюТШщЕчЛНдБЬвЬрЩУЭЗЪбзУВЯФИжСГМИгТЦКыПЙКнОяаршеЮЙлФЧаДцмжпых"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("пкювухЦдЯйжбСиТнфлеЫЦршвзъТКъЗмАсНОшюРуйоьаЩщпчМХЭлДЧИжэягеЬыбфГ","пКЮВУХЦдяйжбсИтнфлеыцрШВЗЪТКъзмаснОШюРуЙоЬаЩщпчмхЭлДчижэЯГЕьЫбФг"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("эЯПОКЮхрзСБщИРМьжгйБьТЦйчЖЮышугТЪМДсъЕЭафхЛУВзПЛшнЧеДцАвНИщФКЫоя","эяпоКЮхРзСбЩИРМЬЖгйБЬтцйЧжЮЫШУгтЪМдсъЕэафхлУвЗплШнчЕдцАвНиЩФкЫоя"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ЛЗасШмЕтХЙиЬгУьДжРЩхфЧНзвЕтлапБняйэгОРЫшыпМЧЪОцукядЭКвБююФЪСЩИЖЦ","лЗАсшмЕТХйиЬгуЬДЖрЩхфЧНзвЕТлАПБНЯйЭгОрЫшЫпМЧъоЦуКЯдЭквБЮюФъСЩИЖЦ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("УыФЪВндЭОАпчДгййЬшпжИрэЖтюсЦЩщЛаъЧИзКлЕряТШХкцМНгбЗеЬмСфОХвБЫюУЯ","уыфъВНДэОАПчДГййЬШпжиРЭжТЮСЦщщлАЪчИзКлеРЯТшхкцмНгбЗЕьмсфОхВбыЮУЯ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("шъдщЮТхЖюМЧЦЬВжзУУлПИЧИНЯнзсЭЫЪцтяЩрБшХРевГмфЕБйФккООааДПГьэСЛйЫ","ШЪДщЮтхжюмЧцЬВЖзУулпичИняНзсЭЫЪЦТЯЩрбшхреВгмфебЙФКкоОААдпгьЭСЛЙЫ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ЪмЪЛЮХгЭЦЖьШДГзчрпубкНаьЕВЮйОцПЕТщфсЛяЫйбвХфтуРЩДЯсшЧмоНзЫаЖКэиИ","ъМЪЛЮхГэЦжьШДгЗчрпуБкнАЬЕвюЙоцпЕТщфСляыйБВХФТурЩдЯСШЧмОНЗыАЖКЭИи"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("онуМЮЛЬолдеПчзьхЙйдиЭШяъкАипУжывФЦфцнТЯаЕХгтЗСбСРрюЖЭЩгМШыЩвБЧкЪ","ОНУмЮЛЬОлДЕпчЗьхЙЙдиэШЯЪкАипУЖывфЦфцНтЯаеХгТзСбсРрюЖЭщгМШЫщВбчкЪ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ХбпьфчиРгэЧрДЗЕОуМСЙкЪЩсШВбявМюыХгщзаЮцЯЫуцНъфТжШДЕЙалпкьжТоЭЛНи","ХбПьФЧиргэчРдзЕОУмсЙкЪщсШВБяВмЮЫхгЩзаюЦЯыуцнъфтЖШдейАлпКьжтоэлнИ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ЕцКвмйяСнхФяЪпЧдэОаыллтТсюшЖИчБузызмэъуЩНИШюФЕХГощркрБаПьйцжЬВГд","ецКВМЙЯСнХфЯЪПЧДэОАЫллттсюШжиЧбузыЗмэЪУЩНиШЮФехгощРкРбАПЬЙЦжЬвГд"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("КсМУрАчШряЖжФгйЗвТщпЭиТьОЯбДсехЫнблъДчХЙэЬнШГъкУЩМПФЮеАЫЛоиЦцЮЗв","КсМУРаЧшряжжФгЙЗвтщПэИТЬОЯбДСехЫНБлЪдЧхЙЭьНШГъКУЩмпФюЕаЫлоиЦЦЮЗв"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("РШбЪЕКвшдАИЮЙыМпмЗЖфнпънйтГОУяГЫЛьэбчЩЦлОчЗювисьщЭТУжЦфхСДАрХЕКЯ","ршБЪекВШдаИюЙЫмПмЗЖфнПЪНЙТгОуЯГЫЛЬэБчщцЛОчзюВисьщэТуЖЦФХСдархЕкЯ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("жУсчФСИъуХПаЭЛэьЫОНЮЕдМДиЗюфрьбНрЯывлПЪшШбгкчТОвЙхЦЙЦЩеЗжтМящГАК","жУсЧфсИЪуХпаЭлэьЫОНЮЕДмдИЗюФрЬБнрЯывлПъШшбгкЧТОвйХЦйцщЕЗЖТМЯщгаК"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("нЦЕимЙОЧюХРъСУНэргзЫуФэфбЮолеВШдЯЩАХГзКъмТвтЖСлПАкыьчЯпщШДьжИйЦБ","НцеИМйоЧюхръсуНэргзЫУФЭФБюОЛЕВшДяЩаХГзкъМтВТЖслпАкЫьЧЯпщшДЬжийцб"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ЮПВчУЖНяхНРЦэйасаюшкфйьбЧжЪцДМгыТДВеЗъиьгэЛзШЛыЕоРПИщофКТМхСущбЯ","ЮПВчУжняХНрцЭйасаюшКфйьБчжъЦДмгытдвЕЗЪиЬГэлЗшлыЕОРПищофктМХСУЩБЯ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ъеЫЮЕШЫлцАуюНсиЪяТЭТщИжйхДшМЩбндчЬускЧпВцкоАяьЛГфжфЗВОйРрзэмГХпб","ЪеЫюЕШЫлЦаУЮнсИЪятЭтщИжЙХДшМщБНДчЬУСКчПВЦКОаяьлГфЖФзвОЙрРЗЭмгХпБ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("влоэЗЮудцРнлдбщтЬкчЮшНЕжЗхЬцагМгЭЙИИеъСвПжрКхФйПЪоЧУыщСЯМяТШАбыф","ВлОэзЮУдцрНЛдбЩтьКЧюШНЕЖЗхьЦагмгЭйИИЕЪСВпЖркХфЙПЪОЧуыщсяМяТШАбыф"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ЬгчосищШБрячДПлриъТЗбЫПэФаьМыхЖЮВЖУНшЭщоТУКъВЙаНгхКЕЙдяЗЮфЦЛСцмЕ","ьГЧОсищШБРЯЧдПЛрИЪТЗбЫПэфаЬМыхЖювЖУНШэщоТУкЪвЙАНгхкеЙДязЮфЦЛсцМе"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("РиЯЖЙзгХгтЭВПДИучеВБмАФцЕДщЭУтшЫцЛЯнзфКжкРюьЬЪпОхШюЫЧсЙНЩъМБоСаЛ","рияжйзгхГтЭвПДиУЧЕвбМаФцедЩэУтшыцлЯНЗФКжкРюььъПОхшЮЫчсйнЩЪМбОсАл"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ИцэхЯозЮНювуГЪшйывЫфФщоЦхЭСРъдтЯЬйерЧгУПСбмЗАЛШкЖКлЬЕБдАТчЖПиНМЩ","ицЭХЯОзЮНЮвУГЪШЙывыФФЩоцХЭСРЪДтяьЙЕРчгУпсбмЗалшКжкЛЬебДатЧЖпИнмЩ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("иЖмЪЫСнГЭвОШИжлэаЙюуЩЮодрХкЧЕЗббТсЦзчФХньвьРаЙяЕЦЪфуМпЫКгпШТдЩяЛ","ИжмЪыСнГЭвОШИЖЛэайЮУЩюодРхКЧеЗБбТсЦЗЧфХньвЬрАйяЕЦЪфУМПыкГпштДщяЛ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ЩеОйЖвАХнШыиЕкЯСБапьдруЮЗбфЖчкТШцМщрМпллгдэютъъЭзцсыФИЯВУхоЬчгНй","щеоЙЖвахНШЫИеКЯСбапЬДрУюЗбфЖчКТшЦмЩрмПЛЛгДЭЮтЪъэзЦСыфИЯвУХОЬЧгНЙ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ЩфтЦБЙПОЪйЭНЦшшаНЛИУЭВеуоеКРдРЫЗВсдЯчЪклХТыМЬПГаЬсЯзЮщГфХБЧЮжиЖм","щфТЦБЙПоъЙэнцШШАНлИУЭВеуоЕкрДРызВСДЯЧЪКЛХТымьПГАЬсязющгфХбЧЮжиЖМ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ыуккДМшпжтбВнчаыдЛчЛЮцъЩССЪФхяЗВяатЭзрьеУИЬНгиРЙОМФЭойгЮЦпжбхеЩШ","ЫУккдМшПжТбВнЧАыдлЧлЮЦъщСсъФхЯзВяАтэЗрЬеУИьнгиРЙОМфэоЙгЮЦпЖбХещш"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("зВЬОйцраИЕЬпМэщхдУнЛэЪЛЪЫЦПйФЧБтгСщЖмзКюЯЧНхЫуШюаШерСяЖДбтвокфиг","ЗВьойцрАИеьПМэЩХдУНЛЭъЛЪыЦпйФЧБТгСщЖМзкЮячНхыУШюАШеРсЯЖдбТвОКФиг"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ЯящБмзфрпжЭЩДемКЫьлЙеЪНОСТКвжгФлАпгхаэЮЪБЗДЫуОЧсциврйшшХтЧиюуьЦн","яящБмЗфрПЖЭщдеМКЫьЛйеЪНосТкВЖГфЛАпгхаЭЮЪбЗдыуОчсЦивРЙшшхтЧИЮуЬцН"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("хПЩдяСККЭЪлХАдгЭытюлжнЪРгЯЬПуЗУЙОюиОЫЧЕЙЦинЬваМРЧцСФмбщшбЗштвЕФж","ХпщдЯСККэЪлхАдГЭЫТюЛЖНърГяьпУЗуйОюиоыЧЕйцИньВаМРЧЦсФмбщШбЗштвЕфЖ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("НЫбзРгтуПОЬшЮКлРЦпБЭТСуэОАфзаЩъкДСьвЯюхыМЕИЕхжЙвЯднЙжЧФъЦЛШЧМиГщ","нЫбЗРГтупОьШюклрЦПБэТСУЭОАФзАщъкдСЬвяЮхыМЕИехЖйвяднйжЧфъЦЛШЧМИгЩ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ВуЫЦДБУЧгтрЕпШДЪщбляшГКэЛэяХхЖОВзСжАФпМКюФъНьИСюМЧщзыИРНЦТЙоАЙьЕ","ВУЫцдбуЧГтРеПшдЪщбляШГкэЛЭЯхХЖОвЗСжАФпмкЮФъНЬИСюмчщзыиРНЦТйоаЙЬе"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("шФМщРУДЖЬшУБРпеацНЗЦЛсюЧГАйТГыФЛНЖОМХККъИЯющэПЗоХвсЪедИтБЫЭвЬЧЯй","шФМЩруДЖЬШУбрпЕАЦНЗЦлсЮЧГАйТгыфЛНжомхККЪияЮщэПЗОхВсъЕдИТБыэВЬчяЙ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("лЩцДоцэЖяЩВККтиРГзХТнЗъмваыУНчХУЬОббМЙфпюАЛчЫРеЕШЯъИГСйЭюЬжПСДшФ","ЛщцДоЦЭЖяЩвККтИргЗхТНЗЪмвАЫУнЧХуЬОбБмйФпЮаЛЧырЕЕшЯЪИГсйэЮЬжПСДшФ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("цРЧацивйЕМЩхЭДЫиФпгЫякУЩъЭМеДвЧЛБЙЖьОбХсъПСТЖЛьзНОЮфЯнргТашуюЗШК","црчаЦИвйЕМЩХэДыИФПгыЯКУщЪэМедВЧлБЙЖЬОБхсЪПСТЖльЗНоЮфянРгтАШуЮЗШК"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ЛЩцМФДРэйАяаЗбжнЬЗНокоСЧПиБххШэДЩЮряеЕТЧюилУВЫьжЦКЪфуЪГтМшЫпЙсвг","ЛщцМфДрЭЙАяАЗБЖНЬЗНокОсчпИБхХшэДЩЮряеЕтЧюИлувЫьжцКЪфуъгТмШЫПЙСвГ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ЭадШЯгцэынОРслЩоюЬмАЖйхШТЧйБИетГъЯрНУьПъЫлкМЖвщИЗСЮЗуФДФЧцвкпхЕБ","эАДшЯГцЭынорСЛщОюЬмАЖйХштчЙбиеТГЪЯРнУьПЪЫлКМЖвщизсЮЗуФдФчЦвКпХЕБ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ИйАнГышчъНблрэОаЮьмлтЕсвФшрэкюхпГДТдХМяСцфжщяЧЖйВЪщкебУЬоыЦзиузп","иЙАнГыШчЪНБлрЭоАюЬМлТЕсВФшРэкюхпгдтдхмЯсцФжщяЧЖЙвЪЩКебуЬОыцЗИузП"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("щХГаоцеЪэХГяЖЛФдыЮИТцмзКбЕЙюКяЩьТЫУфвьШсвЭмСлАрчНоИъуРпдПшзЙЧЖНб","щхгАОЦЕъэхгяжлФДЫюИТЦмзКБеЙюКЯЩЬтыУфвьшСВЭмСлАрчноиъУРПдпШзЙЧЖнб"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ИртЭаГЮтУЖАехМщГИпзУлРВшвБЮьЬйОЭхчСЯфлЧдЦМеЪЦЫОкйЫпндФзЪКЖБШщясн","ИРТэАгЮтуЖаЕхМщгиПЗУЛРВШВбюЬьЙОэХчсЯфЛчДцмЕЪцыокйыПндфзъкЖБшЩяСн"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("юБиЙРснкяЩЖНЛцЖГаМщБэЛфеЕяЗыМоЧцЧйшпШъутОтПХьфЬВъУвХДКСАЮГЫЗдрэи","ЮБИЙРснкящжНЛЦжгаМщБЭЛфЕеяЗыМочцчЙшпШЪУТОТпхЬфЬвъувХДКСАюГЫздрЭи"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ГЧУЛЙъМЕОнГЮШывмдИЯскУОЮЬцеПСнПижЖтытЩцРчЬКщЙххбШзэаФДбВРфяаъЛЗэ","гчуЛЙЪМЕОнгюШЫВмдияСкуоЮьЦЕПСнпИЖЖТыТЩцРчьКщЙххБшзЭАфдБВРФЯАЪЛЗЭ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ОДщгЫХЬюгбКпрАЕРубъъыХлскЭНиПйяоаУИЙчсФнзеЗЭТмМшювЦЬлФЯцДВШЖЖЧтЩ","одЩГЫхьЮгБКпраеРубъЪыхлскэНиПйЯоауийчСфнзезЭТММШЮВЦьлфЯцдвшжжчтщ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ЭГсхЮзИцСрУнфТяКЖЬЪЯЧЩайгхВчпИаЦЙТефкЕДЖЭюлШщоОШМЗбдърПВБЫьнУМыЛ","ЭгсхюзИЦСрУНФТякжЬъЯчЩАйгХВЧпиАцйТефкЕдЖэюЛШЩооШмзБдЪРПВБЫЬнумЫЛ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("йЯнГЧэБиФшжвЧнюГЭлУюмЫиСДпжСпЯлцЕоУТДЪВЫЪЙЦЩрХкьРекщХоьзМфтЗБашА","ЙяНГЧЭбИФШЖВчнюгэлУЮМЫИСДпжсПЯЛцеОутДЪВыъЙцщРХкьрекЩхоЬзМФтзбАша"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ШкеЦЭчКвЗщВСгЖХмйдомшиЫцНйДеаПпЪрЫТфЖлГОзСляЮюбрЯуЪАУэИЧтФьхНБьЩ","шкЕЦэЧквЗЩВСГжхмйдОМШИЫцнЙДеАПпърЫтФжлГоЗсЛяЮюБряУЪаУэичтфьХНБЬщ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ЧэйТнДЦЪпЫфдкЬБмСХцМиашбВоРЬЮФоиыЪжАтюЕЭззсуГЕЛгЩйнЖПшкщРяУчВхЯл","чЭйТндцЪПЫфДкЬбмсХЦМиАшбВорЬюФОиЫъЖАТюеэЗзСУГелГщЙНЖпшКЩряучвхЯЛ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ЭЙПпуааОЗчягИмШОЩеФЮСДСЬлЮВТъЦцЖмыхДКшвргЬэФыХекТбБяНщчрЖНЙУъзЛи","ЭйПпУААОЗЧягиМшощефЮСДсьлюВТъЦЦжмЫхДКШВРгьЭФЫхЕКТБбянщчржНЙУъЗЛИ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ЖсвЪЕхЗшДЕЫюИыЯиЦэгМрофкЬФбНаВУпжМКНгзййУэрТпСЩдЩЧЛюохтШЧЯБЪьЛЦа","ЖСВъеХзШдеыЮиЫЯИЦэГмроФКЬфБнАвУпжМкнгЗЙйуэртпсЩДЩЧЛЮОХтшЧЯбЪьлцА"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("очИшГАКтштЕОЫрЛЛрХЬЮВцЕЭЯСювНЦПНдЖукФбмхуАядЪЗИзПЩСФЫэЪЧЖйГщЙбмЬ","ОчИШгАКтШТЕоЫРлЛрхьЮВЦЕЭЯСюВнЦПНДЖуКфбмхУаЯДЪЗИЗПщсФыЭЪчЖЙгЩЙБмь"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ЫОМпвШрэеХУфцЫьМЧщДГуъяАбэЪлИАЛйсЮкФЙИжхнкНзГБцзЬЯтщЮевЖдШРтПЧОС","ЫоМПвшРЭеХУфЦыьмчЩДгУЪЯАБэъЛиАлЙсЮКФЙИжхнкНЗГбЦЗьяТЩЮевЖДшРТПчОс"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ТПОЮТжИЩьХЛЙШЧГШВГьръСцдоАэЗвчхАюУбМкуСРЕКйжямщДцбъЗэпНлфИЫяЫФне","ТпОютЖИЩьхЛйШЧГшВГьрЪсцдОаЭзвчХАюубмКуСреКЙжЯМщдцБъЗЭпНЛфиЫяыФнЕ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("рЖедРЙЗвКТЯгЭБаьчХЦноИэЛЫБЫмМсгаВцПфюьФлЧЩеШъЮНтЗдйЖИПУщуъОЯшхКс","рЖеДрйЗвкТяГЭБаьчХцНоиэЛыбЫМмсГаВцпФЮьфЛчщеШъюнтзДйЖиПУщУъОЯШХкС"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ИЛшТиЛЬэКЗЪрйЫгщчзжмНнсМЩйукбБЬшОВОфюыЮАфяТАВцСцхДДхеЭЖчЕРъпупгя","ИЛшТИльЭкзъРЙЫгЩЧЗЖмНнсмЩЙуКббЬШОВофюЫЮАФЯтАВЦсЦхддХеЭжчеРЪПУпгЯ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("знЙгчНЮехмЦФОПцШЫаиыВРТЕЛйЧПВСуЛЗЮьЯКоХдмТБГДКЪаЭУшъиРФяЖЩЬЭСБщЖ","ЗнйГчнЮЕХмцФопЦшыаИывртЕлЙЧпВсуЛзюьЯкоХДмтбгДКЪаэушъИРФЯжщЬЭсБщЖ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ДкжъюрфМГтцгМЗЛПдкнэЧлсъыЭРобЦйчЗТжахУСхИишйЬяЕУЬВПБяЩнщоЕшыфаЮВ","ДКЖЪЮРФмГтцгмзлпдКНЭЧлСъЫЭрОБЦЙЧзТжаХУСхиИШЙЬЯеуЬВПБяЩнщОешыФАЮв"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("щжтпЗионмЯЪоБеьбЮЛМЩазччйЙГЬэрШХЖФЦдшаУцЫДгТРсФехюЭлисыввЪкКуняп","щжТПЗИОнмяъОбеьбЮЛМщАзчЧйЙГьэРШХЖФЦДШАУЦыДГтРСФехюЭлисывВЪккУНЯп"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("шСФнГласвЗчЖНРДВкпжыЙТЗЫФмощелцЧЭюЩбЬЪЯюПУьихРугЦтшдбЙАЯхЭкИЪМео","шсФНглаСВЗчжнРДВКПЖыйтзыфМОЩЕлЦчЭЮЩБЬъЯЮпУьИхрУГцТшДбйАяХЭкиЪМеО"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("уКРчЩЗЭъоОЗАКыЮЙИЮЪГЭмвптгшьжЩлМЧлЦРХехЯЫфсДтуинаВбцпФДйСьЯЕшжнб","УкрчЩЗэъоОзаКЫюЙиюъгэМВптГшЬжЩЛмЧлцрхЕХяыФсдТУинАвБцПфДЙСЬЯеШЖнБ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("СрДПЪШюУЗЯъЩИйюЦыОАШГоиечРспГЭЬыУЯМВщЗЦЛЛэКБфДФжхжТННЕвЙкьМБТАхЧ","сРдПЪшЮузЯъЩиЙюцЫоАШГоИечрСпгэЬыуЯМВщЗЦлЛэКбфдфЖХжтннЕВЙкьМбтАХЧ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ЗЪбэиоУцмАцУНрфПыяТЩЬвсДЙЮЖнтиляЛшйсыхедКЧБАШрВХьчокгмпФзЕЖэЩгюъ","ЗЪбЭИОУцМацунрФПЫЯтщьвСдйЮжнТИлЯЛшйСыХЕдкчБаШрВХЬчокГмПфЗЕжЭщГЮЪ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ЯшЖИЮчсЪКевьзгрфжЫнЙАОюпМЩПрЦМнчдбхКЛСфыЬТЗДоэшвУТЭуХЛЯищЪГЦбаеЙ","яШЖиюЧсъКеВьЗГрФЖЫНйАОЮпМЩПРцмнчДБхКлсфыЬтздОэшВУтЭуХЛяищъгЦБаеЙ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ЮЦнСЧЭЭФтяхлмЯЩФаХЪСшМОЙОЪыТрУГиЬвиАБщеКрЖЕПЧЖюЙЛЗцкЫВДПуБньгДЗш","юЦНСЧээФтяХЛмящфАхЪсШмОЙоъЫтругИЬвИАбЩЕкржЕпчжЮйЛЗцКывдпубНьГДзШ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ИюцдШЫяАпьЦяъМеОРщНсФдЫбвзпзРншИюЬМлГжТуЙфЖЩткЪЭеБХгУчЛКчаВхСЙОэ","ИюцДшЫЯапьЦЯъмЕОРЩнСфДЫбВЗпЗРНШИЮЬмЛгжТуЙФжЩТКъЭеБХгуЧлкЧаВХСйоЭ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ОншЛЭБъЮЧГьВтуГИеЗлкньмЭОВЖЮЪКщХУЯйЩжаПрЫРиПТбДАзхЕЫСЦСФяДфчцшМЙ","оншЛэбъЮчГЬВтуГиЕзлкНьмэовжюъкЩХУяЙщЖапРЫРиптБдАЗХеысцСФЯдфЧцШМй"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ЯНшлДмдццБРХйяМнпиозхТвЧлтпйЭбжвчУаЫезкЖЪФЮерЭьфащСъШГоЩьыСуГкИЮ","яНшЛДМДЦЦБрхйЯМНПИозХтвчЛтпйэбжвчУАЫеЗкЖЪФюЕрЭЬфАЩСЪшГОщЬысУгКИЮ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ЦУяэДГуАфЬсГщМБЖрПЭртеЧоЪыксЙХвюПЬзЗШВФщъЛШЛЧИмнхЮЯБкДаИнжТОЦыЙЕ","цУЯэДгУАфЬсГЩМБжРпЭртЕчОЪыкСЙХВЮПьзЗшВФщълШЛЧимНХюЯбкДаиНЖТОЦЫйе"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("щюЧжкуРугОвфгпДтдяШЕъщХцнпСкюЗяиАЬБЙсЛэОйЛчТШВыхъБнеиРыЬАЖмФэзцм","щюЧжКУРУГовФГПдТДЯШеъщХЦнПсКЮЗЯиаЬбйсЛЭоЙЛчТШвыхъБнЕИРыЬАжмфэЗцм"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("эякТтуеЗЗУмпчьДИОИжчЭъРАыЫЦХФШйябХкгащлшЬПжгЪМЩОЦйнСНБРЛфвВюСюЕд","эякттУЕЗЗУмпчЬДИоИжЧэърАЫыцхфшЙяБХКгАЩЛШьпЖГъмЩОцЙНСНбрлфВВЮСЮЕд"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ЦкоИЙкееЩЫЭвъдцаоыфСЙщтбяАЬЛьжънЯзБЗПХПшчУиСТНМЮМГюхЭрфГЛЧДрШжуВ","цКоиЙКееЩЫэвъдЦаОыФСйЩТбяаьЛьжъНЯЗбзпХпшчУиСТнмЮмгюХЭрфглчДршЖуВ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("дЛИзмБЪоЧюУДхФЩСАрфТОеХЪСЬшыВЯБмЙыВчкщЖйГиаЦтнжЦуЯКШпЭЭгрЛПНЗЕьЮ","ДЛИЗмБЪОчюУДхфщсаРфТОеХЪсьшыВябмЙЫВчкЩЖйГиацтНЖцУяКШПЭЭГРлпнЗЕЬю"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("фрЦфЫхВХЯуУиМшеьрггпОщЮкзпьвБАНДЛчйЛйЧЫЪНщиОЖцЮетДяэЪМСТШсАкЖЗбэ","фрЦфЫхВхяуУИМшЕьРГгПОщЮКзпЬвбАндлчЙлйЧЫъНЩИОЖЦюЕтДЯэъМсТшсакЖзБэ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("СлвУычЩЬЗЗЭЭбикашяЛШТМЯИъЮКдХцГЖЙАГуПъОЧСйХЮфДмщнжОтрнпефЫбеЦЬВр","слвуыЧщЬЗзЭЭбикашЯЛшТмЯИъЮкдХЦГЖЙАГуПЪОчсйхЮфДМщнжотрнпЕФЫбецьвр"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("вЛЖцЧдФУбЫпмоиФшТгЗЮЖвКзйХшТеСдЭАясНеЮЛрщЙхоАЪЪЩУиЬцнМЭрпЬчяБГкЫ","ВлЖцчдфубЫПмОифШТГзюЖвКзЙХШТЕсДэаяСнЕЮЛРЩЙХОАъЪЩУиЬЦНМэРпЬчябгКы"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ХМЦЭЛцсЯжзЖЮЕабщКшнМТЬвкГрРЙдЫТчГазВъсЯчОШиНЛЕДхоЙЭФыупФЮУЪщПБиЬ","хМЦэЛЦсяЖзжюЕАБЩкШнмТЬвКгррйдЫТЧгАЗвЪСяЧошинЛЕДХОйэфЫУпФЮУЪЩПбИЬ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ЬиЬРВШуБХМаЧЭТзФбсхоЮЪюкпШРыдЩкйГЕЖцлнМуТВДИэсжпЕНзЧаыщГйофЯлЯъц","ьИьрвшУбхМАчЭТзфБСХОЮЪюкПшРЫДЩКЙгЕЖЦЛНмУТвДИЭСжПЕнзЧаЫЩГйофЯЛяЪЦ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("МнстоабьбгИПШФТдРЕЦОЦЭэыйьРвявъЫичХЧмЩюЛКУдлЪУАЗЖЖЗснЕХшящКпГюФЙ","мнСтоаБьБГИпшфтДРЕЦоЦээыЙЬрвЯВъыИЧхЧмщЮЛкУДлЪУАЗЖЖзСнЕхшЯщКПгЮФЙ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ЕВЬсЩкЦРйкЪПЖэМЛНчыэпрГГДфВшшЩЯднфюоЛЪтОаСхЗУийзТЯюМбЧЫАциУьеХЖБ","еВЬсЩкцрйКЪПЖЭМлНчыЭпРГгДФВШШщЯдНФюоЛътОАСХзУИйзтяЮМбЧЫациуЬЕхЖБ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("СВфЦэФЮаЬытЗХРяБЛеичУСцоЮЗгкКъдЕуРнЯгПоБйЫМьЖднжЩХйлЧМЪЩВШИэАТпШ","СвФЦЭФюаЬЫтзхрябЛЕиЧусЦОЮзгккъдеурнЯГПоБйЫмьЖДнжЩхйлЧМЪщВшИЭАТПШ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ЫЮЩцдФлакреХЧзУлТЕЙЭШКхЪрЖЬжыЬВНДМИиуцоЯСМтюяГЭПбЗПОаЧсШгЩфЪйВБН","ыюЩцДфлакРеХЧЗУЛТеЙэшкХЪРжьжЫьВндмИИуЦОясМтЮягЭПбЗПоАЧСШГщфъйвбн"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ОэИяыЬъТбМоЖСхпЙЯЩТШНАРидШйвЮцЗАмеуЦЭсЛГЩЪкЬрДВфхЫГЧКжпЛучБФюЕЗн","ОэияЫЬъТБМОжсХПЙяЩТшНАРиДШйВюЦзамеуЦэслГЩъкЬрДвФхыГчКжПлуЧБФЮЕЗН"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("БГвФчзуъКбьжЛМхмАДчНрриЗасЕлЮШВЫяцсОтэФдъЯЭщыпЕТПижкГоЬхуйЦюЩйШн","БгВФчЗуЪКБьжлмхмадЧнРРиЗАСеЛюШВЫЯцСоТЭФдъяЭщЫпЕтПижкгоЬхУЙЦЮщЙшН"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("эмЧГкЙШоУлСицтндаЕЖъЗарЙфкиеТВсЦмнфпъБхдяящПЮьхчЮЩЬузбЖГыЭРылвШо","эмчгКЙШОУлсиЦТндаеЖЪЗАрЙФкиетВСЦМнфпЪБхдЯящпюьхчЮщьузБЖГЫЭрыЛВШО"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("зЩЬТЦИсеБкУшвАЖРгЮШЯЧкаоЪрхЭфНЪМБуЛмОЭыезЖчЙцГИдЫЛйЮПпДсНХфВЬЩЯт","зЩЬтцИсЕБкушвАжрГЮшЯЧкаоЪрхЭФНъмБулМОЭыезЖЧЙЦгИДЫлйюППдСНХфвьЩяТ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("вбуЭЙЛЖйФуЕСбфКСЩъиЪАптДИгЩЧчзРКэаыВПяьМгяНоМХюьЦЗжНрШхШОыецДюлт","ВБУЭйЛЖЙФУеСБфКсщъИъаптдигЩЧЧзРкЭАыВпЯьмгяНОМхЮЬцзжНрШХшоыЕцДЮлТ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ЧЬвЧТКлцЦХшяефаЭЪъкСаБжнФлМерХпйДЗмИидШюуйЬОжбЮЯНсвОзЩУрэщТыГпгы","чЬВчтклЦцХшЯеФАэъъКСабжНФЛмЕРхпЙДзМИидшЮУЙьоЖбЮЯНсВозщуРЭЩТЫгпгЫ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ГаУЙНИЛГмоРАьЭХбИЩвДюЗФПыуКЪЮЖЦТСцМъЗшэТЯрХпоЕкыЖЧвШдЧебЯЩФсйньЛ","гАуйнИЛГМораьэхбИЩвдЮзфПЫУКЪЮжцТсцмъзШЭтЯРхпОекыжчВшДЧеБЯщфСЙньл"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("кОтНмНцффюйлпадухвБчщыШИХЛазяЯйЖЩЗэъцгьРСпрДВуэиЮомчЕТыШЖЪСеБкьГ","коТнмнцффюйЛПадУхВБЧЩыШихЛАзяЯЙЖЩЗэъцГЬрспрдвУЭиюомЧЕтЫшжъСебКЬГ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ЕЬоДюзЭлШЬЯрдэЦюЧЗЪпЩГоЧХЛЙвЕтФШЩжыБРЪЙСПтБНмгакжИЦифаМуяхНЫвкус","еьодЮзЭЛшЬярдэЦюЧЗЪпщГоЧхлЙветфшщжыБръЙсПТБНМгаКжиЦиФАмуяхНывКуС"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ВЧябЖьшЦеимйуЛЭнГЖтщЯЧззрвЕМДЫБсЦьОпсЛЩУФпхнаъэюдХОТЙрюшЪфыКГкАи","вЧЯБжЬшцЕИмЙулЭнгжтЩЯЧззрвЕМдЫБсцЬОПслщУфпхнАъэЮдХОТЙРЮшъфыкГКАИ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("кьцМЯжзИУдЭвыЭръаСЯЛщФрпГЕОЦОНЬГщмшТИлхтБкзсЖхчЕЙюдфПЧЪбАйыюНУВШ","кьЦмяжЗИудэвЫэРЪасЯЛЩфрПгеоцоНЬгЩМШтИЛхтБкзСЖХЧЕйюдфпчъбаЙыЮНУВШ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ГжДУлСВиФПОЬмХЫйюъКЧлыярмьэжЩачобЩРНЦЙХИНЭЗДгТКТпШАюфзЯсвБШуцеъе","гждулСвиФПоЬМхыйЮЪкЧЛыЯрмЬэЖЩачобЩрнЦйХИНЭЗдГТКтПШаюФЗЯСВбШуцЕЪе"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("МйАКфХЭызСПЮлРТЕкфЧюЖЭмЬЗТиуШццвНщоЖГГЯШдЫЙбХлОАьБЯучдеВсНПъИщъР","мйАкФхэЫЗсПюлРТЕКфЧЮЖЭМЬзТиушццвнЩоЖгГЯШдЫЙБхлоаьбЯуЧдеВСНПЪиЩЪР"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("КСХЖЩГМоНьйЫДОУыйЛчгВЭФюшитФбЕалшПзвЮхКЧтЩяЯуаРЦьемзэЪъцИржБДнСп","КсхЖщГмОНЬЙыдОуЫйЛЧГВЭфюшИТФбЕАЛшпЗВЮХкЧТЩЯяУАРЦьемзэъЪцИржбДнсп"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ющсоКНХеЙАЬЪгылЯЧъСчШвюЕКжиФШбзДйЬяруЦфиВУгЛОдАэмпЗЩМэХБнрпцЫТТЖ","юЩсОКНхейаЬъгЫлЯЧъсчшВюекжИФшБздйЬяРуцФИВУГЛОдаЭМПЗщМЭхБнрПЦЫТтж"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ГоНеКюшщВдЦТхЗЕтСРХаюуьъйКвЯлиЫбСБмЭШчЬИЗОПуфэжфчяыНрЙЪЦдПмЛжГАщ","гОНЕкюшщВДЦтхЗеТСРхАЮУЬъЙКВяЛиыБсБмэшчЬИЗОпуФэжфЧЯЫНрЙъЦДпМЛжгащ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ЭЬСУхшЩРгцХБЫВМмоЩтрЖсаИычлУНТйэвЧЪЬлЕойнюЖзеффЪзцкяиПюАГшпяДДКБ","ЭьСуХШЩргцхбЫВммОЩтржСаиычлУНтЙэвчъьлеОЙнюЖзефФъзЦКяИпЮагшПядДкб"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("эБйгуШжьКЩьцчзтрчАХыНуЫТиВЕВЯЮягюэПЩИСЛФжОСМОъехмрЙпБДЗФНЪцКШАЛД","ЭбЙГушЖЬКщьЦчзТРчаХЫНУытИВЕвЯЮЯгюЭпЩисЛфЖОсМоъеХМрЙПБДзФнЪцкшаЛд"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("жнЛнЗоВХМЪХМоеЦвАУлпщАтяЭуяЫИюЧеЧШГщСэФдфгбЮиРъцйрзкЬкТПдЖйЫСьБШ","ЖнЛнзОВхмЪхмоЕцВаУлпщАтЯэУЯЫИЮчЕЧШГЩсЭфдФГбюИРъцйРзкЬктпджйЫСьбш"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("НДсяоЛшумъЙьЦляжпиюБИоУГцывпхмсАКщрфэЕдШЙТеыбХфГТЩччЬюЗАкржЭЗвнЪ","НДСяоЛшУмЪйЬцЛЯжПиюБИОуГцЫвпХмСАкщРФэедшйтЕыБХФгТщЧчЬюзаКрЖЭЗВнЪ"));
}
CTEST(Cases_compare_simple, hebrew)
{
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("טמאעוציזסנשךכגדתבץחלקןהרףםפ","טמאעוציזסנשךכגדתבץחלקןהרףםפ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("כצנמץיחזדהךגתטרעפלןשםקאוסףב","כצנמץיחזדהךגתטרעפלןשםקאוסףב"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ונצפהאףץךדתיטמכקברלםחעגסןזש","ונצפהאףץךדתיטמכקברלםחעגסןזש"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("תאהפרבםךץידזנעכןוטמחגסלצקףש","תאהפרבםךץידזנעכןוטמחגסלצקףש"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("שץדרהטזאעתפבלכםויסצףחנןגמךק","שץדרהטזאעתפבלכםויסצףחנןגמךק"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("חטצתיןלשףקםגרךנזאץבופדסמכהע","חטצתיןלשףקםגרךנזאץבופדסמכהע"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("שלםגברהןתעכזץוחדמנאיסצפטךףק","שלםגברהןתעכזץוחדמנאיסצפטךףק"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("זכעחןקבסצדשתהץםלףאנךגימפוטר","זכעחןקבסצדשתהץםלףאנךגימפוטר"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("םדןחמזעאולפהגציךתקרףנץכשבטס","םדןחמזעאולפהגציךתקרףנץכשבטס"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ףנזךץחהמטעארגבדלןוסצםכתפשקי","ףנזךץחהמטעארגבדלןוסצםכתפשקי"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("מגנכךםילשבעצאספזתןץקהטרוףחד","מגנכךםילשבעצאספזתןץקהטרוףחד"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ןשפתכגדףנץאסטצזמהחעירךםקבול","ןשפתכגדףנץאסטצזמהחעירךםקבול"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("למקזנץבםוךכירטגןהאשתדפצחףעס","למקזנץבםוךכירטגןהאשתדפצחףעס"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("בקעוץיספתלןרנשדמאכףחגךטצזהם","בקעוץיספתלןרנשדמאכףחגךטצזהם"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("דלומכסיצףפאחץשתטעברנךזןגהםק","דלומכסיצףפאחץשתטעברנךזןגהםק"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("דצשתסקניןרלךפאעטהבגזוףכמץםח","דצשתסקניןרלךפאעטהבגזוףכמץםח"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("רדכעץבאסגןףםשטקלנותצימחזהפך","רדכעץבאסגןףםשטקלנותצימחזהפך"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("בסךצץקיגתחדלנמפזםףארעכוהטשן","בסךצץקיגתחדלנמפזםףארעכוהטשן"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("םמלכתעצקןץפיברדסאטזךנףשוהחג","םמלכתעצקןץפיברדסאטזךנףשוהחג"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ןסליזמצשתגחנרץוךכםקדהטבפאעף","ןסליזמצשתגחנרץוךכםקדהטבפאעף"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("תהבלרחשפאזץדןנכוטףךצקגיסעמם","תהבלרחשפאזץדןנכוטףךצקגיסעמם"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("גכפשםףלןוסאחנימץהךבטעזקתרצד","גכפשםףלןוסאחנימץהךבטעזקתרצד"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("טיהדלףץאעזתךקסבמפרגצשונםחןכ","טיהדלףץאעזתךקסבמפרגצשונםחןכ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("הגעטחסזנמדבצךםףלקותץפכשיאןר","הגעטחסזנמדבצךםףלקותץפכשיאןר"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("אץצנכחסםדלמוקפעהתזבךטףישרןג","אץצנכחסםדלמוקפעהתזבךטףישרןג"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("וטרנתסיזצמשפךלחגבאקםדףהץכען","וטרנתסיזצמשפךלחגבאקםדףהץכען"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("עךפבץשטםיזכצמתגהדאחנוןקסלרף","עךפבץשטםיזכצמתגהדאחנוןקסלרף"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ץךשצטאספכדתיעורקןףנמזבהחםלג","ץךשצטאספכדתיעורקןףנמזבהחםלג"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ךלפאגחצץרזשתעןכנםטמהדקףוסבי","ךלפאגחצץרזשתעןכנםטמהדקףוסבי"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("זץאכלשספערןצגיםךהףקתמטובחדנ","זץאכלשספערןצגיםךהףקתמטובחדנ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("גחצףאתשןכדבקרמנעהליםוץפךסטז","גחצףאתשןכדבקרמנעהליםוץפךסטז"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("עחבהכפסתוןיגץאמףםזצנךלדשטקר","עחבהכפסתוןיגץאמףםזצנךלדשטקר"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("חספףילזמרגןעוכבםדקךהנץטאשתצ","חספףילזמרגןעוכבםדקךהנץטאשתצ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("צשמםקוףאלטיתרהדנגעךפסחזץבכן","צשמםקוףאלטיתרהדנגעךפסחזץבכן"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("סנוצמיעדכץטםלףןךקתרשאפחהזבג","סנוצמיעדכץטםלףןךקתרשאפחהזבג"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("םרקפבמשסדלזנץיףעךןהצכטחגאתו","םרקפבמשסדלזנץיףעךןהצכטחגאתו"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("וקפגשרזצמחךבסנכיףעהםלתןץדאט","וקפגשרזצמחךבסנכיףעהםלתןץדאט"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ףטעלהפבךםשרןאימץגתסזקחצכדנו","ףטעלהפבךםשרןאימץגתסזקחצכדנו"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("דצףסתזינטשהאבלגקךוםןחעפכץמר","דצףסתזינטשהאבלגקךוםןחעפכץמר"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("םחיכבקגןשףתדטסזצומפראלנהץךע","םחיכבקגןשףתדטסזצומפראלנהץךע"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ןטזפלםףתץגבאכושידרחהצךסענמק","ןטזפלםףתץגבאכושידרחהצךסענמק"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("גןאףבטכסריץצתדהמךשלקועפםזחנ","גןאףבטכסריץצתדהמךשלקועפםזחנ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("עתפורץאקבשזףלךחםכניצסטמדןגה","עתפורץאקבשזףלךחםכניצסטמדןגה"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("תרנםףחשןבכלדטהיגוספאקצזמעץך","תרנםףחשןבכלדטהיגוספאקצזמעץך"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("מונהתיעדץךקשםאצסןטזגףרכפבלח","מונהתיעדץךקשםאצסןטזגףרכפבלח"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("סבעלאזהפשגרטיוםץכףמןקךצנדחת","סבעלאזהפשגרטיוםץכףמןקךצנדחת"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("צםינמבלרזכךטחסעןאתףוקשפהגדץ","צםינמבלרזכךטחסעןאתףוקשפהגדץ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("םיפאשחעדןכטבתמזףץהוצסלנרגךק","םיפאשחעדןכטבתמזףץהוצסלנרגךק"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ךטףלםרתמנגןכץעחדספוצאזיהקשב","ךטףלםרתמנגןכץעחדספוצאזיהקשב"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("שיךצלכנגףחבסןמערתםזטקהודאץפ","שיךצלכנגףחבסןמערתםזטקהודאץפ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("עזמאסשפיםרקוגץחבטלןדהףכךתנצ","עזמאסשפיםרקוגץחבטלןדהףכךתנצ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("חלבםנתטעכךףמןשזקץהצאסדפרויג","חלבםנתטעכךףמןשזקץהצאסדפרויג"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("קנירדשסצםפאףגךכטןעתמהובלחץז","קנירדשסצםפאףגךכטןעתמהובלחץז"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("זבצשכןאיחומעתגףפרקסלץטםהדךנ","זבצשכןאיחומעתגףפרקסלץטםהדךנ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("קתוחכרפנעגלאציץדךזבףהםמןשסט","קתוחכרפנעגלאציץדךזבףהםמןשסט"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("םףאושזבתחפנקןלעמצגטךירסדהכץ","םףאושזבתחפנקןלעמצגטךירסדהכץ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("תךחגדקטםמפףינאסהבלרשזצוץעכן","תךחגדקטםמפףינאסהבלרשזצוץעכן"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("סבשגלףחךצתדפםןירהוקכמץטנאזע","סבשגלףחךצתדפםןירהוקכמץטנאזע"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("תקםופךףחאדטישזהלכענברץגסןצמ","תקםופךףחאדטישזהלכענברץגסןצמ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ףדפגלךםטותקזצשנירסהמכןחעץאב","ףדפגלךםטותקזצשנירסהמכןחעץאב"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ןםתרףכחץאעסצהמגבךוישנזפדטקל","ןםתרףכחץאעסצהמגבךוישנזפדטקל"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("מהץןףךרואבדיתזסםעקלשנגצחפטכ","מהץןףךרואבדיתזסםעקלשנגצחפטכ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("צףץאיטןבפתםכהחמקוזגדרלענסשך","צףץאיטןבפתםכהחמקוזגדרלענסשך"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ץמאעקיצושסםלפתףזחנןכךטהרגבד","ץמאעקיצושסםלפתףזחנןכךטהרגבד"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("עףטןסקכתשלץםגמחצבוינזאדךפהר","עףטןסקכתשלץםגמחצבוינזאדךפהר"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("לץעםפןתמףטךנחשצהדבקריסגוכאז","לץעםפןתמףטךנחשצהדבקריסגוכאז"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("כסךעצגקהזןנשרםוילףתחדץאבפמט","כסךעצגקהזןנשרםוילףתחדץאבפמט"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("זנהרילשטץמדוסתףחכםאעגךצןפבק","זנהרילשטץמדוסתףחכםאעגךצןפבק"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ץוםמדףטאחלנשסרבתזצפךןכגקעיה","ץוםמדףטאחלנשסרבתזצפךןכגקעיה"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("זסךיטמהתןצףקעגאבץםדורפכלשחנ","זסךיטמהתןצףקעגאבץםדורפכלשחנ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ןסקהנוךצפלשבזםטרףיחגתמאעכדץ","ןסקהנוךצפלשבזםטרףיחגתמאעכדץ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ץלרקתכפאףהעסבטגםמישזצחוךנןד","ץלרקתכפאףהעסבטגםמישזצחוךנןד"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("קדתבםיןאגחךעפנסלמכהטוץףזשצר","קדתבםיןאגחךעפנסלמכהטוץףזשצר"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("צכהופבמםןזסדעגלקשרץיטףךנאחת","צכהופבמםןזסדעגלקשרץיטףךנאחת"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("דרתאעקןשהךצזנחגבילפףכמטץםוס","דרתאעקןשהךצזנחגבילפףכמטץםוס"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("אטערנזםוהןסצקלפחךדףגיץשמתבכ","אטערנזםוהןסצקלפחךדףגיץשמתבכ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("בולטץסםזקדארףמכךניןצתפחעגהש","בולטץסםזקדארףמכךניןצתפחעגהש"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("עמפהגםצקדףאלטנןץשסיכתרךבזחו","עמפהגםצקדףאלטנןץשסיכתרךבזחו"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("לסףזבכטחפתנםגוירעןץצקהאךמדש","לסףזבכטחפתנםגוירעןץצקהאךמדש"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("בםןוחנגדאךשפהרמעצץיטתלכקףזס","בםןוחנגדאךשפהרמעצץיטתלכקףזס"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("כטנרץעחפקםשאלבמצתגךסףידהזןו","כטנרץעחפקםשאלבמצתגךסףידהזןו"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("נמיכתקרצפחףאךןבסזםשהץגלדטעו","נמיכתקרצפחףאךןבסזםשהץגלדטעו"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("קמםבץשסנגחיפהןתאעטצףלדךוזכר","קמםבץשסנגחיפהןתאעטצףלדךוזכר"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("אםדןחףעמזבכנגץשלסטצרהתיךוקפ","אםדןחףעמזבכנגץשלסטצרהתיךוקפ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("יבפתץלםחזךסגרועדהףאשנטכצקמן","יבפתץלםחזךסגרועדהףאשנטכצקמן"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("מהגטנצץכשסארךקדתםףןעליחזובפ","מהגטנצץכשסארךקדתםףןעליחזובפ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("באטצמסוזהרץכפשתדףליןחגקנךעם","באטצמסוזהרץכפשתדףליןחגקנךעם"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("אחעטןךסדמנקולםתהצבכיפץגשרזף","אחעטןךסדמנקולםתהצבכיפץגשרזף"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ברגאשצקוץכךהיפחלתמטףסדםזנען","ברגאשצקוץכךהיפחלתמטףסדםזנען"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("סועזנשקכחבפםןךףיאץדמהצתטרלג","סועזנשקכחבפםןךףיאץדמהצתטרלג"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("נלאצםעהפכבקשןטיףוגץרחזדתךמס","נלאצםעהפכבקשןטיףוגץרחזדתךמס"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("העןכרקםצתניטפץשבמאגחדףולזסך","העןכרקםצתניטפץשבמאגחדףולזסך"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ןםבורזהחטץנלמקאתכעצךיפסגףדש","ןםבורזהחטץנלמקאתכעצךיפסגףדש"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("טתעףצסרשחנןמדךבהזאלוגפםקכיץ","טתעףצסרשחנןמדךבהזאלוגפםקכיץ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("טצעדתמץשגוןהנףסבקחפאךכזלרםי","טצעדתמץשגוןהנףסבקחפאךכזלרםי"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("עצבמוסרכפדהשגםנקיךלתףןץטחאז","עצבמוסרכפדהשגםנקיךלתףןץטחאז"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("לץפדןםגנקףמעתבשוחציזטהאכסרך","לץפדןםגנקףמעתבשוחציזטהאכסרך"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("סתרגשיעמןלנבטקץודכףאםהזצחךפ","סתרגשיעמןלנבטקץודכףאםהזצחךפ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("נוצגסבףהךקןתלמעכדחאץריזטפםש","נוצגסבףהךקןתלמעכדחאץריזטפםש"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("עמכדוהגשזטפלנךםץיצסףחןתבארק","עמכדוהגשזטפלנךםץיצסףחןתבארק"));
}

CTEST(Cases_compare_simple, arabic)
{
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("زعضبتحةطغأإظئشكءس×اـدذجفؤصرآثخق","زعضبتحةطغأإظئشكءس×اـدذجفؤصرآثخق"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("شةزذصأعـابءئثآتفطخجسحدقرغإؤ×ضكظ","شةزذصأعـابءئثآتفطخجسحدقرغإؤ×ضكظ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ق×سزظصأطحعؤآدبئضغشـذةرجاختثكءإف","ق×سزظصأطحعؤآدبئضغشـذةرجاختثكءإف"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("صآذرإئ×بقـفضزخجسعثظغتأكادؤةحءطش","صآذرإئ×بقـفضزخجسعثظغتأكادؤةحءطش"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("إكخـثظضحؤآسدجعةتازطشبرصذءقئغأ×ف","إكخـثظضحؤآسدجعةتازطشبرصذءقئغأ×ف"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("فآكثطئعأخشذإغةدظؤـزس×قرتبضاصجحء","فآكثطئعأخشذإغةدظؤـزس×قرتبضاصجحء"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("صغزبط×ؤتكشحأظعجذةثفدءاضرإـسئخقآ","صغزبط×ؤتكشحأظعجذةثفدءاضرإـسئخقآ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("كرحدتط×عفشخآأبئجزةقذـاءسضصثؤإظغ","كرحدتط×عفشخآأبئجزةقذـاءسضصثؤإظغ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("زءذث×ضكعرأفشدتقـئطاةظإبسخصحجؤآغ","زءذث×ضكعرأفشدتقـئطاةظإبسخصحجؤآغ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ـةئتظجعكثزبؤطادقصذ×ءسغخفشضحإآأر","ـةئتظجعكثزبؤطادقصذ×ءسغخفشضحإآأر"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("بأزحكآسطخؤذـرغ×فةءعئضقثدصجظشاإت","بأزحكآسطخؤذـرغ×فةءعئضقثدصجظشاإت"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("دشساؤقخأعئطآبجإت×صءذةحكرظفثضـغز","دشساؤقخأعئطآبجإت×صءذةحكرظفثضـغز"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ثعؤةخطسءئأحزدجآرضبفغاقكشظإذ×صـت","ثعؤةخطسءئأحزدجآرضبفغاقكشظإذ×صـت"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ةءدخضتث×صآرفظحكزأبسقإؤجذعـاشطئغ","ةءدخضتث×صآرفظحكزأبسقإؤجذعـاشطئغ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("حفعسزثض×ءخئبذةراـقأظؤغتصشآكطجإد","حفعسزثض×ءخئبذةراـقأظؤغتصشآكطجإد"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ظائإجـثصسةتكقغفءذبؤآشدخرضحزطأ×ع","ظائإجـثصسةتكقغفءذبؤآشدخرضحزطأ×ع"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ضـكطرشدبظآةءتزجصحأخ×ثاسؤغقعفذئإ","ضـكطرشدبظآةءتزجصحأخ×ثاسؤغقعفذئإ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("دآق×ؤشغأطزكظئـةصضءحجثإذساعخفترب","دآق×ؤشغأطزكظئـةصضءحجثإذساعخفترب"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("قرظصضك×فدآثـتسحءغزبشائإطخأعذؤجة","قرظصضك×فدآثـتسحءغزبشائإطخأعذؤجة"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("شع×اطقغرأضزفذثدسكآءةإحظصؤخـبئجت","شع×اطقغرأضزفذثدسكآءةإحظصؤخـبئجت"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("جثسصزرخغعبـأؤةائءظضفإحآد×قتطذكش","جثسصزرخغعبـأؤةائءظضفإحآد×قتطذكش"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ضءقطز×دإغرظاأسعحصـذئتجبآخثكفةشؤ","ضءقطز×دإغرظاأسعحصـذئتجبآخثكفةشؤ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ـئذفآضثتجسزأخاغدصشظقبرطك×عحإؤءة","ـئذفآضثتجسزأخاغدصشظقبرطك×عحإؤءة"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("شغدؤعزطتأـظجسآبثضفكءخإذرئق×ةصحا","شغدؤعزطتأـظجسآبثضفكءخإذرئق×ةصحا"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("أئعضتسإؤةزءفحاـطك×جظقآشصدذثبخغر","أئعضتسإؤةزءفحاـطك×جظقآشصدذثبخغر"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("غةفأضشجئطكبـإخقزءثآسترحذ×عصؤاظد","غةفأضشجئطكبـإخقزءثآسترحذ×عصؤاظد"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("×خقؤعـاشفجأصحةإئرزظضطكثذآغتدبسء","×خقؤعـاشفجأصحةإئرزظضطكثذآغتدبسء"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("أفذآةكحرـجخشؤقبصساغدء×تثضإعزطظئ","أفذآةكحرـجخشؤقبصساغدء×تثضإعزطظئ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("سبفؤأذعصتثئرطج×ـزشحاةضدخقآإءكغظ","سبفؤأذعصتثئرطج×ـزشحاةضدخقآإءكغظ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("صسحجاأدظـعكذآثئشب×زترءقفؤةإضطغخ","صسحجاأدظـعكذآثئشب×زترءقفؤةإضطغخ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ةكث×ءعدسشصغآحظزبرئضـأتذإفقجؤخاط","ةكث×ءعدسشصغآحظزبرئضـأتذإفقجؤخاط"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("آضتأش×ذعسءجطفكقظـصدئرخإةاؤثغحبز","آضتأش×ذعسءجطفكقظـصدئرخإةاؤثغحبز"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("كدجت×ـظضسطشثفءعئبذةصإزأاغخقرؤحآ","كدجت×ـظضسطشثفءعئبذةصإزأاغخقرؤحآ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ضقفجذ×طإشزدؤحاخثةأركعبئظسـصآءغت","ضقفجذ×طإشزدؤحاخثةأركعبئظسـصآءغت"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("صأدظطكث×جاغسحبزةشخئفذرإـضقؤآءتع","صأدظطكث×جاغسحبزةشخئفذرإـضقؤآءتع"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("كـآؤأدزقة×بافصشتذظسغءثطإضخرئحجع","كـآؤأدزقة×بافصشتذظسغءثطإضخرئحجع"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("عأآضزتفؤصح×سذطةئدغظخقثإـكءشرجبا","عأآضزتفؤصح×سذطةئدغظخقثإـكءشرجبا"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("عكأصطظشؤفجدسذح×ئخضزآاإبثـقتةءغر","عكأصطظشؤفجدسذح×ئخضزآاإبثـقتةءغر"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ءغكؤصخش×فابدـعترطأضآزظسجحإئقذثة","ءغكؤصخش×فابدـعترطأضآزظسجحإئقذثة"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ذـغثاضقخزإعفةئؤءسشرطكبص×دجأظآتح","ذـغثاضقخزإعفةئؤءسشرطكبص×دجأظآتح"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ءـظفصذرطسقإغحخ×أئكزضشاتدبثؤةآجع","ءـظفصذرطسقإغحخ×أئكزضشاتدبثؤةآجع"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ظصؤاغثذدـتعآحرجطةءسإقضبشزخكئأف×","ظصؤاغثذدـتعآحرجطةءسإقضبشزخكئأف×"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ثآزصئءةعضأسجقكتفشراـبإغظ×ذحدؤخط","ثآزصئءةعضأسجقكتفشراـبإغظ×ذحدؤخط"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ئآدبذغسظفطجشزقرحءةخكصـعاتض×ؤثإأ","ئآدبذغسظفطجشزقرحءةخكصـعاتض×ؤثإأ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("شغزطرؤآبعسفخءأـظحةصقكدتا×إجئضذث","شغزطرؤآبعسفخءأـظحةصقكدتا×إجئضذث"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("كغؤحظدثإفعسقـئضجء×ذطتآبشرخأصةزا","كغؤحظدثإفعسقـئضجء×ذطتآبشرخأصةزا"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("بأحثءـطصئ×ضدقؤسخكعزشةفذاإظجآرتغ","بأحثءـطصئ×ضدقؤسخكعزشةفذاإظجآرتغ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("كثفةتصءذقبازـظشسطخر×ؤآإغضعجدحأئ","كثفةتصءذقبازـظشسطخر×ؤآإغضعجدحأئ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("كسأذرغجفئحإـزختءظ×بآطةصشضقؤدثاع","كسأذرغجفئحإـزختءظ×بآطةصشضقؤدثاع"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("فءثئـؤقدرإغبحكسذةزصآخطضأعتجش×اظ","فءثئـؤقدرإغبحكسذةزصآخطضأعتجش×اظ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ةجآظؤرض×طزشبكختثقـفأحءعذئغإسصدا","ةجآظؤرض×طزشبكختثقـفأحءعذئغإسصدا"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("رحت×خؤظسدفةصاثغآذعإضـبجئشأطءقكز","رحت×خؤظسدفةصاثغآذعإضـبجئشأطءقكز"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ظاتغبةؤقعدصفآـثخزطضحإأذئرءكج×شس","ظاتغبةؤقعدصفآـثخزطضحإأذئرءكج×شس"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("جؤصسثءطةدزذقأئإرغحفبتشظ×خاآـضعك","جؤصسثءطةدزذقأئإرغحفبتشظ×خاآـضعك"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ضشإثذطؤصرأءكةسئآفدعقاخبتحجـظز×غ","ضشإثذطؤصرأءكةسئآفدعقاخبتحجـظز×غ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("آعؤتقسدئخأغضحز×رءاثبصظـشكطذةجإف","آعؤتقسدئخأغضحز×رءاثبصظـشكطذةجإف"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("خظئكصءتجإازعحأطقـآدثذبرس×ضؤةفغش","خظئكصءتجإازعحأطقـآدثذبرس×ضؤةفغش"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ذكبـغرئجشخاضةطظآءفحدتقثأزؤ×عصسإ","ذكبـغرئجشخاضةطظآءفحدتقثأزؤ×عصسإ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("اظصعإأآءخفطكئؤ×بدثـزقحتذسضةرجشغ","اظصعإأآءخفطكئؤ×بدثـزقحتذسضةرجشغ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("صذبةإئت×سفعثطغجأضدؤـاشقخآحءزكظر","صذبةإئت×سفعثطغجأضدؤـاشقخآحءزكظر"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("طأضفصدظآاذـقئةخ×زجعشإسبحغتثؤكءر","طأضفصدظآاذـقئةخ×زجعشإسبحغتثؤكءر"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("دسح×ظؤفذبقءجشصاغخثإطزرتـضةكئعأآ","دسح×ظؤفذبقءجشصاغخثإطزرتـضةكئعأآ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("خذسطآدكثظبشجزتغقصـؤءأئاعح×فةإضر","خذسطآدكثظبشجزتغقصـؤءأئاعح×فةإضر"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("غكةفجازت×سبأخئقـثضذطإشؤرظصعدءآح","غكةفجازت×سبأخئقـثضذطإشؤرظصعدءآح"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("تدئؤثآعشظخاإطبكأـفصغزرسج×ءحضذةق","تدئؤثآعشظخاإطبكأـفصغزرسج×ءحضذةق"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("قصشسض×أئعخذباغؤةرزفظطءحجكثتإدآـ","قصشسض×أئعخذباغؤةرزفظطءحجكثتإدآـ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ذآءطؤسث×زشضصتقـجبإئاكفخةدغحرأظع","ذآءطؤسث×زشضصتقـجبإئاكفخةدغحرأظع"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("صزآةضخاترعثسئقكحفذإأؤغـ×شءجطبدظ","صزآةضخاترعثسئقكحفذإأؤغـ×شءجطبدظ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ءإسقؤجزآخرطثعبفصةظا×دئذكشغتأضحـ","ءإسقؤجزآخرطثعبفصةظا×دئذكشغتأضحـ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("كثدحتربظئذإسشصغـآءطخزأفق×جةضاعؤ","كثدحتربظئذإسشصغـآءطخزأفق×جةضاعؤ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ضؤءزاـتعثكطرحئدقسأظفإجذصآ×بشةخغ","ضؤءزاـتعثكطرحئدقسأظفإجذصآ×بشةخغ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ؤبعةفتثجخإـرذضئآظقدغاطأشكزصح×ءس","ؤبعةفتثجخإـرذضئآظقدغاطأشكزصح×ءس"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("حظـثءةسغطتقآاذ×فكخؤبأزصئرشعجضإد","حظـثءةسغطتقآاذ×فكخؤبأزصئرشعجضإد"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ذبقأتجطؤئسغضاردإفءآخة×حزثظشصكـع","ذبقأتجطؤئسغضاردإفءآخة×حزثظشصكـع"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("حجشختـضآقسظإؤرءفئغعكذدازةبأصثط×","حجشختـضآقسظإؤرءفئغعكذدازةبأصثط×"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ءسعفثإ×ضحآظاتدصـكذةقؤخرطبزئغجأش","ءسعفثإ×ضحآظاتدصـكذةقؤخرطبزئغجأش"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ظرأإبطشزدغذؤثقحء×سفاجـصضعآكةتخئ","ظرأإبطشزدغذؤثقحء×سفاجـصضعآكةتخئ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("آسؤفظقغـءزأشصجثعخةطحرذضئاإدبك×ت","آسؤفظقغـءزأشصجثعخةطحرذضئاإدبك×ت"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ثـرظزضغكحتقآسعاصءأ×ذؤشةئبدفجإخط","ثـرظزضغكحتقآسعاصءأ×ذؤشةئبدفجإخط"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ءظارآزبئصكؤغـضإشثسحتخدفط×أجعقةذ","ءظارآزبئصكؤغـضإشثسحتخدفط×أجعقةذ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ئإاعطأسظكجذضثدزتآقؤءصةبحشخغ×فرـ","ئإاعطأسظكجذضثدزتآقؤءصةبحشخغ×فرـ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ـقجح×طآعثسغئفزتشكخصرءةاؤإضبظدأذ","ـقجح×طآعثسغئفزتشكخصرءةاؤإضبظدأذ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ذجءبط×زإكأحةصسؤتضخـرظقعثئدفغشاآ","ذجءبط×زإكأحةصسؤتضخـرظقعثئدفغشاآ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("جرـفؤحدزذتئسآصكبخةضق×اإشعغءظطأث","جرـفؤحدزذتئسآصكبخةضق×اإشعغءظطأث"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("اضرصقع×خسبإشتكآزظؤأئفحطغجةدءذـث","اضرصقع×خسبإشتكآزظؤأئفحطغجةدءذـث"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("كتإئذأظؤضثسعةحفشطاـآدخقء×بغزصرج","كتإئذأظؤضثسعةحفشطاـآدخقء×بغزصرج"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("سذقحزطثدأعؤ×برفضخغتـجءآةئظشاصكإ","سذقحزطثدأعؤ×برفضخغتـجءآةئظشاصكإ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("رجإكـبةظشصأا×ضعؤقفزءئتذدثآخطحسغ","رجإكـبةظشصأا×ضعؤقفزءئتذدثآخطحسغ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ظخكسفثؤصءاذبتآضئشقإزجر×طـعحأةدغ","ظخكسفثؤصءاذبتآضئشقإزجر×طـعحأةدغ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("غزدئؤ×بقةحعإءصضأكخـظآطرثاجفشذتس","غزدئؤ×بقةحعإءصضأكخـظآطرثاجفشذتس"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("شتجرظءآبزط×إثذقعصةضأؤدـاخئغكسحف","شتجرظءآبزط×إثذقعصةضأؤدـاخئغكسحف"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("حتضـأطصئبرجشآثد×فخزظةقءذاؤإكغعس","حتضـأطصئبرجشآثد×فخزظةقءذاؤإكغعس"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("كرعئصةش×ءبطآضسخأظـدؤجثذغحزتفاقإ","كرعئصةش×ءبطآضسخأظـدؤجثذغحزتفاقإ"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("ؤأاـضتظشئإبجزحدط×كخرذآسصةءثفغقع","ؤأاـضتظشئإبجزحدط×كخرذآسصةءثفغقع"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("كثعظف×ءصةسإغتئآأخدذرؤحقشطزبجـاض","كثعظف×ءصةسإغتئآأخدذرؤحقشطزبجـاض"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("عذسخض×طإشقظؤئبثصزرجـاكآءةغدحفأت","عذسخض×طإشقظؤئبثصزرجـاكآءةغدحفأت"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("قتصءدؤشسأـغزبجعطرظةضثخآكإذفح×ئا","قتصءدؤشسأـغزبجعطرظةضثخآكإذفح×ئا"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("شإذ×ؤعآظرزثستةفـجئبطءأادغقحكضخص","شإذ×ؤعآظرزثستةفـجئبطءأادغقحكضخص"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("جآبةصعظـإرفئاأذثخحدقسغ×ؤشكطتءضز","جآبةصعظـإرفئاأذثخحدقسغ×ؤشكطتءضز"));
    ASSERT_EQUAL(0, a_icmp_simple_cstr_cstr("إضاختذطفجبشظآؤأءئصعزدثرغقسة×حـك","إضاختذطفجبشظآؤأءئصعزدثرغقسة×حـك"));
}


CTEST(Cases_compare, uneven_checks)
{
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("", "")); 
    ASSERT_NOT_EQUAL(0, a_icmp_cstr_cstr("", "1")); 
    ASSERT_NOT_EQUAL(0, a_icmp_cstr_cstr("1", "")); 
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("1", "1")); 
    ASSERT_NOT_EQUAL(0, a_icmp_cstr_cstr("1111111111111111111", "")); 
    ASSERT_NOT_EQUAL(0, a_icmp_cstr_cstr("", "1111111111111111111")); 
}

CTEST(Cases_compare, basic_latin_test)
{
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("aaaaaaaaaaa", "AAAAAAAAAAA"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("A", "a"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("AbCdEfGhI", "aBcDeFgHi"));
    ASSERT_NOT_EQUAL(0, a_icmp_cstr_cstr("A", "Aa"));
    ASSERT_NOT_EQUAL(0, a_icmp_cstr_cstr("aA", "A"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("aaaaaaaaaaa", "AAAAAAAAAAA"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("the quick brown fox jumps over the lazy dog",
                                         "THE QUICK BROWN FOX JUMPS OVER THE LAZY DOG"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("THE QUICK BROWN FOX JUMPS OVER THE LAZY DOG",
                                         "the quick brown fox jumps over the lazy dog"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ThE QuIcK BrOwN FoX JuMpS OvEr tHe lAzY DoG",
                                         "tHe qUiCk bRoWn fOx jUmPs oVeR ThE LaZy dOg"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("tHe qUiCk bRoWn fOx jUmPs oVeR ThE LaZy dOg",
                                         "ThE QuIcK BrOwN FoX JuMpS OvEr tHe lAzY DoG"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("THE QUICK BROWN FOX JUMPS OVER THE LAZY DOG",
                                         "tHe qUiCk bRoWn fOx jUmPs oVeR ThE LaZy dOg"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("tHe qUiCk bRoWn fOx jUmPs oVeR ThE LaZy dOg",
                                         "THE QUICK BROWN FOX JUMPS OVER THE LAZY DOG"));
}

CTEST(Cases_compare, extended_to_greek)
{
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ČĀĆĂĈĄĊČĀĆĂĈĄĊČĀĆĂĈĄĊČĀĆĂĈĄĊ",
                                         "čāćăĉąċčāćăĉąċčāćăĉąċčāćăĉąċ"));  
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ABCĎĊĀČĂĆĄĐĈABCĎĊĀČĂĆĄĐĈ",
                                         "abcďċāčăćąđĉabcďċāčăćąđĉ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ɃɄɅɆɈɊɌɎ",
                                         "ƀʉʌɇɉɋɍɏ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("aaaaaaaaaaa",
                                         "AAAAAAAAAAA"));
    
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("àáÂãäåæçÈÉêëÌÍîÏðñÒÓÔõö÷øùúÛÜýþŸĀĀăĂąąćĆĈĈĊċČčďĎđĐēēĕĕĖĖęęěěĝĝĞğĠġģĢĤĥħħĩĨ",
                                         "ÀáâÃÄåæÇÈéêËÌíÎïÐÑÒÓÔõÖ÷ØÙúÛÜÝÞŸāĀĂĂĄĄćĆĈĉĊċČčĎďĐĐēēĔĔĖĖęĘĚĚĝĝĞĞġġģĢĤĤħħĩĩ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ÀáÂÃÄÅÆçÈÉêËìÍîÏðñòóÔÕö÷ØùÚÛüÝþÿāāăĂąąććĉĉĊĊČčĎĎđĐĒĒĔĕĖėęĘěěĜĜĞĞĠġģģĤĥĦĦĨĨ",
                                         "ÀáÂÃÄÅÆçÈÉêËìÍîÏðñòóÔÕö÷ØùÚÛüÝþÿāāăĂąąććĉĉĊĊČčĎĎđĐĒĒĔĕĖėęĘěěĜĜĞĞĠġģģĤĥĦĦĨĨ"));

    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ğÌêĔüÂæăÒÐėćčāÉĩēđĚħÈėíġàËĈęÃĢċąĉġĘĨĤĕĂąċÕ÷āĝÖÿĎùÓÇČÔĝÏĎĞØÅÁÛěħýäēćÎÚĢÑĐÞĥ","ğÌÊĔüÂÆăòÐėĆčāéĩĒđĚĦèĖíġàËĈęãģċąĈġĘĨĥĔĂąċõ÷ĀĜÖÿďùóçčôĝïĎĞøÅáÛěĦýÄĒćîúĢÑĐþĤ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("đëČĊæěçÖćÞÍóęėáąÔÈČēÅĎĂêüÙĥØñúĤĉðŸĈĊğõćąÒĒĂéïĖÂĝĎĕĀĩÃģÛĘĦĦÝġ÷îĔğÌĜĢàÄđĠěāĨ","đëČċæĚçöćþíóęĖáĄôÈČēåďĂêÜùĥØñÚĤĉÐÿĈċĞÕĆĄÒĒăéÏĖÂĝĎĕāĩãĢûĘħĦýġ÷ÎĕĞÌĜģÀÄđĠĚāĩ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("Âċ÷ėýĠąĆĀĒĚĤĕÞĜàěçØõÄÔÏĒęĂħĨóĞÜĨĊðÃđĀÑùîúĐêĝďæČĘĂĉĥġòğåĉÉÍčďģÿĆĄÖëûÈĕáĢĖĦÌ","ÂĊ÷ĖÝġĄĆāĒĚĤĔÞĜÀĚÇøÕäôÏĒęăĦĨÓĞüĨċÐãđĀÑÙîÚĐêĝĎÆčĘăĈĥġÒĞåĈéíČĎĢÿćĄöËÛèĔáĢėħì"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ðĖĆČÝđċÚĕĘąĎĈöøĆĠÕēĥāíïĐĥĈÎÊĞĄÄĂħĜČÙ÷áěĝāĦĞĂìñėĕŸĢçĩæĨďüËÈãÞôĠĊóěÅâÉĘģÛÀÒĒ","ÐĖĆčÝđĊÚĔęĄĎĈÖØĆĠõēĥāÍïđĥĉîêğąÄăħĜčù÷ÁěĝāħğĂìñėĔŸĢÇĩÆĨĎÜëèãþÔġĊÓěåâéĘģûàÒĒ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ąÂĜĥĀĞęċėęáĒûÏÊýĥòĨĢČčĩéĎÞćāĈĜŸëġÌÅĚùĕàĆñÔĊÇØúõďħÜĔÖĄÈãđđĚÎĂÆġģĉÐĞėĂóäĦ÷ēí","ąâĜĤāĞęĊėĘáĒÛÏÊÝĥòĩģčČĨÉďÞćĀĉĜÿËĠÌåěÙĕàĆñÔĊÇØúÕďĦÜĕÖĄÈãĐđĚîăæĠĢĈÐĞėĂÓäĦ÷ēí"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ħďÀĄěĘðÓùöāõĊĒĖÃčĞĨĖĕĘĢåÚïèØďĕĦÎĠÄüĤÝ÷ĈĄÛĨæĠÂğôĝĐòĤáÇÞëĀÌćēíĆčñċĐĂêĉŸĝéĂěģ","ĦĎàąĚęðÓÙÖāõĊēėÃčğĨĖĕęģÅúÏÈØĎĕħîĠÄüĤÝ÷ĈĄÛĨÆġâĞôĜĐòĥÁÇþËāìĆĒÍĆČñċđăÊĉŸĝéĂĚĢ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ČĎęãĂĜĆêúęÌçĀćÔăØóċāĤēĤğħÆõÞÜĐĔğĉěÈá÷ĦģÎÂïēěÉąĕðËÄġåġąĝÛÒĖďöĢñČÀÙĨÝđĖĨíċĈÿ","čĎĘãĂĝćêÚĘÌçĀĆôĂØÓĊĀĤĒĥĞħæõþüđĕğĉĚèÁ÷ĦĢÎÂÏĒĚéąĕðëäġÅġĄĜûÒėďÖĢÑčÀùĨýđėĩíċĈŸ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ÏÓ÷ĜþĥĆĊĘÑăěğŸÛđġħùĆÍĈĒüĖîçÝāĈĝğĔòÁÆąęÅċÃČËÐĒĥďģêĄÈÖĖÄĩàÉĢďĐĦāĕâĚøčĨÕĂĠÚìô","ÏÓ÷ĜþĥćĊęÑăĚĞÿûđĠĦÙĆÍĈēüĖîçýĀĈĝğĔòáÆĄĘÅċÃČËÐĒĤĎĢêĄèÖėÄĩÀéĢĎđĦāĕÂĚøčĩÕĂĠÚìÔ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ÂČĊŸĤĈĄāėÙĜąěĜđĤÜģĕĘèĠåěõĐĂĨĊÒæÇČĞøēćîĆēĂáêàÖĨĦģÔďĖğ÷āĎĈíÐËĕúÃñęħÓäÞġÛýÏìé","âčĊŸĤĉąāėùĝąěĜĐĥüģĔĘÈĠÅĚÕĐĂĩĊòÆçčğØĒćÎćĒĂÁêÀöĩĦĢôĎėğ÷ĀďĈÍðëĔÚãÑĘĦÓÄþĠÛýÏÌÉ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ËĕûąĊþÓęćĂģĒĤüÁĔČÕē÷ìĞāÙęĜĉĖÔŸíøîĤĆýÒÂğĈħĚěđÃČåĜÆĎĢėĩèĄġàĊÊðúāçÑÉÄġđĩöĂĦÏď","ËĕûąċþóęĆăĢēĥÜáĔčÕē÷ìğāùĘĝĈėÔŸíØîĥĆÝòÂğĈħĚěĐãČåĜæĎĢĖĩÈąġÀċÊðúĀÇñéÄġĐĩÖĂħÏĎ"));
    
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("îÏÅùÞģæÖġôÛËèċàÎóĔĚąÔûğÐğĜ÷ðøĜÄė×čāãÆÒÁĎÕØÈĈåġþéÁĆÂóÏĔÖÇđÜĂãÌŸĒģÄďĐăęĘĚćçÍĈËēÕčêÝÀĄúÒýÑÜùßÌÉÍÚêÂĀÑĖĊ","ÎïåùÞĢæöġôÛëèċÀÎÓĕěąôÛğðĞĝ÷ÐØĝÄė×ČĀãæÒáďõØèĉåġþéÁćÂóïĔÖçđÜĂÃÌÿēĢäďđĂęĘěĆÇÍĉËĒÕčÊýàąúÒýñüùßÌéÍÚÊÂāñĖċ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ĜäÔĚÂÚĀÎĄÉÄēèĘìýÆČüÀâĖêÙÊġĉĝîÃöÖĔģÃñóóúĕďòĊûõćçèþęÌÝÛÆËÒÏĄáðÅíøĠÅôÜėéõĐćğÑģË÷Ď×ăáċßùøĐčĂïĚðğþĀçĒÿàĉÍ","ĜÄôěâÚĀÎąéäĒÈęìýæČÜàÂėêùêġĈĝîãÖöĔĢÃñóóÚĕĎÒċûõćÇèþĘìýÛÆËÒïĄáÐÅíØĠåôÜėéÕĐćğñĢË÷Ď×ăÁĊßùØđČăïěðğÞāÇēÿàĉÍ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ēöėÏĎÄê÷ËÂòĜÆĠùÌģÃĘĠàÁÄāĂØÈĖĐÁćÊôęÖÓÑçÛĊüĒÈÎĂģğüòÙéðÆøÔčÚÑåþĊïĚĎûåÕāĚĉąßĆÕĜĈëýÿâčÀ×ÇéãĐÍîÍğóĄúþÐĔĕÝì","ĒÖĖÏďäÊ÷ëÂòĜÆġÙÌĢãęġàáÄĀăØèĖĐáĆêÔęÖóñÇûċüĒèîăģğÜÒùÉÐÆøôčúñåþċÏěďûåÕĀěĈąßĆõĜĈëÝÿÂČà×çéãđÍÎÍĞóąÚþðĕĔÝÌ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ëöąÛģñĠĞÀÎėÊéÞĆÔĂÒ×áĞñĘÚìðâÝŸĝÏèðĊãæõĚåïāĀíĕôĂÓæÎÃÇäÅďÇġĐćÌēĘéèüÁģûêøöÙċėĉúØĜĎËěþÒÙÄ÷ÍÂĕßÝõüēĈčČĄÀóđ","ËÖąÛĢñġĞÀîėÊÉÞćôĂò×áĞÑęÚìðâÝŸĜïèÐċÃÆÕĚåïāĀÍĕôăóÆîãÇäÅĎÇĠđĆÌēęéèÜÁģûÊøÖùċĖĉÚøĝďëěþÒÙä÷ÍâĕßÝÕüĒĈČčĄÀÓđ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ĠæùÛØÑÖÓġÊāğĘČËĝÌâĘÊćĉēþíçÉßúÄėĚđÅåĜðäöēÕîüøÀďÃÓàĆÁďïýôðûþèÜĔ×ąąĢĞĔĂĊãđÚñĊŸîÝÍõĉģôÁčÉçÈĀËÌïĂùÒòÂæ÷Ěė","ĠÆùûøÑÖÓġêāğęčËĜÌâęÊĆĉēÞíçéßúÄėĚĐÅÅĝÐäÖēõîÜøÀďÃÓàĆÁďÏýÔðûÞèÜĕ×ĄąĢğĕăċãđúñĊÿÎýÍõĉģôÁčÉçèāËÌÏăùÒÒâæ÷ěė"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ŸÛßčôùñĕÅèĒÚăóĀĚþüąäģÀÊĜÙğÃçðþáĆÉâøċĒãôõÒÐĘìÆæ÷íďĄõĐĕģÏîĉÇÖëđĎàÊñØèăęĆāėÝČÉâėáíÒġĉ×óġëÄúÌûěÎċïüğĝÅÖý","ÿÛßčôùÑĕÅÈēÚăóāĚþÜąäĢÀÊĝÙĞãÇðÞÁćéâØċēãôõÒÐĘÌæÆ÷ÍĎĄõđĔģÏîĈÇÖËđďÀÊñØÈĂĘćāėÝčéâėáíÒĠĈ×ÓġËäúÌÛĚÎċïÜĞĝÅÖý"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ñâëîõÞğćęĂÀěïÌùóģÔÉÜĒöõÅďãąėûÐéčĐÇûàßêÜèÒÙìąĊúĖíÔŸáÇĉĂÂæĊíČóñďøēÆêĔÖģĕÝòĀïđäğÎýÃëÁāĜćÈġÚ÷ġÞĘ×ěåĝĉäðø","ñâËÎÕÞğĆĘăàĚÏìùóĢÔéÜēöÕåĎÃąĖÛÐÉČđçÛàßÊüèÒÙìąĊúĖíÔÿÁçĈĂâÆċÍčóÑďØĒæêĕÖģĕÝÒāÏđÄĞîýãëÁāĝĆèġú÷ġþę×ĚÅĜĈäÐØ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ÐßÃđÅÓÖ×ÁāñÂÞÏĜĎÛÆòÿĜğĆăěþđëĠÌ÷ČëēèíċîÑĂĉôĠäÚċêÂÀģúąÄĆçąęìÆęðôûĀĚĞÕïòģãÝÕēÜĕýêÙÉÇøÎĈČĕėĎÙÓÈíÅÁĖøÖéüÀ","ÐßãđåÓÖ×áĀñÂþïĜĎÛæòŸĜĞĆĂěþđËġì÷čËĒèÍċÎÑĂĈôġäÚĊêâÀģúĄäćçąęÌÆĘÐÔÛĀěğÕïòĢÃýÕēüĔÝÊÙéçøîĈčĕĖĎùóÈÍÅÁĖøöéüÀ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ĢøÌÖĠÖĠâċÃÕģĀÉÙŸêæÈčÓåòàĎñûíěÇĔüëęĂėýğËçĄĉĐæĆÉÎÏÃĕÈßîÕØČÂýúðď×ĖÁĈùĐĆÞêċĜñÜÞòĜûäąôÏúĒēôğ÷óęÍāáðĚăÄÌàå","ģøÌÖĠÖĠÂĊãõģāÉùŸÊÆÈčóåòàĎÑûíĚÇĕÜëęĂėýğëçąĉđæćéîÏãĔèßÎÕØčâÝúðď×ėáĈùĐĆÞÊċĝÑüþòĝÛÄąôïÚēĒÔğ÷óęíĀáðěăäìàÅ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ÀĚÉĄøþáďÐþēĈÇäÏÛÔĄĀĀñÔĞ×ÖßâęëćÃèÙçÄĔéú÷ÏËĈÕćæøÖĔÎÙďÚÒėĘăÈĐčüÅģîÃÅēĠÜýċðĠÊĜÓñăČàÕĢĞĐáŸÍêÌĚóýíìĊėæĜâòû","àĚéąØÞÁďðÞĒĉçäÏûôąāĀñôğ×ÖßâĘëĆãÈÙçäĔÉú÷ÏËĈÕćæØÖĔÎùďÚòĖĘăÈđčüÅĢîãÅēĠüÝĊðĠêĜóÑăČÀÕģğĐáÿíêÌěÓýíÌĊĖÆĝâÒû"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ĘÕàÞÔÓÊòĘßĂÐØÙğ×ìčåëãĆÍÖÝõÀÚģċ÷ĚýòêĠďĜçÆĂèÑóąáÌËčÈĈđĉÿĖÖïÎúÔÆđĞĖÂāĔüÏēĕåĝÑÂěØÁíćģÛûĎüĊãäÄĀÞąÇÉēġÎùÉð","ęÕÀþÔóêÒĘßăÐØÙĞ×ìČÅëãćÍÖÝõÀÚģĊ÷ĚýÒêĠĎĝÇÆăÈÑóąáÌËčèĈđĈÿėÖïîÚÔÆđĞĖÂĀĔüïĒĕåĝÑÂěØÁíćģûûĎÜċãÄÄĀÞĄçéēġÎùÉð"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ăâñÍąÐùĆċċÎæúôÁĒöĕ×ăÒÅÒďĖúęÊßÔÑĢěĠĜĝĚđäÇ÷ÊðÓĄûæÄéĢÜÓüĀûđãÅèèčàÝÃĀìĎçėíëùìâġÁëøĉčÕĒĕĘïïğćýàÿĞøÕÉþÎöÞĉ","ĂâÑíĄðÙĆċĊîæÚôÁēÖĔ×ăòåòĎĖÚĘÊßôñĢěĠĝĜěĐäç÷ÊðóąÛÆÄÉģÜóüāûĐãÅèÈČÀÝÃĀÌĎçėÍËùÌâĠáËØĈčÕĒĔęïÏĞćÝàÿĞøÕéÞÎÖÞĉ"));
        
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("÷íĆĘõÏĘoÞJJgġcaÌLÕÆPôÊÊyKxZL[QéÏMþîIĚhÒxĢčğÛàëcùBāUĈÇÂÉànäýifqîOąÃÚYnðZØēåÚñd×ËĊÈtĄæėç^ñĚáWKMsĜeÃÛÿGVĎġÔģødHÈäF\\üăRđ_UėìĕÓĀesðĐWrTċÜA]ÁöbÓÂčĒòďÝÍĂpÙĕĆĜĞßöåĈ`V","÷íĆęÕïĘoþjJgġcAìLÕæpÔÊêykxzL[qéïmþÎiěhÒxĢČğûÀëCùbĀUĈçÂÉÀnäÝifqîOąãÚYNðZøĒåÚñD×ëĊÈTąÆėÇ^ñĚÁwkMSĜEÃÛÿgVďĠôģøDhÈÄf\\üĂrĐ_UėÌĔÓāeSÐĐWRTċÜa]ÁÖbóâČĒòďÝÍĂpÙĕćĜĞßöÅĉ`V"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ëwyÒăõÙ^O][ôÅSáTQĎÁğÓĔæPÐdÄÜęčåEÚÊäġhĐaôÑĉéèzDÂĒĆØØ_ġċĖUreėiLÀÏ÷VÆĂÓOĄsnčÑkĒéßÜĚjtþÿw`I×mfÀÒRLQçHÖFćĞęKíXÞĎíaÛÃĚxÛêÌvĀgCmĊGnÎÝyĢpÏÐ\\ĢÇĕĈÚÌîùcBÃËöýđāĝâzÈÕUbĄJĝ","ËWYÒĂõÙ^O][ôåsátqĎáğóĔÆPÐdäüęčÅEúêÄĠhđaôÑĉÉÈZdâĒĆøø_ĠċėUreėilàÏ÷VæĂÓOĄSnČÑkĒéßüějtþÿw`i×mFàÒrlqçhöFćĞękíxþĎíaÛÃĚXûêÌvĀgCmċGnîýYĢpÏð\\ģÇĔĈÚìîÙcbãËÖýĐāĜÂZèõubĄjĝ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("nÞĂĈñSnPÄvÄÑZĜ\\ÊďmèÃüÝqYiDġÙĎtĔuÀ`øĀæÖÎþĖç[_Û÷TÅíOPÏCõmCāùÇBaóČâgĠêěĈðrELÕéģċĔĄãËzqÎFĜúÏsLÈđKHwčHÐĆìxåÀĊG×óKăĖuxÛËôęeÔdòĆjOĒÒvýrĞBaŸwéáĢöìjÂğßęæfěÚÍIĐēØąü^á]y","NþăĉñSNpÄVäÑZĜ\\ÊďmÈãüýqYIDĠÙďtĕuà`ØĀæÖîÞėÇ[_Û÷tåíoPïcÕmcāÙçBAÓČÂgġêĚĈðrelõÉģċĔĄãëzQÎFĝúÏslÈđKHWČhÐĆìxÅàĊg×ÓKăėUXÛëÔęeôDòćjoĒÒVÝRĞBAŸWÉáĢÖÌjâĞßĘÆfěúíiđĒØąÜ^á]Y"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ďivEMÎéA^ìQ_øtñĠĚpîûĒOéòúÅċýjÀùċnX×ėKÜÓÏđRôûýĕâĢČPõðGwÐþÖėøVêúĐ\\ßČĎĒ÷síæcÆĞQDTąÃezĂćÙKUËziÂy]ãĠhĉģāäÊmĉíÖèubåèXALjäĄf[ĕïñloëěĝDfcbçÔàÌõÒáęćw`ŸğĜnyHăÁĘüRçóGĀÞs","ĎiVeMîéa^ÌQ_øtÑġěPîûēOéòÚåĊÝJàùĊNx×ĖkÜóÏđRôûýĕÂĢČPÕÐGWÐÞÖĖØVêÚĐ\\ßčĎĒ÷síÆcÆğqDtĄãEZĂĆùKUËZIÂY]ãĠHĉĢāäêmĈÍÖÈUbåÈxALjÄąf[ĔïÑLOËěĝdfCbÇôàìõòáęćw`ŸğĝnyhĂÁĘÜrÇógāþs"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ZÙÇtàÌĉbyÜčéĄk^ówĖÂØ`ÈXÀģ_ËďLÃäñÕîÜÁhāĒěVÞþđÑÚÐjtęÂoOĀĚćÛÒĕÇæHĊãÖrSUR[ĔIænČĢEMFjÌYzÚøÅĘWĠĝåDöDÔŸpÒNa]ùĠ÷ĞKÈaXáĞqCcvÓpĒýÎĄÍĂÉEïýĎfíÔĜMë\\ðÊsĉÕäiGUėBgÛ×ÊßïĂĆĊLĐQ","zùÇtàÌĉbYüčéąK^ÓwėÂØ`ÈXàĢ_ëĎLÃÄñõîüÁHĀĒĚVÞþĐñÚðJTęâOOĀěĆÛòĕçæHĊãÖrSuR[ĕiæNčĢEMfJÌYzÚØåęWĠĜådÖDôÿPÒnA]ÙĠ÷ĞkÈAxÁğQCcVópĒÝîĄÍĂéeÏÝďfÍÔĝmë\\ðÊSĉÕÄIGUėbGû×ÊßÏĂćĊlĐQ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ą]ĔĐêcĠMàÍóÀĊÛÌĢtïĖUËíÛåëqÑégĆĊ×čpÕùÙñēćâáØxKuXÿæì÷ÒÉyÃCvāĉþÕÜ_ßpäĈçiØĀÁyþÅúú`îÏÜmWĔehĒďÔÇÈ\\blðRêFNEěÎęAĝÆęTGÓĂjq[ģĖbďLÖòaĂkğÈÖSdÃdwôýČġąZjFĞðOoâěNvzĐsrHIÝ^Äĝ","Ą]ĕđêcġmàíÓÀċÛìĢtïĖUËÍÛåëqñéGćĊ×čPÕÙùÑĒĆÂÁØXKuXŸæì÷òéyÃcVĀĉÞõü_ßPäĉÇiøāáYÞÅúú`ÎÏüMWĕEhēďÔÇÈ\\BlðRÊFNEěÎĘAĝæĘtgÓăjQ[ģėbďlÖÒAĂkğèöSdÃDwôýČĠĄzjfĞðOOÂěnvzđSRHiÝ^äĝ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("øLõñÍáìóvwoMĝĎgFTËĜğęÐãcÖeĞ`ôĚÜY[âđhÆrîĈòpOÐfèÂWďúeÀĂþD÷ipĊüZêċîñÇĔÞxÕCSqGkëi_^ÏģàāÃùŸÍĀh]ßģéÛêçčNxJYĠÒsæANÛlēąėÅbïjTćđ×ĂRČĚèėÖÄmÝvĠĕDåĘuēÙĉ\\AÚôøÉÁìäóuąýqćzkb","øLõÑÍÁÌóVWOMĜĎgFtËĝğĘðãCÖeğ`ÔěüY[ÂđHÆrÎĈòpOÐfÈâWĎúeàăþd÷IPĊüZÊċîÑÇĕþxÕCsqGkëi_^ïģÀĀãùÿÍāh]ßĢéÛêÇčnxjYġÒSÆaNûLĒĄėÅbÏJTĆđ×ĂRČěÈĖöÄMÝvĠĕDÅęUēÙĉ\\AÚÔøéÁìÄÓUĄÝQćzKB"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("tÿ[éóTĂÀÜđeyęjÏEçğĒąèĝďYÙÞüíUqĆėáAWĔĊĔdĞìCôJäpÂflvóùoNĠXZÛąòðØĂÛñÂåÒþĆ^wïàbÕÄBßFĀÆSĎrñÃĚQÈ]đĠéģĜØċÖgVÖëSË`MýĢPcčÚaÊ×ÝOĉkkHîMãrUÌÔĘÊNdÚěhÇČGð÷xÆĒ_IáėlÕÅZÍĉ\\iÎā","Tÿ[éÓTĂàÜđEYęjÏEÇĞēĄÈĜĎyùÞÜíuQĆĖÁawĕĊĔdĞìCôjÄPÂflVÓÙonĠXZÛĄòðøĂûÑâåòþć^wïàBõÄbßFĀæsďRÑãĚqè]ĐĠÉĢĜøĊöGVÖËSë`mÝģPCčÚaÊ×ýoĉKKHîMÃrUÌÔĘÊnDúĚHÇčgð÷XæĒ_iáĖlÕÅzÍĉ\\IîĀ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ïøAĉLĘÃUåStNàĂÊõġRBüVćWj×Xp\\ĖkCmā[áġmBZÔçûïâÉĝûcääÑgÖ`ùĔíđþÐ÷ëÃeċèAì]QîOēiükďÔÎéĚÚtU_Ăúç^ÌxfĜæðóSjğĖĢßZĞÝëâVyÓhEĔFgòLDYØIÈùoĆĐÍdàąÕÅÑþčöÁRNPhýĒĢěĄĘÊŸĉÒāqÆĊWďč","ïØAĉLĘãUåsTNÀĂêõġRBüVĆwj×XP\\ĖkcMĀ[áġmBZôçÛïÂÉĝÛcääñgÖ`ÙĕíđþÐ÷ëãeċèAÌ]QîOēIüKďôÎéĚútU_ĂÚÇ^ÌXFĜÆðÓsJĞĖĢßzğýËâvYóHeĔfgÒLdYØiÈÙOćĐÍdÀĄõÅñÞČÖÁRNphýēģĚąęêÿĉòāQæĊwďč"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("gĊ[ßÌčĔêēdĢåĝPBÎøPæ`ÑĚÐzÍnàíćÈ^ÃÛÛTiðDËÙZaóÄċüãKeBÒ]cQáUeýÄcĐMôĆwďlúģQÖăđVúm_otÕL×ØoçėĄéxwèÙčăÞsÔöĘI÷ĉìĀÅñy\\ïuÿþGFąġĎēóYNÂJëÀfKğhĕáĠâĉĝêçÒîrğĖVahXüÝęÉRæJSÏĀĚõ","GĊ[ßÌčĕÊēdĢåĜpbîØPæ`ñĚÐzíNÀíćè^ãÛÛtIðDËÙZaóÄċÜãkebò]cQÁUEÝäCđMÔĆwĎlÚĢQÖăđvÚm_oTÕL×øoçėĄéXwèÙčăþsôÖęI÷ĉÌĀÅñy\\ÏuÿÞgFąĠďĒóyNâJËàFkğHĔáĠâĈĝêÇòîRğĖvAHXüÝĘÉræJSÏĀěÕ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("oåÃôànĕKċcímDjýbÈĎďÕė×sgoğkèXÛÒXØĖÆģP]ÙdþTSÎĝŸlûbEHyë÷[ïfgģfzðĘęĐÐĚĔÕuÞQúÝÁÍCàvzúāTùÜIWlĐVÑačĠ\\ÅîÇć`ĄñPÂËqãuøąAYJĂéiüßnĒMĒRr^ÌĂćäÁÉěĊĝğäóĉöÊeæò_ìêÓHāôÇâĠČĈWÖï","OåãôànĕKĊcíMDJýbèĎďõė×sGOğkÈxûÒxøĖæĢP]ùdþtSÎĜÿLÛbEhyË÷[ÏFgģFZðĘĘĐðĚĔÕuÞQÚÝáíCàVZúĀtÙÜIwLđvÑAČġ\\åîçć`ąÑPÂËqãuøąAYjăÉIüßnĒmĒRR^ÌăćÄáÉěĊĜĞÄóĉöêEÆò_ìÊóhāôçâġČĈWÖÏ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("Ċá_Ï×ĜêāAØăeliXÐÅáëĄßąôuĠX^ČMğčĖ]rìĐEròhFIyÃf÷BPpĖðöÔĢÞóÚdjüÛñéĕìDĐbcÕÀsèæěÓQåNĆÞqmZģĕòÎøHýēõÜĠĉëtÍvyÙWNĝêúöçtLèĎęçïÍċGsÀ`ğvýOďāûîkaOwÙćÄâěGkzĉcŸâÃÉäĘĂ[j\\Æñēu","ċÁ_ï×ĝÊāaøăeLIxðåáËąßĄôuĠX^ČmĞČĖ]RìĐERòHFIyãf÷bppĖÐÖÔĢþóúdjüûÑéĔìDĐBcõÀSèæěÓqåNćþqMZģĔÒîøhÝĒõÜġĈëtívYÙwnĜÊÚÖÇTLèĎĘçïíĊGsÀ`ĞvÝOďĀûîKAowÙĆÄÂĚGkzĈcÿâãÉÄęă[J\\ÆñēU"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ėNyEÂďąĜ^ÌKĉĜòevÖjéiIÙBÕWäāäámîgãSCtĔOzÌĢÞćēwÃêåHÎĂaÙOĢóC÷naØÅëëĚþĀ_ğÚàèđďÓěÀr`[ĔÜúFÈÉdĆXçÕĖlTÔÑïá×ÂHĈsuzFpÆÝÝÔqġPçRđdððxLïĘKčöíċĘJăċuGÜ\\mġyĄčvñ]ÛÊÿßēÒíqÛøÆBğ","ĖNyEâĎĄĜ^ìkĉĜÒeVÖjÉIiÙBõWÄĀÄámÎgãScTĕoZìĢþćēWÃêÅHÎĂAÙoģóC÷NaØåëëĚÞā_ğÚÀèĐĎóĚàr`[ĕüúFÈÉDćXçÕėltÔñïá×ÂhĉsuZfPÆÝÝôQġpÇrĐdðÐXLÏękČÖÍċĘJăĊUgü\\mġYĄčVñ]ûêŸßĒÒÍqûØÆbğ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ÃĄÖĘùàÈ÷êĔþďSÙÞCEáRTčFĒěWûyĖímĉâD_ģÉïÝêKUÒEĆQđîÇĐěÑnúýXúàÔÿyĈ]\\ĜfÈĘoċÓösZbòåċTğRėìÇÆkõHpĀĒjČClÌüðÎá`ĔDüßÍiăôĄÉĀió^ëëoæZåġbØÏHďvvXañĆnØLĢjĜÄmÐQâgûP[a×ĂġwUÃGõğÄ","ÃĄöęÙÀè÷ÊĔþĎSÙÞceártčFēěwÛYĖÍMĉÂd_ģÉïÝêKuÒeĆQĐîçĐĚÑnúýXÚÀôŸyĉ]\\ĝfÈęoĊÓÖszbòåċTĞRĖìÇÆkÕHPāējČCLìüÐÎÁ`ĕDÜßíIĂÔąÉāiÓ^ËëOÆzåġbØÏhĎvvxAÑĆNølĢJĜÄMÐqÂGÛp[A×ĂĠWUãgõğä"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("Æïèô_KJąYĔHÝdđRõsĉQÝÙOęÍEĔÞġWĆZėēÞtÅÎ[àñóTØFăgËÜòãĞÉ\\ăÉqĉnEġæĢûvfy×Î`ëBïĄöäLĜċÒÑāHďđěĊðíPěßaĎüğumęãMkĒćpêg^âÖáĖxÚŸÛÀiÚlõDåìčRVUbÙ÷ÔÇĜäØCNAâWáI]êCìČðoóXZèSĢāÇj","ÆïèÔ_kJĄYĕHýDĐRõsĈQýÙOĘíeĕÞġwćzĖĒþtåî[àñÓTØFăgËüòÃĞé\\ĂÉQĉNEġæģÛvfY×Î`ëBÏĄÖäLĝċÒñĀhĎĐěċÐípěßaďüğUmĘãMKĒćpêg^ÂÖÁėxÚÿûÀiÚLÕDÅÌčrVUbù÷ôçĝÄØcNAâwáI]êCìčðOÓXZèSģāÇj"));
}


CTEST(Cases_compare, russian)
{
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ВРДБжюшЫяЭЯлаеЦтМщЦЙлуЩчеКНсХЙАыЪОпФПИъэсдмЧзьбЗвтУГшкгжНХфРоиЮь","вРДБЖЮшЫЯЭЯлАеЦТМщцйЛуЩЧекнСхЙАЫъопФПИЪЭсДмЧЗЬбЗвТУгшкгжНХФРОиЮЬ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("рГмЬэиЫплеЩТЧуЮиБСксчЮщЪрхяАпЦевйЙлЪФзБТоШФгэхЖВдЬнАУЖзЫШцЯокдМН","ргМьЭиЫПлеЩТчуюИбСКСЧющЪРхЯАпцЕвййЛЪфзбТОшфгэХжВдьнаужзЫшцЯокДМн"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("шпзАЗвКЯРюиМБЭГТбЯнЧОаЦХСскЦъМлрпйьшфдуэщЫЪХжйДльФюЕГщжЫУЧтЕИОНВ","шпзАЗВкЯрюИМбэГтбЯНчОАцХсСкЦъМлрПйЬШФДУэщыъХжйдлЬФюЕГЩжыУчТЕиОнв"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("эыфЕмзЪДрБЖзрбДьхйГкЛОнуиВЕСшхФюСчЩпГТьивнлйукОяАъпяЫаЭМющЧтШЦжЦ","эЫфЕмЗъдРБЖзрбдЬХЙгкЛоНУИВесШхФЮсчщпГТьИвНлЙукояАЪПЯыАЭмЮщЧтШцЖц"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("УвЪЙыыбРягуиЗЕДоФющмйЮЯГсЦСТМокЛэЬЪВЧкПшцАрнЗиНЕФЬщчШДлЖЭХхПБжТА","УВъйЫыБряГуиЗеДоФюЩмйюягСЦСТмоклэЬъВЧкПШцАРНзинЕфЬщчшДлЖЭххПБжтА"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ъхвоЬнцжГзОяшЙЛидМъмыКФсСтИНГЫФэЦУйЧпТкевЭдчаЩеЮЮуаРБжьХяПБщршЗл","ЪХвОЬнЦжгзОяшйЛидМЪмыкфСсТИНГЫфэЦуйЧПТкевэДЧАщеюЮуАрбЖЬХЯПБЩршзл"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("УхцщьЫЭфЕаВхЮФйВбрпЯзОлмЕкакоЧДйиджчУЫЖЯСТшЗплЦРБГъьншНмГЩтСэЮЪИ","УХЦщьЫЭФЕАВхюФйвБрПЯзОЛМеКакочДйИдЖчУЫжЯСТШЗПлЦРбгъьнШНмГЩТСэюЪИ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("оЦбМВДКЗНТхАЬзЕоЮмДефэъЙфаЫгИщУпРшРКчУйэЩБТЬцнъЖлвЯычлГХИшюяпжСС","оЦБМвдКзНТХАьзеоюМДЕФэЪйфАЫГИщуПРшРКЧУйэщБТьЦНЪжЛвЯЫчЛгХИШЮяПЖсС"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("АЪщШлРьПЦчГЫпэюКИдъыфХнВМвуудБмфзЕШТлнЯЖЯгцэЙеЗОрБОжТхАИюССКЩчйЬ","АЪщшЛРьпЦчгЫпэюКИдъыФхНвМвуУдбмфзешТлНяжягцэйезОрБоЖТхАИюСсКЩЧЙь"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ВРДБжюшЫяЭЯлаеЦтМщЦЙлуЩчеКНсХЙАыЪОпФПИъэсдмЧзьбЗвтУГшкгжНХфРоиЮь","вРДБЖЮшЫЯЭЯлАеЦТМщцйЛуЩЧекнСхЙАЫъопФПИЪЭсДмЧЗЬбЗвТУгшкгжНХФРОиЮЬ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("рГмЬэиЫплеЩТЧуЮиБСксчЮщЪрхяАпЦевйЙлЪФзБТоШФгэхЖВдЬнАУЖзЫШцЯокдМН","ргМьЭиЫПлеЩТчуюИбСКСЧющЪРхЯАпцЕвййЛЪфзбТОшфгэХжВдьнаужзЫшцЯокДМн"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("шпзАЗвКЯРюиМБЭГТбЯнЧОаЦХСскЦъМлрпйьшфдуэщЫЪХжйДльФюЕГщжЫУЧтЕИОНВ","шпзАЗВкЯрюИМбэГтбЯНчОАцХсСкЦъМлрПйЬШФДУэщыъХжйдлЬФюЕГЩжыУчТЕиОнв"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("эыфЕмзЪДрБЖзрбДьхйГкЛОнуиВЕСшхФюСчЩпГТьивнлйукОяАъпяЫаЭМющЧтШЦжЦ","эЫфЕмЗъдРБЖзрбдЬХЙгкЛоНУИВесШхФЮсчщпГТьИвНлЙукояАЪПЯыАЭмЮщЧтШцЖц"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("УвЪЙыыбРягуиЗЕДоФющмйЮЯГсЦСТМокЛэЬЪВЧкПшцАрнЗиНЕФЬщчШДлЖЭХхПБжТА","УВъйЫыБряГуиЗеДоФюЩмйюягСЦСТмоклэЬъВЧкПШцАРНзинЕфЬщчшДлЖЭххПБжтА"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ъхвоЬнцжГзОяшЙЛидМъмыКФсСтИНГЫФэЦУйЧпТкевЭдчаЩеЮЮуаРБжьХяПБщршЗл","ЪХвОЬнЦжгзОяшйЛидМЪмыкфСсТИНГЫфэЦуйЧПТкевэДЧАщеюЮуАрбЖЬХЯПБЩршзл"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("УхцщьЫЭфЕаВхЮФйВбрпЯзОлмЕкакоЧДйиджчУЫЖЯСТшЗплЦРБГъьншНмГЩтСэЮЪИ","УХЦщьЫЭФЕАВхюФйвБрПЯзОЛМеКакочДйИдЖчУЫжЯСТШЗПлЦРбгъьнШНмГЩТСэюЪИ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("оЦбМВДКЗНТхАЬзЕоЮмДефэъЙфаЫгИщУпРшРКчУйэЩБТЬцнъЖлвЯычлГХИшюяпжСС","оЦБМвдКзНТХАьзеоюМДЕФэЪйфАЫГИщуПРшРКЧУйэщБТьЦНЪжЛвЯЫчЛгХИШЮяПЖсС"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("АЪщШлРьПЦчГЫпэюКИдъыфХнВМвуудБмфзЕШТлнЯЖЯгцэЙеЗОрБОжТхАИюССКЩчйЬ","АЪщшЛРьпЦчгЫпэюКИдъыФхНвМвуУдбмфзешТлНяжягцэйезОрБоЖТхАИюСсКЩЧЙь"));ASSERT_EQUAL(0, a_icmp_cstr_cstr("СгртюНфУжИяещОцКмьыюоЗйбЭяЗшъЫСЕшэлЙВЦчПЛмИДХуПАрВКтнЩьЧАЪФхгдЖб","СгрТюнфуЖИЯеЩОцКМьыЮОзйБЭЯЗшЪЫСешэлйВцЧплмИдХуПаРВкТнЩЬчаЪФхГДжб"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("хиазЙДялтвМрСРьДюБхеИУЭоПАцшчЧгНПвЭЩфьГщкНоЪЦмтюШъЗсбйуКыыжфЕЛЯж","хИазйДяЛТвМрСРЬдюбхЕиуэОпацшччгнПВэщФьГЩКнОъЦмТюшЪЗсБйУкыЫЖфелЯж"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("мбоЖЩТаэШРЮЬВУЯоъсИцЧбКеЙнщфкъспТЛхрЗЭьГГвыуПеяМжЧДлХшЮЙдЦныиФаз","МБоЖЩТаЭШрЮьВУяОъСИцЧБКейнщфКЪСпТЛхРзЭьгГвЫУПЕЯмжЧДлХшюЙдЦНЫИФаЗ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("йфзхцЮяКШМьЧУпилНевЩъЭЕяСГсБШЖжПтЮВаыЭцчРдхьЛоАГИмщкйНУЪрФтОЫБЗд","йФзХцЮяКшМЬЧуПИЛНЕВЩъэЕЯСгСбшЖЖПтювАыэцчрдХЬлоАгиМщКйНУЪРФтоыБЗд"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ФТиОЧфуЙкЪзЭЫШСдпмиЕюълЯшГсбеХВьжЦямЩрТдПЙЭЦхЗьНгЫЖкчНщЛЮОбУВаАР","фтИОЧфуйКъзэЫШсДпмиеюълЯШГСбехВЬЖцяМЩрТдпйЭцхзЬНгЫжкчнЩЛЮОБувААР"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ВыФИНекОЛГыЗСдПЗблХдЖЭмиоМтЪййъСШбТвяуЩьЧГрАшнАкРЬЧЦЩуЖюпхЯФЦюЕэ","ВЫфинЕКоЛГЫЗсдПЗБЛхДжЭМиомТъЙйъСшбтвяУщЬчгРАшНАкРЬЧЦщУжюпхяфцЮеэ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ЧОшшЕэциМЯЭДХтЫщЬБКалсЫУТйДюЛюИВНмЪЗЬбЖуйвЗжГЦНАЧяГхсфРрещфОпкъП","чоШШеЭциМяэДХтыщЬБкАлсЫУтЙДЮЛЮиВНМъзЬбЖУйВЗжГЦНАчЯГХсфрреЩфопКЪП"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ТУФаЭЕИзДЫойТшЧхююСуьэЬПкфгЪоНяДаЩЛЛЦЫеМЩИряНБзжъвжркчПХЦшБсйВМг","туФаЭЕизДЫОЙтшЧХюЮсУЬэЬпКФГъОнЯдаЩллцыемЩИрянбЗжъвЖркЧПхЦШБСйВмГ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ЧнбДЙКВХяФцЗШалЬЮндЯъЮщПТоЩЙЭшЖаЖЦОкбЭмМСыГилЪрСфчхеыьГпзуИуврТЕ","ЧнбДЙКвхяфЦЗШАлЬЮнДЯЪЮщптОщЙЭшЖАЖцокБэММСыГиЛЪРСФчХЕЫьГпзуИуврте"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("тяИФфхдэюШМхЕелЖПРвЩмчнзвдЙгъПЫБЙТкяшрзэЬКсЫИаоОБЧаУнЦЛЦЮСщжъьГУ","ТЯИФфхДэюшМХЕЕЛжПрВЩмЧНЗВДЙгъПЫБйТКяшрЗЭЬксыИАооБЧауНЦЛЦЮСщЖъьгу"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ЭдТонфпЧргцщЬлщЕЗэйрюКотЬИУнюФсШмлУВЫецИЯдАЗЪСпъКБбХХАГШямЙЖЖвЧы","ЭДТонфпЧрГцЩЬлЩезЭйрюкОТЬиУнюФСШмЛувЫецияДАЗъспЪкББХхАГШямйжЖвЧЫ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("АЬжцбЗСсэЕЙЫИЛьЮщукЕЪзЫввЯФХъчмМяЧттупГрЭГоюйлжШкЦХПДрШФОищнбАНд","АЬжЦбзССэеЙыиЛьющУКЕъзЫввЯфхЪчМмЯЧттупГрэгОюйлжшКцхпДрШфоиЩнБаНД"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("штсЛююСзЕжыоЖОЭаЬБуяЪнИзУПчарйтщгВЙХеЛЫбгцЯншЪкпКрвфЭцММДчьдфЩхи","шТсЛЮЮсЗЕЖыОЖОэАЬбуЯЪнизУПЧарйТщгвйХЕлыБгцяНШъкПкрвФэцМмДЧЬДФщХИ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ЗегЪЫллжпкхтЙДФрчбЧзУоШКгЦМЬщСЮИУвЙАофШЦщРэыБЯэхъСЬмяАвТНЖдиЕЮПН","ЗЕгъЫЛЛЖпкХтйдФрЧбчЗУошКгцМьЩсюИУвЙАоФшцЩрэЫБЯЭхъсьмяавТНждиеЮпН"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ДИПлЕьСщхТЛаясАЙВОщжопЪгЫФНцзЭчМГЖеКРдУВзУцТйФХЬрШЮМЯчБЮЪбкэЫшИН","ДипЛЕьсЩХТлАясАйвОщжОпъгЫФНЦзэчМгжЕкрДУвЗУЦТйФхьршюмячБюЪБКэЫШиН"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ЧЩРНЧФЯьЙъЕаджжЦПЬеУаоРКЮБэЩыХШХзМтбГЪКимИзлЫспФЦЛйУВвНЯДгЭтЮсШО","ЧЩРНчфяЬЙъеаДжЖЦпьЕУАорКЮБэЩыХШХзМтБГЪкИМИЗЛысПФЦЛйуВвНЯДгЭТЮсшо"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("отБЮОЯЩЛэТйЦскнзыБхзьЕяВГмЖдьйамДеЭИшЩънпУюлъЖГфрАыВХкПцчУишФСЧр","оТБюоящЛЭтЙцскНЗыбХзьЕЯВгмжДЬЙамдеЭиШЩЪНПуЮЛЪЖГфраыВХкпЦЧуиШФсЧр"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("зРеЮъхрФйЛсСйжЩтШъАШКЛоХгфНкУЫютыбВчдЯВщЬзНоДПцЦаЭГЖиУЬэяЕимБПЧМ","зреЮЪХРФЙЛссйжЩтшъаШКЛоХгфНКУЫЮтыбвчдЯвЩьЗНодпЦЦАЭгжИуЬэяеимБпЧМ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ЭЕпбгЮКмжчМэыЪХиЛхКяЗСБНьцЩФуЫъЯЙШеЩРожШувльДчгРцаИЮЙВНдЗсАпФОТТ","эеПбГЮКмЖЧМэыъХИлХкяЗСБньЦщфуЫЪяйШеЩРОЖШУВЛьдЧгРцаИюЙвНДзсапфОТТ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ЬийуЩПЛХгтщШРТУЙшжЯъВОГЮофВФпСЧЪЦЮНаЗдЦЛКчзСЕнэЯИАХРБеЭмБжыыкьДм","ЬиЙУщплХгТЩШРтуйшЖЯЪВоГюофвФпСчъцЮНаЗДцЛКчзСЕНэяиахрбеэМбЖЫЫКЬДМ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ДНзоЪОхшЖлЦЛЗэЬВерЩтПЕУМЯчюБЫрШаСгцбйХНЮГФифЖПыКкВмсИДЭУаЬЙЪЯЩтч","дНЗОЪоХшЖЛЦЛзЭьвеРщТпеУмЯчюбЫршасГЦбйХнюГфИфжПыККВМСидэуАЬЙЪяЩтч"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ЗФхСзШЦОДцЧТАдКМЛьЯйКхВнуЭбНоърШФяиьщпгБЖЪеУиСЧпЖщГЛРетэюыВмЫЮай","зФхСЗшцодцЧТаДКМлЬЯЙКхвнУЭБНоъРшФЯИьЩпГбжъЕуиСЧпЖщглРЕТЭЮЫвМЫЮАй"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("УЮОРИЕОВхЪЫрЛМЦЯЛжнДКцбжЧбшГзХСКЯщйэЗдйеАГУэЪыфичтПТмвшфщьНпсюАь","УЮОРИеоВхъЫрЛмцЯлЖнДКЦбЖЧБшГзхСКяЩйЭЗдйЕАГуЭЪЫфИЧТпТмвшфЩьнпСюАЬ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("яРЙЭЭбщЙКзЦштАяоЮСуПдЩжЛЮФчънхьЕаСОГвуБКПыРЖхдъмчицетылШгНфЬвЗиМ","яРйЭЭбЩйКзцШТАЯОЮсупдЩжЛЮФчъНхЬЕаСогВуБКПЫрЖХдъМчиЦеТЫлШГНфЬвзиМ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ЬЬЧДСеЫТхтЩиЪНМгГДУАЯКЗаыБВжЮНУяВОпершчпфхЗЙЭцЭРЩлЙиМбЛЪЮЖОскцфш","ЬьЧдсеЫтхТщиЪНМгГдуаякЗАЫбВЖЮНуЯВоПЕрШчПфХзйЭЦэРщЛйИмБлъЮжОСКЦфш"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ФпЫлАяцюшСЩРеУоТИЕхтнэаэчъдЩГЯУЧСжБККцьДфЫъЙпхВЬВГбюРжозЗЛИмНшМй","фПЫлаяцЮшсЩРеУоТИеХтнэАЭчъдЩГяучСЖбККЦЬдФЫЪЙпхВьВГБЮРжОЗзлиМнШМЙ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ъосХэЮтшЩеЧЛнДБьВьрЩуэЗЪбзУвяфиЖСгмигтЦкыПЙкНояАРШеюЙлфчАДцМЖпыХ","ЪосХЭюТШщЕчЛНдБЬвЬрЩУЭЗЪбзУВЯФИжСГМИгТЦКыПЙКнОяаршеЮЙлФЧаДцмжпых"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("пкювухЦдЯйжбСиТнфлеЫЦршвзъТКъЗмАсНОшюРуйоьаЩщпчМХЭлДЧИжэягеЬыбфГ","пКЮВУХЦдяйжбсИтнфлеыцрШВЗЪТКъзмаснОШюРуЙоЬаЩщпчмхЭлДчижэЯГЕьЫбФг"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("эЯПОКЮхрзСБщИРМьжгйБьТЦйчЖЮышугТЪМДсъЕЭафхЛУВзПЛшнЧеДцАвНИщФКЫоя","эяпоКЮхРзСбЩИРМЬЖгйБЬтцйЧжЮЫШУгтЪМдсъЕэафхлУвЗплШнчЕдцАвНиЩФкЫоя"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ЛЗасШмЕтХЙиЬгУьДжРЩхфЧНзвЕтлапБняйэгОРЫшыпМЧЪОцукядЭКвБююФЪСЩИЖЦ","лЗАсшмЕТХйиЬгуЬДЖрЩхфЧНзвЕТлАПБНЯйЭгОрЫшЫпМЧъоЦуКЯдЭквБЮюФъСЩИЖЦ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("УыФЪВндЭОАпчДгййЬшпжИрэЖтюсЦЩщЛаъЧИзКлЕряТШХкцМНгбЗеЬмСфОХвБЫюУЯ","уыфъВНДэОАПчДГййЬШпжиРЭжТЮСЦщщлАЪчИзКлеРЯТшхкцмНгбЗЕьмсфОхВбыЮУЯ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("шъдщЮТхЖюМЧЦЬВжзУУлПИЧИНЯнзсЭЫЪцтяЩрБшХРевГмфЕБйФккООааДПГьэСЛйЫ","ШЪДщЮтхжюмЧцЬВЖзУулпичИняНзсЭЫЪЦТЯЩрбшхреВгмфебЙФКкоОААдпгьЭСЛЙЫ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ЪмЪЛЮХгЭЦЖьШДГзчрпубкНаьЕВЮйОцПЕТщфсЛяЫйбвХфтуРЩДЯсшЧмоНзЫаЖКэиИ","ъМЪЛЮхГэЦжьШДгЗчрпуБкнАЬЕвюЙоцпЕТщфСляыйБВХФТурЩдЯСШЧмОНЗыАЖКЭИи"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("онуМЮЛЬолдеПчзьхЙйдиЭШяъкАипУжывФЦфцнТЯаЕХгтЗСбСРрюЖЭЩгМШыЩвБЧкЪ","ОНУмЮЛЬОлДЕпчЗьхЙЙдиэШЯЪкАипУЖывфЦфцНтЯаеХгТзСбсРрюЖЭщгМШЫщВбчкЪ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ХбпьфчиРгэЧрДЗЕОуМСЙкЪЩсШВбявМюыХгщзаЮцЯЫуцНъфТжШДЕЙалпкьжТоЭЛНи","ХбПьФЧиргэчРдзЕОУмсЙкЪщсШВБяВмЮЫхгЩзаюЦЯыуцнъфтЖШдейАлпКьжтоэлнИ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ЕцКвмйяСнхФяЪпЧдэОаыллтТсюшЖИчБузызмэъуЩНИШюФЕХГощркрБаПьйцжЬВГд","ецКВМЙЯСнХфЯЪПЧДэОАЫллттсюШжиЧбузыЗмэЪУЩНиШЮФехгощРкРбАПЬЙЦжЬвГд"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("КсМУрАчШряЖжФгйЗвТщпЭиТьОЯбДсехЫнблъДчХЙэЬнШГъкУЩМПФЮеАЫЛоиЦцЮЗв","КсМУРаЧшряжжФгЙЗвтщПэИТЬОЯбДСехЫНБлЪдЧхЙЭьНШГъКУЩмпФюЕаЫлоиЦЦЮЗв"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("РШбЪЕКвшдАИЮЙыМпмЗЖфнпънйтГОУяГЫЛьэбчЩЦлОчЗювисьщЭТУжЦфхСДАрХЕКЯ","ршБЪекВШдаИюЙЫмПмЗЖфнПЪНЙТгОуЯГЫЛЬэБчщцЛОчзюВисьщэТуЖЦФХСдархЕкЯ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("жУсчФСИъуХПаЭЛэьЫОНЮЕдМДиЗюфрьбНрЯывлПЪшШбгкчТОвЙхЦЙЦЩеЗжтМящГАК","жУсЧфсИЪуХпаЭлэьЫОНЮЕДмдИЗюФрЬБнрЯывлПъШшбгкЧТОвйХЦйцщЕЗЖТМЯщгаК"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("нЦЕимЙОЧюХРъСУНэргзЫуФэфбЮолеВШдЯЩАХГзКъмТвтЖСлПАкыьчЯпщШДьжИйЦБ","НцеИМйоЧюхръсуНэргзЫУФЭФБюОЛЕВшДяЩаХГзкъМтВТЖслпАкЫьЧЯпщшДЬжийцб"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ЮПВчУЖНяхНРЦэйасаюшкфйьбЧжЪцДМгыТДВеЗъиьгэЛзШЛыЕоРПИщофКТМхСущбЯ","ЮПВчУжняХНрцЭйасаюшКфйьБчжъЦДмгытдвЕЗЪиЬГэлЗшлыЕОРПищофктМХСУЩБЯ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ъеЫЮЕШЫлцАуюНсиЪяТЭТщИжйхДшМЩбндчЬускЧпВцкоАяьЛГфжфЗВОйРрзэмГХпб","ЪеЫюЕШЫлЦаУЮнсИЪятЭтщИжЙХДшМщБНДчЬУСКчПВЦКОаяьлГфЖФзвОЙрРЗЭмгХпБ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("влоэЗЮудцРнлдбщтЬкчЮшНЕжЗхЬцагМгЭЙИИеъСвПжрКхФйПЪоЧУыщСЯМяТШАбыф","ВлОэзЮУдцрНЛдбЩтьКЧюШНЕЖЗхьЦагмгЭйИИЕЪСВпЖркХфЙПЪОЧуыщсяМяТШАбыф"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ЬгчосищШБрячДПлриъТЗбЫПэФаьМыхЖЮВЖУНшЭщоТУКъВЙаНгхКЕЙдяЗЮфЦЛСцмЕ","ьГЧОсищШБРЯЧдПЛрИЪТЗбЫПэфаЬМыхЖювЖУНШэщоТУкЪвЙАНгхкеЙДязЮфЦЛсцМе"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("РиЯЖЙзгХгтЭВПДИучеВБмАФцЕДщЭУтшЫцЛЯнзфКжкРюьЬЪпОхШюЫЧсЙНЩъМБоСаЛ","рияжйзгхГтЭвПДиУЧЕвбМаФцедЩэУтшыцлЯНЗФКжкРюььъПОхшЮЫчсйнЩЪМбОсАл"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ИцэхЯозЮНювуГЪшйывЫфФщоЦхЭСРъдтЯЬйерЧгУПСбмЗАЛШкЖКлЬЕБдАТчЖПиНМЩ","ицЭХЯОзЮНЮвУГЪШЙывыФФЩоцХЭСРЪДтяьЙЕРчгУпсбмЗалшКжкЛЬебДатЧЖпИнмЩ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("иЖмЪЫСнГЭвОШИжлэаЙюуЩЮодрХкЧЕЗббТсЦзчФХньвьРаЙяЕЦЪфуМпЫКгпШТдЩяЛ","ИжмЪыСнГЭвОШИЖЛэайЮУЩюодРхКЧеЗБбТсЦЗЧфХньвЬрАйяЕЦЪфУМПыкГпштДщяЛ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ЩеОйЖвАХнШыиЕкЯСБапьдруЮЗбфЖчкТШцМщрМпллгдэютъъЭзцсыФИЯВУхоЬчгНй","щеоЙЖвахНШЫИеКЯСбапЬДрУюЗбфЖчКТшЦмЩрмПЛЛгДЭЮтЪъэзЦСыфИЯвУХОЬЧгНЙ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ЩфтЦБЙПОЪйЭНЦшшаНЛИУЭВеуоеКРдРЫЗВсдЯчЪклХТыМЬПГаЬсЯзЮщГфХБЧЮжиЖм","щфТЦБЙПоъЙэнцШШАНлИУЭВеуоЕкрДРызВСДЯЧЪКЛХТымьПГАЬсязющгфХбЧЮжиЖМ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ыуккДМшпжтбВнчаыдЛчЛЮцъЩССЪФхяЗВяатЭзрьеУИЬНгиРЙОМФЭойгЮЦпжбхеЩШ","ЫУккдМшПжТбВнЧАыдлЧлЮЦъщСсъФхЯзВяАтэЗрЬеУИьнгиРЙОМфэоЙгЮЦпЖбХещш"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("зВЬОйцраИЕЬпМэщхдУнЛэЪЛЪЫЦПйФЧБтгСщЖмзКюЯЧНхЫуШюаШерСяЖДбтвокфиг","ЗВьойцрАИеьПМэЩХдУНЛЭъЛЪыЦпйФЧБТгСщЖМзкЮячНхыУШюАШеРсЯЖдбТвОКФиг"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ЯящБмзфрпжЭЩДемКЫьлЙеЪНОСТКвжгФлАпгхаэЮЪБЗДЫуОЧсциврйшшХтЧиюуьЦн","яящБмЗфрПЖЭщдеМКЫьЛйеЪНосТкВЖГфЛАпгхаЭЮЪбЗдыуОчсЦивРЙшшхтЧИЮуЬцН"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("хПЩдяСККЭЪлХАдгЭытюлжнЪРгЯЬПуЗУЙОюиОЫЧЕЙЦинЬваМРЧцСФмбщшбЗштвЕФж","ХпщдЯСККэЪлхАдГЭЫТюЛЖНърГяьпУЗуйОюиоыЧЕйцИньВаМРЧЦсФмбщШбЗштвЕфЖ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("НЫбзРгтуПОЬшЮКлРЦпБЭТСуэОАфзаЩъкДСьвЯюхыМЕИЕхжЙвЯднЙжЧФъЦЛШЧМиГщ","нЫбЗРГтупОьШюклрЦПБэТСУЭОАФзАщъкдСЬвяЮхыМЕИехЖйвяднйжЧфъЦЛШЧМИгЩ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ВуЫЦДБУЧгтрЕпШДЪщбляшГКэЛэяХхЖОВзСжАФпМКюФъНьИСюМЧщзыИРНЦТЙоАЙьЕ","ВУЫцдбуЧГтРеПшдЪщбляШГкэЛЭЯхХЖОвЗСжАФпмкЮФъНЬИСюмчщзыиРНЦТйоаЙЬе"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("шФМщРУДЖЬшУБРпеацНЗЦЛсюЧГАйТГыФЛНЖОМХККъИЯющэПЗоХвсЪедИтБЫЭвЬЧЯй","шФМЩруДЖЬШУбрпЕАЦНЗЦлсЮЧГАйТгыфЛНжомхККЪияЮщэПЗОхВсъЕдИТБыэВЬчяЙ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("лЩцДоцэЖяЩВККтиРГзХТнЗъмваыУНчХУЬОббМЙфпюАЛчЫРеЕШЯъИГСйЭюЬжПСДшФ","ЛщцДоЦЭЖяЩвККтИргЗхТНЗЪмвАЫУнЧХуЬОбБмйФпЮаЛЧырЕЕшЯЪИГсйэЮЬжПСДшФ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("цРЧацивйЕМЩхЭДЫиФпгЫякУЩъЭМеДвЧЛБЙЖьОбХсъПСТЖЛьзНОЮфЯнргТашуюЗШК","црчаЦИвйЕМЩХэДыИФПгыЯКУщЪэМедВЧлБЙЖЬОБхсЪПСТЖльЗНоЮфянРгтАШуЮЗШК"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ЛЩцМФДРэйАяаЗбжнЬЗНокоСЧПиБххШэДЩЮряеЕТЧюилУВЫьжЦКЪфуЪГтМшЫпЙсвг","ЛщцМфДрЭЙАяАЗБЖНЬЗНокОсчпИБхХшэДЩЮряеЕтЧюИлувЫьжцКЪфуъгТмШЫПЙСвГ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ЭадШЯгцэынОРслЩоюЬмАЖйхШТЧйБИетГъЯрНУьПъЫлкМЖвщИЗСЮЗуФДФЧцвкпхЕБ","эАДшЯГцЭынорСЛщОюЬмАЖйХштчЙбиеТГЪЯРнУьПЪЫлКМЖвщизсЮЗуФдФчЦвКпХЕБ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ИйАнГышчъНблрэОаЮьмлтЕсвФшрэкюхпГДТдХМяСцфжщяЧЖйВЪщкебУЬоыЦзиузп","иЙАнГыШчЪНБлрЭоАюЬМлТЕсВФшРэкюхпгдтдхмЯсцФжщяЧЖЙвЪЩКебуЬОыцЗИузП"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("щХГаоцеЪэХГяЖЛФдыЮИТцмзКбЕЙюКяЩьТЫУфвьШсвЭмСлАрчНоИъуРпдПшзЙЧЖНб","щхгАОЦЕъэхгяжлФДЫюИТЦмзКБеЙюКЯЩЬтыУфвьшСВЭмСлАрчноиъУРПдпШзЙЧЖнб"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ИртЭаГЮтУЖАехМщГИпзУлРВшвБЮьЬйОЭхчСЯфлЧдЦМеЪЦЫОкйЫпндФзЪКЖБШщясн","ИРТэАгЮтуЖаЕхМщгиПЗУЛРВШВбюЬьЙОэХчсЯфЛчДцмЕЪцыокйыПндфзъкЖБшЩяСн"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("юБиЙРснкяЩЖНЛцЖГаМщБэЛфеЕяЗыМоЧцЧйшпШъутОтПХьфЬВъУвХДКСАЮГЫЗдрэи","ЮБИЙРснкящжНЛЦжгаМщБЭЛфЕеяЗыМочцчЙшпШЪУТОТпхЬфЬвъувХДКСАюГЫздрЭи"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ГЧУЛЙъМЕОнГЮШывмдИЯскУОЮЬцеПСнПижЖтытЩцРчЬКщЙххбШзэаФДбВРфяаъЛЗэ","гчуЛЙЪМЕОнгюШЫВмдияСкуоЮьЦЕПСнпИЖЖТыТЩцРчьКщЙххБшзЭАфдБВРФЯАЪЛЗЭ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ОДщгЫХЬюгбКпрАЕРубъъыХлскЭНиПйяоаУИЙчсФнзеЗЭТмМшювЦЬлФЯцДВШЖЖЧтЩ","одЩГЫхьЮгБКпраеРубъЪыхлскэНиПйЯоауийчСфнзезЭТММШЮВЦьлфЯцдвшжжчтщ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ЭГсхЮзИцСрУнфТяКЖЬЪЯЧЩайгхВчпИаЦЙТефкЕДЖЭюлШщоОШМЗбдърПВБЫьнУМыЛ","ЭгсхюзИЦСрУНФТякжЬъЯчЩАйгХВЧпиАцйТефкЕдЖэюЛШЩооШмзБдЪРПВБЫЬнумЫЛ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("йЯнГЧэБиФшжвЧнюГЭлУюмЫиСДпжСпЯлцЕоУТДЪВЫЪЙЦЩрХкьРекщХоьзМфтЗБашА","ЙяНГЧЭбИФШЖВчнюгэлУЮМЫИСДпжсПЯЛцеОутДЪВыъЙцщРХкьрекЩхоЬзМФтзбАша"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ШкеЦЭчКвЗщВСгЖХмйдомшиЫцНйДеаПпЪрЫТфЖлГОзСляЮюбрЯуЪАУэИЧтФьхНБьЩ","шкЕЦэЧквЗЩВСГжхмйдОМШИЫцнЙДеАПпърЫтФжлГоЗсЛяЮюБряУЪаУэичтфьХНБЬщ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ЧэйТнДЦЪпЫфдкЬБмСХцМиашбВоРЬЮФоиыЪжАтюЕЭззсуГЕЛгЩйнЖПшкщРяУчВхЯл","чЭйТндцЪПЫфДкЬбмсХЦМиАшбВорЬюФОиЫъЖАТюеэЗзСУГелГщЙНЖпшКЩряучвхЯЛ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ЭЙПпуааОЗчягИмШОЩеФЮСДСЬлЮВТъЦцЖмыхДКшвргЬэФыХекТбБяНщчрЖНЙУъзЛи","ЭйПпУААОЗЧягиМшощефЮСДсьлюВТъЦЦжмЫхДКШВРгьЭФЫхЕКТБбянщчржНЙУъЗЛИ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ЖсвЪЕхЗшДЕЫюИыЯиЦэгМрофкЬФбНаВУпжМКНгзййУэрТпСЩдЩЧЛюохтШЧЯБЪьЛЦа","ЖСВъеХзШдеыЮиЫЯИЦэГмроФКЬфБнАвУпжМкнгЗЙйуэртпсЩДЩЧЛЮОХтшЧЯбЪьлцА"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("очИшГАКтштЕОЫрЛЛрХЬЮВцЕЭЯСювНЦПНдЖукФбмхуАядЪЗИзПЩСФЫэЪЧЖйГщЙбмЬ","ОчИШгАКтШТЕоЫРлЛрхьЮВЦЕЭЯСюВнЦПНДЖуКфбмхУаЯДЪЗИЗПщсФыЭЪчЖЙгЩЙБмь"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ЫОМпвШрэеХУфцЫьМЧщДГуъяАбэЪлИАЛйсЮкФЙИжхнкНзГБцзЬЯтщЮевЖдШРтПЧОС","ЫоМПвшРЭеХУфЦыьмчЩДгУЪЯАБэъЛиАлЙсЮКФЙИжхнкНЗГбЦЗьяТЩЮевЖДшРТПчОс"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ТПОЮТжИЩьХЛЙШЧГШВГьръСцдоАэЗвчхАюУбМкуСРЕКйжямщДцбъЗэпНлфИЫяЫФне","ТпОютЖИЩьхЛйШЧГшВГьрЪсцдОаЭзвчХАюубмКуСреКЙжЯМщдцБъЗЭпНЛфиЫяыФнЕ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("рЖедРЙЗвКТЯгЭБаьчХЦноИэЛЫБЫмМсгаВцПфюьФлЧЩеШъЮНтЗдйЖИПУщуъОЯшхКс","рЖеДрйЗвкТяГЭБаьчХцНоиэЛыбЫМмсГаВцпФЮьфЛчщеШъюнтзДйЖиПУщУъОЯШХкС"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ИЛшТиЛЬэКЗЪрйЫгщчзжмНнсМЩйукбБЬшОВОфюыЮАфяТАВцСцхДДхеЭЖчЕРъпупгя","ИЛшТИльЭкзъРЙЫгЩЧЗЖмНнсмЩЙуКббЬШОВофюЫЮАФЯтАВЦсЦхддХеЭжчеРЪПУпгЯ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("знЙгчНЮехмЦФОПцШЫаиыВРТЕЛйЧПВСуЛЗЮьЯКоХдмТБГДКЪаЭУшъиРФяЖЩЬЭСБщЖ","ЗнйГчнЮЕХмцФопЦшыаИывртЕлЙЧпВсуЛзюьЯкоХДмтбгДКЪаэушъИРФЯжщЬЭсБщЖ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ДкжъюрфМГтцгМЗЛПдкнэЧлсъыЭРобЦйчЗТжахУСхИишйЬяЕУЬВПБяЩнщоЕшыфаЮВ","ДКЖЪЮРФмГтцгмзлпдКНЭЧлСъЫЭрОБЦЙЧзТжаХУСхиИШЙЬЯеуЬВПБяЩнщОешыФАЮв"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("щжтпЗионмЯЪоБеьбЮЛМЩазччйЙГЬэрШХЖФЦдшаУцЫДгТРсФехюЭлисыввЪкКуняп","щжТПЗИОнмяъОбеьбЮЛМщАзчЧйЙГьэРШХЖФЦДШАУЦыДГтРСФехюЭлисывВЪккУНЯп"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("шСФнГласвЗчЖНРДВкпжыЙТЗЫФмощелцЧЭюЩбЬЪЯюПУьихРугЦтшдбЙАЯхЭкИЪМео","шсФНглаСВЗчжнРДВКПЖыйтзыфМОЩЕлЦчЭЮЩБЬъЯЮпУьИхрУГцТшДбйАяХЭкиЪМеО"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("уКРчЩЗЭъоОЗАКыЮЙИЮЪГЭмвптгшьжЩлМЧлЦРХехЯЫфсДтуинаВбцпФДйСьЯЕшжнб","УкрчЩЗэъоОзаКЫюЙиюъгэМВптГшЬжЩЛмЧлцрхЕХяыФсдТУинАвБцПфДЙСЬЯеШЖнБ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("СрДПЪШюУЗЯъЩИйюЦыОАШГоиечРспГЭЬыУЯМВщЗЦЛЛэКБфДФжхжТННЕвЙкьМБТАхЧ","сРдПЪшЮузЯъЩиЙюцЫоАШГоИечрСпгэЬыуЯМВщЗЦлЛэКбфдфЖХжтннЕВЙкьМбтАХЧ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ЗЪбэиоУцмАцУНрфПыяТЩЬвсДЙЮЖнтиляЛшйсыхедКЧБАШрВХьчокгмпФзЕЖэЩгюъ","ЗЪбЭИОУцМацунрФПЫЯтщьвСдйЮжнТИлЯЛшйСыХЕдкчБаШрВХЬчокГмПфЗЕжЭщГЮЪ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ЯшЖИЮчсЪКевьзгрфжЫнЙАОюпМЩПрЦМнчдбхКЛСфыЬТЗДоэшвУТЭуХЛЯищЪГЦбаеЙ","яШЖиюЧсъКеВьЗГрФЖЫНйАОЮпМЩПРцмнчДБхКлсфыЬтздОэшВУтЭуХЛяищъгЦБаеЙ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ЮЦнСЧЭЭФтяхлмЯЩФаХЪСшМОЙОЪыТрУГиЬвиАБщеКрЖЕПЧЖюЙЛЗцкЫВДПуБньгДЗш","юЦНСЧээФтяХЛмящфАхЪсШмОЙоъЫтругИЬвИАбЩЕкржЕпчжЮйЛЗцКывдпубНьГДзШ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ИюцдШЫяАпьЦяъМеОРщНсФдЫбвзпзРншИюЬМлГжТуЙфЖЩткЪЭеБХгУчЛКчаВхСЙОэ","ИюцДшЫЯапьЦЯъмЕОРЩнСфДЫбВЗпЗРНШИЮЬмЛгжТуЙФжЩТКъЭеБХгуЧлкЧаВХСйоЭ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ОншЛЭБъЮЧГьВтуГИеЗлкньмЭОВЖЮЪКщХУЯйЩжаПрЫРиПТбДАзхЕЫСЦСФяДфчцшМЙ","оншЛэбъЮчГЬВтуГиЕзлкНьмэовжюъкЩХУяЙщЖапРЫРиптБдАЗХеысцСФЯдфЧцШМй"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ЯНшлДмдццБРХйяМнпиозхТвЧлтпйЭбжвчУаЫезкЖЪФЮерЭьфащСъШГоЩьыСуГкИЮ","яНшЛДМДЦЦБрхйЯМНПИозХтвчЛтпйэбжвчУАЫеЗкЖЪФюЕрЭЬфАЩСЪшГОщЬысУгКИЮ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ЦУяэДГуАфЬсГщМБЖрПЭртеЧоЪыксЙХвюПЬзЗШВФщъЛШЛЧИмнхЮЯБкДаИнжТОЦыЙЕ","цУЯэДгУАфЬсГЩМБжРпЭртЕчОЪыкСЙХВЮПьзЗшВФщълШЛЧимНХюЯбкДаиНЖТОЦЫйе"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("щюЧжкуРугОвфгпДтдяШЕъщХцнпСкюЗяиАЬБЙсЛэОйЛчТШВыхъБнеиРыЬАЖмФэзцм","щюЧжКУРУГовФГПдТДЯШеъщХЦнПсКЮЗЯиаЬбйсЛЭоЙЛчТШвыхъБнЕИРыЬАжмфэЗцм"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("эякТтуеЗЗУмпчьДИОИжчЭъРАыЫЦХФШйябХкгащлшЬПжгЪМЩОЦйнСНБРЛфвВюСюЕд","эякттУЕЗЗУмпчЬДИоИжЧэърАЫыцхфшЙяБХКгАЩЛШьпЖГъмЩОцЙНСНбрлфВВЮСЮЕд"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ЦкоИЙкееЩЫЭвъдцаоыфСЙщтбяАЬЛьжънЯзБЗПХПшчУиСТНМЮМГюхЭрфГЛЧДрШжуВ","цКоиЙКееЩЫэвъдЦаОыФСйЩТбяаьЛьжъНЯЗбзпХпшчУиСТнмЮмгюХЭрфглчДршЖуВ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("дЛИзмБЪоЧюУДхФЩСАрфТОеХЪСЬшыВЯБмЙыВчкщЖйГиаЦтнжЦуЯКШпЭЭгрЛПНЗЕьЮ","ДЛИЗмБЪОчюУДхфщсаРфТОеХЪсьшыВябмЙЫВчкЩЖйГиацтНЖцУяКШПЭЭГРлпнЗЕЬю"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("фрЦфЫхВХЯуУиМшеьрггпОщЮкзпьвБАНДЛчйЛйЧЫЪНщиОЖцЮетДяэЪМСТШсАкЖЗбэ","фрЦфЫхВхяуУИМшЕьРГгПОщЮКзпЬвбАндлчЙлйЧЫъНЩИОЖЦюЕтДЯэъМсТшсакЖзБэ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("СлвУычЩЬЗЗЭЭбикашяЛШТМЯИъЮКдХцГЖЙАГуПъОЧСйХЮфДмщнжОтрнпефЫбеЦЬВр","слвуыЧщЬЗзЭЭбикашЯЛшТмЯИъЮкдХЦГЖЙАГуПЪОчсйхЮфДМщнжотрнпЕФЫбецьвр"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("вЛЖцЧдФУбЫпмоиФшТгЗЮЖвКзйХшТеСдЭАясНеЮЛрщЙхоАЪЪЩУиЬцнМЭрпЬчяБГкЫ","ВлЖцчдфубЫПмОифШТГзюЖвКзЙХШТЕсДэаяСнЕЮЛРЩЙХОАъЪЩУиЬЦНМэРпЬчябгКы"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ХМЦЭЛцсЯжзЖЮЕабщКшнМТЬвкГрРЙдЫТчГазВъсЯчОШиНЛЕДхоЙЭФыупФЮУЪщПБиЬ","хМЦэЛЦсяЖзжюЕАБЩкШнмТЬвКгррйдЫТЧгАЗвЪСяЧошинЛЕДХОйэфЫУпФЮУЪЩПбИЬ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ЬиЬРВШуБХМаЧЭТзФбсхоЮЪюкпШРыдЩкйГЕЖцлнМуТВДИэсжпЕНзЧаыщГйофЯлЯъц","ьИьрвшУбхМАчЭТзфБСХОЮЪюкПшРЫДЩКЙгЕЖЦЛНмУТвДИЭСжПЕнзЧаЫЩГйофЯЛяЪЦ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("МнстоабьбгИПШФТдРЕЦОЦЭэыйьРвявъЫичХЧмЩюЛКУдлЪУАЗЖЖЗснЕХшящКпГюФЙ","мнСтоаБьБГИпшфтДРЕЦоЦээыЙЬрвЯВъыИЧхЧмщЮЛкУДлЪУАЗЖЖзСнЕхшЯщКПгЮФЙ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ЕВЬсЩкЦРйкЪПЖэМЛНчыэпрГГДфВшшЩЯднфюоЛЪтОаСхЗУийзТЯюМбЧЫАциУьеХЖБ","еВЬсЩкцрйКЪПЖЭМлНчыЭпРГгДФВШШщЯдНФюоЛътОАСХзУИйзтяЮМбЧЫациуЬЕхЖБ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("СВфЦэФЮаЬытЗХРяБЛеичУСцоЮЗгкКъдЕуРнЯгПоБйЫМьЖднжЩХйлЧМЪЩВШИэАТпШ","СвФЦЭФюаЬЫтзхрябЛЕиЧусЦОЮзгккъдеурнЯГПоБйЫмьЖДнжЩхйлЧМЪщВшИЭАТПШ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ЫЮЩцдФлакреХЧзУлТЕЙЭШКхЪрЖЬжыЬВНДМИиуцоЯСМтюяГЭПбЗПОаЧсШгЩфЪйВБН","ыюЩцДфлакРеХЧЗУЛТеЙэшкХЪРжьжЫьВндмИИуЦОясМтЮягЭПбЗПоАЧСШГщфъйвбн"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ОэИяыЬъТбМоЖСхпЙЯЩТШНАРидШйвЮцЗАмеуЦЭсЛГЩЪкЬрДВфхЫГЧКжпЛучБФюЕЗн","ОэияЫЬъТБМОжсХПЙяЩТшНАРиДШйВюЦзамеуЦэслГЩъкЬрДвФхыГчКжПлуЧБФЮЕЗН"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("БГвФчзуъКбьжЛМхмАДчНрриЗасЕлЮШВЫяцсОтэФдъЯЭщыпЕТПижкГоЬхуйЦюЩйШн","БгВФчЗуЪКБьжлмхмадЧнРРиЗАСеЛюШВЫЯцСоТЭФдъяЭщЫпЕтПижкгоЬхУЙЦЮщЙшН"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("эмЧГкЙШоУлСицтндаЕЖъЗарЙфкиеТВсЦмнфпъБхдяящПЮьхчЮЩЬузбЖГыЭРылвШо","эмчгКЙШОУлсиЦТндаеЖЪЗАрЙФкиетВСЦМнфпЪБхдЯящпюьхчЮщьузБЖГЫЭрыЛВШО"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("зЩЬТЦИсеБкУшвАЖРгЮШЯЧкаоЪрхЭфНЪМБуЛмОЭыезЖчЙцГИдЫЛйЮПпДсНХфВЬЩЯт","зЩЬтцИсЕБкушвАжрГЮшЯЧкаоЪрхЭФНъмБулМОЭыезЖЧЙЦгИДЫлйюППдСНХфвьЩяТ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("вбуЭЙЛЖйФуЕСбфКСЩъиЪАптДИгЩЧчзРКэаыВПяьМгяНоМХюьЦЗжНрШхШОыецДюлт","ВБУЭйЛЖЙФУеСБфКсщъИъаптдигЩЧЧзРкЭАыВпЯьмгяНОМхЮЬцзжНрШХшоыЕцДЮлТ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ЧЬвЧТКлцЦХшяефаЭЪъкСаБжнФлМерХпйДЗмИидШюуйЬОжбЮЯНсвОзЩУрэщТыГпгы","чЬВчтклЦцХшЯеФАэъъКСабжНФЛмЕРхпЙДзМИидшЮУЙьоЖбЮЯНсВозщуРЭЩТЫгпгЫ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ГаУЙНИЛГмоРАьЭХбИЩвДюЗФПыуКЪЮЖЦТСцМъЗшэТЯрХпоЕкыЖЧвШдЧебЯЩФсйньЛ","гАуйнИЛГМораьэхбИЩвдЮзфПЫУКЪЮжцТсцмъзШЭтЯРхпОекыжчВшДЧеБЯщфСЙньл"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("кОтНмНцффюйлпадухвБчщыШИХЛазяЯйЖЩЗэъцгьРСпрДВуэиЮомчЕТыШЖЪСеБкьГ","коТнмнцффюйЛПадУхВБЧЩыШихЛАзяЯЙЖЩЗэъцГЬрспрдвУЭиюомЧЕтЫшжъСебКЬГ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ЕЬоДюзЭлШЬЯрдэЦюЧЗЪпЩГоЧХЛЙвЕтФШЩжыБРЪЙСПтБНмгакжИЦифаМуяхНЫвкус","еьодЮзЭЛшЬярдэЦюЧЗЪпщГоЧхлЙветфшщжыБръЙсПТБНМгаКжиЦиФАмуяхНывКуС"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ВЧябЖьшЦеимйуЛЭнГЖтщЯЧззрвЕМДЫБсЦьОпсЛЩУФпхнаъэюдХОТЙрюшЪфыКГкАи","вЧЯБжЬшцЕИмЙулЭнгжтЩЯЧззрвЕМдЫБсцЬОПслщУфпхнАъэЮдХОТЙРЮшъфыкГКАИ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("кьцМЯжзИУдЭвыЭръаСЯЛщФрпГЕОЦОНЬГщмшТИлхтБкзсЖхчЕЙюдфПЧЪбАйыюНУВШ","кьЦмяжЗИудэвЫэРЪасЯЛЩфрПгеоцоНЬгЩМШтИЛхтБкзСЖХЧЕйюдфпчъбаЙыЮНУВШ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ГжДУлСВиФПОЬмХЫйюъКЧлыярмьэжЩачобЩРНЦЙХИНЭЗДгТКТпШАюфзЯсвБШуцеъе","гждулСвиФПоЬМхыйЮЪкЧЛыЯрмЬэЖЩачобЩрнЦйХИНЭЗдГТКтПШаюФЗЯСВбШуцЕЪе"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("МйАКфХЭызСПЮлРТЕкфЧюЖЭмЬЗТиуШццвНщоЖГГЯШдЫЙбХлОАьБЯучдеВсНПъИщъР","мйАкФхэЫЗсПюлРТЕКфЧЮЖЭМЬзТиушццвнЩоЖгГЯШдЫЙБхлоаьбЯуЧдеВСНПЪиЩЪР"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("КСХЖЩГМоНьйЫДОУыйЛчгВЭФюшитФбЕалшПзвЮхКЧтЩяЯуаРЦьемзэЪъцИржБДнСп","КсхЖщГмОНЬЙыдОуЫйЛЧГВЭфюшИТФбЕАЛшпЗВЮХкЧТЩЯяУАРЦьемзэъЪцИржбДнсп"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ющсоКНХеЙАЬЪгылЯЧъСчШвюЕКжиФШбзДйЬяруЦфиВУгЛОдАэмпЗЩМэХБнрпцЫТТЖ","юЩсОКНхейаЬъгЫлЯЧъсчшВюекжИФшБздйЬяРуцФИВУГЛОдаЭМПЗщМЭхБнрПЦЫТтж"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ГоНеКюшщВдЦТхЗЕтСРХаюуьъйКвЯлиЫбСБмЭШчЬИЗОПуфэжфчяыНрЙЪЦдПмЛжГАщ","гОНЕкюшщВДЦтхЗеТСРхАЮУЬъЙКВяЛиыБсБмэшчЬИЗОпуФэжфЧЯЫНрЙъЦДпМЛжгащ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ЭЬСУхшЩРгцХБЫВМмоЩтрЖсаИычлУНТйэвЧЪЬлЕойнюЖзеффЪзцкяиПюАГшпяДДКБ","ЭьСуХШЩргцхбЫВммОЩтржСаиычлУНтЙэвчъьлеОЙнюЖзефФъзЦКяИпЮагшПядДкб"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("эБйгуШжьКЩьцчзтрчАХыНуЫТиВЕВЯЮягюэПЩИСЛФжОСМОъехмрЙпБДЗФНЪцКШАЛД","ЭбЙГушЖЬКщьЦчзТРчаХЫНУытИВЕвЯЮЯгюЭпЩисЛфЖОсМоъеХМрЙПБДзФнЪцкшаЛд"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("жнЛнЗоВХМЪХМоеЦвАУлпщАтяЭуяЫИюЧеЧШГщСэФдфгбЮиРъцйрзкЬкТПдЖйЫСьБШ","ЖнЛнзОВхмЪхмоЕцВаУлпщАтЯэУЯЫИЮчЕЧШГЩсЭфдФГбюИРъцйРзкЬктпджйЫСьбш"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("НДсяоЛшумъЙьЦляжпиюБИоУГцывпхмсАКщрфэЕдШЙТеыбХфГТЩччЬюЗАкржЭЗвнЪ","НДСяоЛшУмЪйЬцЛЯжПиюБИОуГцЫвпХмСАкщРФэедшйтЕыБХФгТщЧчЬюзаКрЖЭЗВнЪ"));
}
CTEST(Cases_compare, hebrew)
{
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("טמאעוציזסנשךכגדתבץחלקןהרףםפ","טמאעוציזסנשךכגדתבץחלקןהרףםפ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("כצנמץיחזדהךגתטרעפלןשםקאוסףב","כצנמץיחזדהךגתטרעפלןשםקאוסףב"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ונצפהאףץךדתיטמכקברלםחעגסןזש","ונצפהאףץךדתיטמכקברלםחעגסןזש"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("תאהפרבםךץידזנעכןוטמחגסלצקףש","תאהפרבםךץידזנעכןוטמחגסלצקףש"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("שץדרהטזאעתפבלכםויסצףחנןגמךק","שץדרהטזאעתפבלכםויסצףחנןגמךק"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("חטצתיןלשףקםגרךנזאץבופדסמכהע","חטצתיןלשףקםגרךנזאץבופדסמכהע"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("שלםגברהןתעכזץוחדמנאיסצפטךףק","שלםגברהןתעכזץוחדמנאיסצפטךףק"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("זכעחןקבסצדשתהץםלףאנךגימפוטר","זכעחןקבסצדשתהץםלףאנךגימפוטר"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("םדןחמזעאולפהגציךתקרףנץכשבטס","םדןחמזעאולפהגציךתקרףנץכשבטס"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ףנזךץחהמטעארגבדלןוסצםכתפשקי","ףנזךץחהמטעארגבדלןוסצםכתפשקי"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("מגנכךםילשבעצאספזתןץקהטרוףחד","מגנכךםילשבעצאספזתןץקהטרוףחד"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ןשפתכגדףנץאסטצזמהחעירךםקבול","ןשפתכגדףנץאסטצזמהחעירךםקבול"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("למקזנץבםוךכירטגןהאשתדפצחףעס","למקזנץבםוךכירטגןהאשתדפצחףעס"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("בקעוץיספתלןרנשדמאכףחגךטצזהם","בקעוץיספתלןרנשדמאכףחגךטצזהם"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("דלומכסיצףפאחץשתטעברנךזןגהםק","דלומכסיצףפאחץשתטעברנךזןגהםק"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("דצשתסקניןרלךפאעטהבגזוףכמץםח","דצשתסקניןרלךפאעטהבגזוףכמץםח"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("רדכעץבאסגןףםשטקלנותצימחזהפך","רדכעץבאסגןףםשטקלנותצימחזהפך"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("בסךצץקיגתחדלנמפזםףארעכוהטשן","בסךצץקיגתחדלנמפזםףארעכוהטשן"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("םמלכתעצקןץפיברדסאטזךנףשוהחג","םמלכתעצקןץפיברדסאטזךנףשוהחג"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ןסליזמצשתגחנרץוךכםקדהטבפאעף","ןסליזמצשתגחנרץוךכםקדהטבפאעף"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("תהבלרחשפאזץדןנכוטףךצקגיסעמם","תהבלרחשפאזץדןנכוטףךצקגיסעמם"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("גכפשםףלןוסאחנימץהךבטעזקתרצד","גכפשםףלןוסאחנימץהךבטעזקתרצד"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("טיהדלףץאעזתךקסבמפרגצשונםחןכ","טיהדלףץאעזתךקסבמפרגצשונםחןכ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("הגעטחסזנמדבצךםףלקותץפכשיאןר","הגעטחסזנמדבצךםףלקותץפכשיאןר"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("אץצנכחסםדלמוקפעהתזבךטףישרןג","אץצנכחסםדלמוקפעהתזבךטףישרןג"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("וטרנתסיזצמשפךלחגבאקםדףהץכען","וטרנתסיזצמשפךלחגבאקםדףהץכען"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("עךפבץשטםיזכצמתגהדאחנוןקסלרף","עךפבץשטםיזכצמתגהדאחנוןקסלרף"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ץךשצטאספכדתיעורקןףנמזבהחםלג","ץךשצטאספכדתיעורקןףנמזבהחםלג"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ךלפאגחצץרזשתעןכנםטמהדקףוסבי","ךלפאגחצץרזשתעןכנםטמהדקףוסבי"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("זץאכלשספערןצגיםךהףקתמטובחדנ","זץאכלשספערןצגיםךהףקתמטובחדנ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("גחצףאתשןכדבקרמנעהליםוץפךסטז","גחצףאתשןכדבקרמנעהליםוץפךסטז"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("עחבהכפסתוןיגץאמףםזצנךלדשטקר","עחבהכפסתוןיגץאמףםזצנךלדשטקר"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("חספףילזמרגןעוכבםדקךהנץטאשתצ","חספףילזמרגןעוכבםדקךהנץטאשתצ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("צשמםקוףאלטיתרהדנגעךפסחזץבכן","צשמםקוףאלטיתרהדנגעךפסחזץבכן"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("סנוצמיעדכץטםלףןךקתרשאפחהזבג","סנוצמיעדכץטםלףןךקתרשאפחהזבג"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("םרקפבמשסדלזנץיףעךןהצכטחגאתו","םרקפבמשסדלזנץיףעךןהצכטחגאתו"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("וקפגשרזצמחךבסנכיףעהםלתןץדאט","וקפגשרזצמחךבסנכיףעהםלתןץדאט"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ףטעלהפבךםשרןאימץגתסזקחצכדנו","ףטעלהפבךםשרןאימץגתסזקחצכדנו"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("דצףסתזינטשהאבלגקךוםןחעפכץמר","דצףסתזינטשהאבלגקךוםןחעפכץמר"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("םחיכבקגןשףתדטסזצומפראלנהץךע","םחיכבקגןשףתדטסזצומפראלנהץךע"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ןטזפלםףתץגבאכושידרחהצךסענמק","ןטזפלםףתץגבאכושידרחהצךסענמק"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("גןאףבטכסריץצתדהמךשלקועפםזחנ","גןאףבטכסריץצתדהמךשלקועפםזחנ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("עתפורץאקבשזףלךחםכניצסטמדןגה","עתפורץאקבשזףלךחםכניצסטמדןגה"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("תרנםףחשןבכלדטהיגוספאקצזמעץך","תרנםףחשןבכלדטהיגוספאקצזמעץך"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("מונהתיעדץךקשםאצסןטזגףרכפבלח","מונהתיעדץךקשםאצסןטזגףרכפבלח"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("סבעלאזהפשגרטיוםץכףמןקךצנדחת","סבעלאזהפשגרטיוםץכףמןקךצנדחת"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("צםינמבלרזכךטחסעןאתףוקשפהגדץ","צםינמבלרזכךטחסעןאתףוקשפהגדץ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("םיפאשחעדןכטבתמזףץהוצסלנרגךק","םיפאשחעדןכטבתמזףץהוצסלנרגךק"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ךטףלםרתמנגןכץעחדספוצאזיהקשב","ךטףלםרתמנגןכץעחדספוצאזיהקשב"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("שיךצלכנגףחבסןמערתםזטקהודאץפ","שיךצלכנגףחבסןמערתםזטקהודאץפ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("עזמאסשפיםרקוגץחבטלןדהףכךתנצ","עזמאסשפיםרקוגץחבטלןדהףכךתנצ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("חלבםנתטעכךףמןשזקץהצאסדפרויג","חלבםנתטעכךףמןשזקץהצאסדפרויג"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("קנירדשסצםפאףגךכטןעתמהובלחץז","קנירדשסצםפאףגךכטןעתמהובלחץז"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("זבצשכןאיחומעתגףפרקסלץטםהדךנ","זבצשכןאיחומעתגףפרקסלץטםהדךנ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("קתוחכרפנעגלאציץדךזבףהםמןשסט","קתוחכרפנעגלאציץדךזבףהםמןשסט"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("םףאושזבתחפנקןלעמצגטךירסדהכץ","םףאושזבתחפנקןלעמצגטךירסדהכץ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("תךחגדקטםמפףינאסהבלרשזצוץעכן","תךחגדקטםמפףינאסהבלרשזצוץעכן"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("סבשגלףחךצתדפםןירהוקכמץטנאזע","סבשגלףחךצתדפםןירהוקכמץטנאזע"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("תקםופךףחאדטישזהלכענברץגסןצמ","תקםופךףחאדטישזהלכענברץגסןצמ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ףדפגלךםטותקזצשנירסהמכןחעץאב","ףדפגלךםטותקזצשנירסהמכןחעץאב"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ןםתרףכחץאעסצהמגבךוישנזפדטקל","ןםתרףכחץאעסצהמגבךוישנזפדטקל"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("מהץןףךרואבדיתזסםעקלשנגצחפטכ","מהץןףךרואבדיתזסםעקלשנגצחפטכ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("צףץאיטןבפתםכהחמקוזגדרלענסשך","צףץאיטןבפתםכהחמקוזגדרלענסשך"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ץמאעקיצושסםלפתףזחנןכךטהרגבד","ץמאעקיצושסםלפתףזחנןכךטהרגבד"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("עףטןסקכתשלץםגמחצבוינזאדךפהר","עףטןסקכתשלץםגמחצבוינזאדךפהר"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("לץעםפןתמףטךנחשצהדבקריסגוכאז","לץעםפןתמףטךנחשצהדבקריסגוכאז"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("כסךעצגקהזןנשרםוילףתחדץאבפמט","כסךעצגקהזןנשרםוילףתחדץאבפמט"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("זנהרילשטץמדוסתףחכםאעגךצןפבק","זנהרילשטץמדוסתףחכםאעגךצןפבק"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ץוםמדףטאחלנשסרבתזצפךןכגקעיה","ץוםמדףטאחלנשסרבתזצפךןכגקעיה"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("זסךיטמהתןצףקעגאבץםדורפכלשחנ","זסךיטמהתןצףקעגאבץםדורפכלשחנ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ןסקהנוךצפלשבזםטרףיחגתמאעכדץ","ןסקהנוךצפלשבזםטרףיחגתמאעכדץ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ץלרקתכפאףהעסבטגםמישזצחוךנןד","ץלרקתכפאףהעסבטגםמישזצחוךנןד"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("קדתבםיןאגחךעפנסלמכהטוץףזשצר","קדתבםיןאגחךעפנסלמכהטוץףזשצר"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("צכהופבמםןזסדעגלקשרץיטףךנאחת","צכהופבמםןזסדעגלקשרץיטףךנאחת"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("דרתאעקןשהךצזנחגבילפףכמטץםוס","דרתאעקןשהךצזנחגבילפףכמטץםוס"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("אטערנזםוהןסצקלפחךדףגיץשמתבכ","אטערנזםוהןסצקלפחךדףגיץשמתבכ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("בולטץסםזקדארףמכךניןצתפחעגהש","בולטץסםזקדארףמכךניןצתפחעגהש"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("עמפהגםצקדףאלטנןץשסיכתרךבזחו","עמפהגםצקדףאלטנןץשסיכתרךבזחו"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("לסףזבכטחפתנםגוירעןץצקהאךמדש","לסףזבכטחפתנםגוירעןץצקהאךמדש"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("בםןוחנגדאךשפהרמעצץיטתלכקףזס","בםןוחנגדאךשפהרמעצץיטתלכקףזס"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("כטנרץעחפקםשאלבמצתגךסףידהזןו","כטנרץעחפקםשאלבמצתגךסףידהזןו"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("נמיכתקרצפחףאךןבסזםשהץגלדטעו","נמיכתקרצפחףאךןבסזםשהץגלדטעו"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("קמםבץשסנגחיפהןתאעטצףלדךוזכר","קמםבץשסנגחיפהןתאעטצףלדךוזכר"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("אםדןחףעמזבכנגץשלסטצרהתיךוקפ","אםדןחףעמזבכנגץשלסטצרהתיךוקפ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("יבפתץלםחזךסגרועדהףאשנטכצקמן","יבפתץלםחזךסגרועדהףאשנטכצקמן"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("מהגטנצץכשסארךקדתםףןעליחזובפ","מהגטנצץכשסארךקדתםףןעליחזובפ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("באטצמסוזהרץכפשתדףליןחגקנךעם","באטצמסוזהרץכפשתדףליןחגקנךעם"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("אחעטןךסדמנקולםתהצבכיפץגשרזף","אחעטןךסדמנקולםתהצבכיפץגשרזף"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ברגאשצקוץכךהיפחלתמטףסדםזנען","ברגאשצקוץכךהיפחלתמטףסדםזנען"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("סועזנשקכחבפםןךףיאץדמהצתטרלג","סועזנשקכחבפםןךףיאץדמהצתטרלג"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("נלאצםעהפכבקשןטיףוגץרחזדתךמס","נלאצםעהפכבקשןטיףוגץרחזדתךמס"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("העןכרקםצתניטפץשבמאגחדףולזסך","העןכרקםצתניטפץשבמאגחדףולזסך"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ןםבורזהחטץנלמקאתכעצךיפסגףדש","ןםבורזהחטץנלמקאתכעצךיפסגףדש"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("טתעףצסרשחנןמדךבהזאלוגפםקכיץ","טתעףצסרשחנןמדךבהזאלוגפםקכיץ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("טצעדתמץשגוןהנףסבקחפאךכזלרםי","טצעדתמץשגוןהנףסבקחפאךכזלרםי"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("עצבמוסרכפדהשגםנקיךלתףןץטחאז","עצבמוסרכפדהשגםנקיךלתףןץטחאז"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("לץפדןםגנקףמעתבשוחציזטהאכסרך","לץפדןםגנקףמעתבשוחציזטהאכסרך"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("סתרגשיעמןלנבטקץודכףאםהזצחךפ","סתרגשיעמןלנבטקץודכףאםהזצחךפ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("נוצגסבףהךקןתלמעכדחאץריזטפםש","נוצגסבףהךקןתלמעכדחאץריזטפםש"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("עמכדוהגשזטפלנךםץיצסףחןתבארק","עמכדוהגשזטפלנךםץיצסףחןתבארק"));
}

CTEST(Cases_compare, arabic)
{
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("زعضبتحةطغأإظئشكءس×اـدذجفؤصرآثخق","زعضبتحةطغأإظئشكءس×اـدذجفؤصرآثخق"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("شةزذصأعـابءئثآتفطخجسحدقرغإؤ×ضكظ","شةزذصأعـابءئثآتفطخجسحدقرغإؤ×ضكظ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ق×سزظصأطحعؤآدبئضغشـذةرجاختثكءإف","ق×سزظصأطحعؤآدبئضغشـذةرجاختثكءإف"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("صآذرإئ×بقـفضزخجسعثظغتأكادؤةحءطش","صآذرإئ×بقـفضزخجسعثظغتأكادؤةحءطش"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("إكخـثظضحؤآسدجعةتازطشبرصذءقئغأ×ف","إكخـثظضحؤآسدجعةتازطشبرصذءقئغأ×ف"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("فآكثطئعأخشذإغةدظؤـزس×قرتبضاصجحء","فآكثطئعأخشذإغةدظؤـزس×قرتبضاصجحء"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("صغزبط×ؤتكشحأظعجذةثفدءاضرإـسئخقآ","صغزبط×ؤتكشحأظعجذةثفدءاضرإـسئخقآ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("كرحدتط×عفشخآأبئجزةقذـاءسضصثؤإظغ","كرحدتط×عفشخآأبئجزةقذـاءسضصثؤإظغ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("زءذث×ضكعرأفشدتقـئطاةظإبسخصحجؤآغ","زءذث×ضكعرأفشدتقـئطاةظإبسخصحجؤآغ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ـةئتظجعكثزبؤطادقصذ×ءسغخفشضحإآأر","ـةئتظجعكثزبؤطادقصذ×ءسغخفشضحإآأر"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("بأزحكآسطخؤذـرغ×فةءعئضقثدصجظشاإت","بأزحكآسطخؤذـرغ×فةءعئضقثدصجظشاإت"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("دشساؤقخأعئطآبجإت×صءذةحكرظفثضـغز","دشساؤقخأعئطآبجإت×صءذةحكرظفثضـغز"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ثعؤةخطسءئأحزدجآرضبفغاقكشظإذ×صـت","ثعؤةخطسءئأحزدجآرضبفغاقكشظإذ×صـت"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ةءدخضتث×صآرفظحكزأبسقإؤجذعـاشطئغ","ةءدخضتث×صآرفظحكزأبسقإؤجذعـاشطئغ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("حفعسزثض×ءخئبذةراـقأظؤغتصشآكطجإد","حفعسزثض×ءخئبذةراـقأظؤغتصشآكطجإد"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ظائإجـثصسةتكقغفءذبؤآشدخرضحزطأ×ع","ظائإجـثصسةتكقغفءذبؤآشدخرضحزطأ×ع"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ضـكطرشدبظآةءتزجصحأخ×ثاسؤغقعفذئإ","ضـكطرشدبظآةءتزجصحأخ×ثاسؤغقعفذئإ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("دآق×ؤشغأطزكظئـةصضءحجثإذساعخفترب","دآق×ؤشغأطزكظئـةصضءحجثإذساعخفترب"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("قرظصضك×فدآثـتسحءغزبشائإطخأعذؤجة","قرظصضك×فدآثـتسحءغزبشائإطخأعذؤجة"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("شع×اطقغرأضزفذثدسكآءةإحظصؤخـبئجت","شع×اطقغرأضزفذثدسكآءةإحظصؤخـبئجت"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("جثسصزرخغعبـأؤةائءظضفإحآد×قتطذكش","جثسصزرخغعبـأؤةائءظضفإحآد×قتطذكش"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ضءقطز×دإغرظاأسعحصـذئتجبآخثكفةشؤ","ضءقطز×دإغرظاأسعحصـذئتجبآخثكفةشؤ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ـئذفآضثتجسزأخاغدصشظقبرطك×عحإؤءة","ـئذفآضثتجسزأخاغدصشظقبرطك×عحإؤءة"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("شغدؤعزطتأـظجسآبثضفكءخإذرئق×ةصحا","شغدؤعزطتأـظجسآبثضفكءخإذرئق×ةصحا"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("أئعضتسإؤةزءفحاـطك×جظقآشصدذثبخغر","أئعضتسإؤةزءفحاـطك×جظقآشصدذثبخغر"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("غةفأضشجئطكبـإخقزءثآسترحذ×عصؤاظد","غةفأضشجئطكبـإخقزءثآسترحذ×عصؤاظد"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("×خقؤعـاشفجأصحةإئرزظضطكثذآغتدبسء","×خقؤعـاشفجأصحةإئرزظضطكثذآغتدبسء"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("أفذآةكحرـجخشؤقبصساغدء×تثضإعزطظئ","أفذآةكحرـجخشؤقبصساغدء×تثضإعزطظئ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("سبفؤأذعصتثئرطج×ـزشحاةضدخقآإءكغظ","سبفؤأذعصتثئرطج×ـزشحاةضدخقآإءكغظ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("صسحجاأدظـعكذآثئشب×زترءقفؤةإضطغخ","صسحجاأدظـعكذآثئشب×زترءقفؤةإضطغخ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ةكث×ءعدسشصغآحظزبرئضـأتذإفقجؤخاط","ةكث×ءعدسشصغآحظزبرئضـأتذإفقجؤخاط"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("آضتأش×ذعسءجطفكقظـصدئرخإةاؤثغحبز","آضتأش×ذعسءجطفكقظـصدئرخإةاؤثغحبز"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("كدجت×ـظضسطشثفءعئبذةصإزأاغخقرؤحآ","كدجت×ـظضسطشثفءعئبذةصإزأاغخقرؤحآ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ضقفجذ×طإشزدؤحاخثةأركعبئظسـصآءغت","ضقفجذ×طإشزدؤحاخثةأركعبئظسـصآءغت"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("صأدظطكث×جاغسحبزةشخئفذرإـضقؤآءتع","صأدظطكث×جاغسحبزةشخئفذرإـضقؤآءتع"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("كـآؤأدزقة×بافصشتذظسغءثطإضخرئحجع","كـآؤأدزقة×بافصشتذظسغءثطإضخرئحجع"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("عأآضزتفؤصح×سذطةئدغظخقثإـكءشرجبا","عأآضزتفؤصح×سذطةئدغظخقثإـكءشرجبا"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("عكأصطظشؤفجدسذح×ئخضزآاإبثـقتةءغر","عكأصطظشؤفجدسذح×ئخضزآاإبثـقتةءغر"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ءغكؤصخش×فابدـعترطأضآزظسجحإئقذثة","ءغكؤصخش×فابدـعترطأضآزظسجحإئقذثة"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ذـغثاضقخزإعفةئؤءسشرطكبص×دجأظآتح","ذـغثاضقخزإعفةئؤءسشرطكبص×دجأظآتح"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ءـظفصذرطسقإغحخ×أئكزضشاتدبثؤةآجع","ءـظفصذرطسقإغحخ×أئكزضشاتدبثؤةآجع"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ظصؤاغثذدـتعآحرجطةءسإقضبشزخكئأف×","ظصؤاغثذدـتعآحرجطةءسإقضبشزخكئأف×"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ثآزصئءةعضأسجقكتفشراـبإغظ×ذحدؤخط","ثآزصئءةعضأسجقكتفشراـبإغظ×ذحدؤخط"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ئآدبذغسظفطجشزقرحءةخكصـعاتض×ؤثإأ","ئآدبذغسظفطجشزقرحءةخكصـعاتض×ؤثإأ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("شغزطرؤآبعسفخءأـظحةصقكدتا×إجئضذث","شغزطرؤآبعسفخءأـظحةصقكدتا×إجئضذث"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("كغؤحظدثإفعسقـئضجء×ذطتآبشرخأصةزا","كغؤحظدثإفعسقـئضجء×ذطتآبشرخأصةزا"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("بأحثءـطصئ×ضدقؤسخكعزشةفذاإظجآرتغ","بأحثءـطصئ×ضدقؤسخكعزشةفذاإظجآرتغ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("كثفةتصءذقبازـظشسطخر×ؤآإغضعجدحأئ","كثفةتصءذقبازـظشسطخر×ؤآإغضعجدحأئ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("كسأذرغجفئحإـزختءظ×بآطةصشضقؤدثاع","كسأذرغجفئحإـزختءظ×بآطةصشضقؤدثاع"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("فءثئـؤقدرإغبحكسذةزصآخطضأعتجش×اظ","فءثئـؤقدرإغبحكسذةزصآخطضأعتجش×اظ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ةجآظؤرض×طزشبكختثقـفأحءعذئغإسصدا","ةجآظؤرض×طزشبكختثقـفأحءعذئغإسصدا"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("رحت×خؤظسدفةصاثغآذعإضـبجئشأطءقكز","رحت×خؤظسدفةصاثغآذعإضـبجئشأطءقكز"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ظاتغبةؤقعدصفآـثخزطضحإأذئرءكج×شس","ظاتغبةؤقعدصفآـثخزطضحإأذئرءكج×شس"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("جؤصسثءطةدزذقأئإرغحفبتشظ×خاآـضعك","جؤصسثءطةدزذقأئإرغحفبتشظ×خاآـضعك"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ضشإثذطؤصرأءكةسئآفدعقاخبتحجـظز×غ","ضشإثذطؤصرأءكةسئآفدعقاخبتحجـظز×غ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("آعؤتقسدئخأغضحز×رءاثبصظـشكطذةجإف","آعؤتقسدئخأغضحز×رءاثبصظـشكطذةجإف"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("خظئكصءتجإازعحأطقـآدثذبرس×ضؤةفغش","خظئكصءتجإازعحأطقـآدثذبرس×ضؤةفغش"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ذكبـغرئجشخاضةطظآءفحدتقثأزؤ×عصسإ","ذكبـغرئجشخاضةطظآءفحدتقثأزؤ×عصسإ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("اظصعإأآءخفطكئؤ×بدثـزقحتذسضةرجشغ","اظصعإأآءخفطكئؤ×بدثـزقحتذسضةرجشغ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("صذبةإئت×سفعثطغجأضدؤـاشقخآحءزكظر","صذبةإئت×سفعثطغجأضدؤـاشقخآحءزكظر"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("طأضفصدظآاذـقئةخ×زجعشإسبحغتثؤكءر","طأضفصدظآاذـقئةخ×زجعشإسبحغتثؤكءر"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("دسح×ظؤفذبقءجشصاغخثإطزرتـضةكئعأآ","دسح×ظؤفذبقءجشصاغخثإطزرتـضةكئعأآ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("خذسطآدكثظبشجزتغقصـؤءأئاعح×فةإضر","خذسطآدكثظبشجزتغقصـؤءأئاعح×فةإضر"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("غكةفجازت×سبأخئقـثضذطإشؤرظصعدءآح","غكةفجازت×سبأخئقـثضذطإشؤرظصعدءآح"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("تدئؤثآعشظخاإطبكأـفصغزرسج×ءحضذةق","تدئؤثآعشظخاإطبكأـفصغزرسج×ءحضذةق"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("قصشسض×أئعخذباغؤةرزفظطءحجكثتإدآـ","قصشسض×أئعخذباغؤةرزفظطءحجكثتإدآـ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ذآءطؤسث×زشضصتقـجبإئاكفخةدغحرأظع","ذآءطؤسث×زشضصتقـجبإئاكفخةدغحرأظع"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("صزآةضخاترعثسئقكحفذإأؤغـ×شءجطبدظ","صزآةضخاترعثسئقكحفذإأؤغـ×شءجطبدظ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ءإسقؤجزآخرطثعبفصةظا×دئذكشغتأضحـ","ءإسقؤجزآخرطثعبفصةظا×دئذكشغتأضحـ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("كثدحتربظئذإسشصغـآءطخزأفق×جةضاعؤ","كثدحتربظئذإسشصغـآءطخزأفق×جةضاعؤ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ضؤءزاـتعثكطرحئدقسأظفإجذصآ×بشةخغ","ضؤءزاـتعثكطرحئدقسأظفإجذصآ×بشةخغ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ؤبعةفتثجخإـرذضئآظقدغاطأشكزصح×ءس","ؤبعةفتثجخإـرذضئآظقدغاطأشكزصح×ءس"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("حظـثءةسغطتقآاذ×فكخؤبأزصئرشعجضإد","حظـثءةسغطتقآاذ×فكخؤبأزصئرشعجضإد"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ذبقأتجطؤئسغضاردإفءآخة×حزثظشصكـع","ذبقأتجطؤئسغضاردإفءآخة×حزثظشصكـع"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("حجشختـضآقسظإؤرءفئغعكذدازةبأصثط×","حجشختـضآقسظإؤرءفئغعكذدازةبأصثط×"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ءسعفثإ×ضحآظاتدصـكذةقؤخرطبزئغجأش","ءسعفثإ×ضحآظاتدصـكذةقؤخرطبزئغجأش"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ظرأإبطشزدغذؤثقحء×سفاجـصضعآكةتخئ","ظرأإبطشزدغذؤثقحء×سفاجـصضعآكةتخئ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("آسؤفظقغـءزأشصجثعخةطحرذضئاإدبك×ت","آسؤفظقغـءزأشصجثعخةطحرذضئاإدبك×ت"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ثـرظزضغكحتقآسعاصءأ×ذؤشةئبدفجإخط","ثـرظزضغكحتقآسعاصءأ×ذؤشةئبدفجإخط"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ءظارآزبئصكؤغـضإشثسحتخدفط×أجعقةذ","ءظارآزبئصكؤغـضإشثسحتخدفط×أجعقةذ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ئإاعطأسظكجذضثدزتآقؤءصةبحشخغ×فرـ","ئإاعطأسظكجذضثدزتآقؤءصةبحشخغ×فرـ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ـقجح×طآعثسغئفزتشكخصرءةاؤإضبظدأذ","ـقجح×طآعثسغئفزتشكخصرءةاؤإضبظدأذ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ذجءبط×زإكأحةصسؤتضخـرظقعثئدفغشاآ","ذجءبط×زإكأحةصسؤتضخـرظقعثئدفغشاآ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("جرـفؤحدزذتئسآصكبخةضق×اإشعغءظطأث","جرـفؤحدزذتئسآصكبخةضق×اإشعغءظطأث"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("اضرصقع×خسبإشتكآزظؤأئفحطغجةدءذـث","اضرصقع×خسبإشتكآزظؤأئفحطغجةدءذـث"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("كتإئذأظؤضثسعةحفشطاـآدخقء×بغزصرج","كتإئذأظؤضثسعةحفشطاـآدخقء×بغزصرج"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("سذقحزطثدأعؤ×برفضخغتـجءآةئظشاصكإ","سذقحزطثدأعؤ×برفضخغتـجءآةئظشاصكإ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("رجإكـبةظشصأا×ضعؤقفزءئتذدثآخطحسغ","رجإكـبةظشصأا×ضعؤقفزءئتذدثآخطحسغ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ظخكسفثؤصءاذبتآضئشقإزجر×طـعحأةدغ","ظخكسفثؤصءاذبتآضئشقإزجر×طـعحأةدغ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("غزدئؤ×بقةحعإءصضأكخـظآطرثاجفشذتس","غزدئؤ×بقةحعإءصضأكخـظآطرثاجفشذتس"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("شتجرظءآبزط×إثذقعصةضأؤدـاخئغكسحف","شتجرظءآبزط×إثذقعصةضأؤدـاخئغكسحف"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("حتضـأطصئبرجشآثد×فخزظةقءذاؤإكغعس","حتضـأطصئبرجشآثد×فخزظةقءذاؤإكغعس"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("كرعئصةش×ءبطآضسخأظـدؤجثذغحزتفاقإ","كرعئصةش×ءبطآضسخأظـدؤجثذغحزتفاقإ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ؤأاـضتظشئإبجزحدط×كخرذآسصةءثفغقع","ؤأاـضتظشئإبجزحدط×كخرذآسصةءثفغقع"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("كثعظف×ءصةسإغتئآأخدذرؤحقشطزبجـاض","كثعظف×ءصةسإغتئآأخدذرؤحقشطزبجـاض"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("عذسخض×طإشقظؤئبثصزرجـاكآءةغدحفأت","عذسخض×طإشقظؤئبثصزرجـاكآءةغدحفأت"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("قتصءدؤشسأـغزبجعطرظةضثخآكإذفح×ئا","قتصءدؤشسأـغزبجعطرظةضثخآكإذفح×ئا"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("شإذ×ؤعآظرزثستةفـجئبطءأادغقحكضخص","شإذ×ؤعآظرزثستةفـجئبطءأادغقحكضخص"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("جآبةصعظـإرفئاأذثخحدقسغ×ؤشكطتءضز","جآبةصعظـإرفئاأذثخحدقسغ×ؤشكطتءضز"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("إضاختذطفجبشظآؤأءئصعزدثرغقسة×حـك","إضاختذطفجبشظآؤأءئصعزدثرغقسة×حـك"));
}

CTEST(Cases_compare, variable_length_checks)
{
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("", ""));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ẞ", "ss"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ẞ", "SS"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ẞ", "Ss"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ẞ", "sS"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞẞ",
                                            "SsSssSssssSSsSSSSsssssssSssssSSsSsssSsssSSssSsSsSSSssSssSssSsSSSSssssSSsSSsSSsSSSSSSsSsssssSsSsSssSsSsSssSsSSSsSSsSSSSsSsSSSSSSSsSSsSSSssSsSSSssSsSsSsSSSSssSSSsSsSssSsssSSSsSSSsSSSsSSsSsSSsssSSssSsSSs"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ßSSẞsSSssSsßSẞSSSSßßSßẞSßSSssẞssẞßssSßßSsSßSẞSßsẞßßẞSSSẞsSẞßßSsSßsSẞẞSSsSSSSssSSsSSSßsẞSssssssßSssßSßẞSsẞẞSSẞssßsSsSSßSẞ",
                                     "SSssSSsSsSsSSSSssSssSsSSsSsssSSSSsSSssSssSssSSSssSSsSsssssSSSssssssssSsSsssSsssSssssssssSssssSsSSssSsssSsSsSssssSSsSSsssSSSssssSsSsSSsSssSSssssssssSSsSsSSSSssSS"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("SßẞẞsSßsSSsSSSssßsSSßSSẞßSsẞSẞsSßSẞẞSSSẞSsSẞsSSẞßsssssßsẞSSßSSßssSßSẞßSßẞSßssssẞßßSsSßssẞSSSSssSßsẞSssßSsSSsẞssSssSßßẞẞS",
                                     "SSsSsSSsssssSsSsSssSsssSsSSSSsSSsSsssSSSsSsSsSSSsSSsSSssSsSssssSSSsssssSsssSsSsSsssSssSSSSsSsSSsSsSsSssSSSsSSSssSsssSsssSSSSsSSSSSsSSssSsSsSSSsSsSSsSsssSSssSSsS"));

    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ᾗᾘᾙᾚᾛᾜᾝᾞᾟ", "ἧιἠιἡιἢιἣιἤιἥιἦιἧι"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("AᾗBᾘCᾙDᾚEᾛFᾜGᾝHᾞIᾟJ", "aἧιbἠιcἡιdἢιeἣιfἤιgἥιhἦιiἧιj"));

    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ﬆẞﬅﬆẞﬅ", "stSsStSTssst"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ẞﬅ", "Sẞt"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ﬃ", "ﬀI"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ﬃﬓ", "Fﬁմն"));
    
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ﬃ", "ﬀI"));
    
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ῲῳῴῶῷῼ", "ὼιωιώιῶῶιωι"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ᾀᾁᾂᾃᾄᾅᾆᾇᾈᾉᾊᾋᾌᾍᾎᾏ", "ἀιἁιἂιἃιἄιἅιἆιἇιἀιἁιἂιἃιἄιἅιἆιἇι"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("aᾀBᾁcᾂDᾃeᾄFᾅgᾆHᾇiᾈJᾉkᾊLᾋmᾌNᾍoᾎPᾏ", "AἀιbἁιCἂιdἃιEἄιfἅιGἆιhἇιIἀιjἁιKἂιlἃιMἄιnἅιOἆιpἇι"));
    
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ῼᾨᾩᾪᾫᾬᾭᾮᾯ", "ωιὠιὡιὢιὣιὤιὥιὦιὧι"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ῒΐῖῗ", "ῒΐῖῗ"));
    
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ևẘẙև", "եւẘẙեւ"));
    
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ᾤὤιᾬὤι", "ὤιᾬὤιᾤ"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ᾤᾤᾬᾬᾬᾤᾤ", "ὤιὤιὤιὤιὤιὤιὤι"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("ﬓﬔﬕﬖﬗ", "մնմեմիվնմխ"));
    
    /* random strings from search results */
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("tesst.ëxämplé.com", "teßt.ëxämplé.com"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("nißan.com", "nissan.com"));
    ASSERT_EQUAL(0, a_icmp_cstr_cstr("americanexpreß.com", "americanexpress.com"));
    
    /* sanity tests */  
    ASSERT_NOT_EQUAL(0, a_icmp_cstr_cstr("ﬆẞﬅﬆẞﬅ", "stSsStSTssst@"));
    ASSERT_NOT_EQUAL(0, a_icmp_cstr_cstr("ẞﬅ@", "Sẞt"));
    ASSERT_NOT_EQUAL(0, a_icmp_cstr_cstr("ﬃ", "ﬀI@"));
    ASSERT_NOT_EQUAL(0, a_icmp_cstr_cstr("ﬃﬓ", "Fﬁմն@"));
    ASSERT_NOT_EQUAL(0, a_icmp_cstr_cstr("ᾤὤιᾬὤι", "ὤιᾬὤιᾤ@"));
    ASSERT_NOT_EQUAL(0, a_icmp_cstr_cstr("ᾤᾤᾬᾬᾬᾤᾤ", "ὤιὤιὤιὤιὤιὤιὤι@"));
    ASSERT_NOT_EQUAL(0, a_icmp_cstr_cstr("ﬓﬔﬕﬖﬗ@", "մնմեմիվնմխ"));
}
